////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

#Область ПрограммныйИнтерфейс

// Возвращает сведения о внешней обработке.
Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.2.2.4");
	
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительныйОтчет();
	ПараметрыРегистрации.Версия = "1.2";
	ПараметрыРегистрации.ОпределитьНастройкиФормы = Истина;
	
	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	НоваяКоманда.Представление = НСтр("ru = 'Реестр сотрудников (для банка)'");
	НоваяКоманда.Идентификатор = "РеестрСотрудниковДляБанка";
	НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	НоваяКоманда.ПоказыватьОповещение = Ложь;
	
	Возврат ПараметрыРегистрации;
	
КонецФункции
#КонецОбласти

Функция СформироватьОтчет() Экспорт
	
	Запрос = Новый Запрос();
	Если ДанныеПоЦО Тогда 
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТекущиеКадровыеДанныеСотрудников.Сотрудник КАК Сотрудник,
		               |	ТекущиеКадровыеДанныеСотрудников.ФизическоеЛицо КАК ФизическоеЛицо
		               |ПОМЕСТИТЬ ВТ_РаботающиеСотрудникиНаТекущуюДату
		               |ИЗ
		               |	РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
		               |ГДЕ
		               |	НЕ ТекущиеКадровыеДанныеСотрудников.ТекущееПодразделение В ИЕРАРХИИ (&Агентства)
		               |	И (ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1)
		               |			ИЛИ ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения > &НачПериода)
		               |	И ТекущиеКадровыеДанныеСотрудников.ДатаПриема <> ДАТАВРЕМЯ(1, 1, 1)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	Сотрудники.Ссылка КАК Ссылка,
		               |	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо
		               |ПОМЕСТИТЬ ВТ_СОТРУДНИКИ
		               |ИЗ
		               |	Справочник.Сотрудники КАК Сотрудники
		               |ГДЕ
		               |	Сотрудники.Ссылка В
		               |			(ВЫБРАТЬ
		               |				ВТ_РаботающиеСотрудникиНаТекущуюДату.Сотрудник
		               |			ИЗ
		               |				ВТ_РаботающиеСотрудникиНаТекущуюДату КАК ВТ_РаботающиеСотрудникиНаТекущуюДату)
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ФизическоеЛицо
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ФизическиеЛица.Ссылка КАК ФизическоеЛицо,
		               |	ФизическиеЛица.ИНН КАК ИНН,
		               |	ФизическиеЛица.Пол КАК Пол,
		               |	ФизическиеЛица.МестоРождения КАК МестоРождения,
		               |	ФизическиеЛица.ДатаРождения КАК ДатаРождения,
		               |	ФизическиеЛица.ДатаРегистрации КАК ДатаРегистрации
		               |ПОМЕСТИТЬ ВТ_ФИЗИЧЕСКИЕ_ЛИЦА
		               |ИЗ
		               |	Справочник.ФизическиеЛица КАК ФизическиеЛица
		               |ГДЕ
		               |	ФизическиеЛица.Ссылка В
		               |			(ВЫБРАТЬ
		               |				ВТ_СОТРУДНИКИ.ФизическоеЛицо
		               |			ИЗ
		               |				ВТ_СОТРУДНИКИ КАК ВТ_СОТРУДНИКИ)
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ФизическоеЛицо
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ФизическиеЛицаКонтактнаяИнформация.Ссылка КАК ФизическоеЛицо,
		               |	ФизическиеЛицаКонтактнаяИнформация.Вид КАК Вид,
		               |	ФизическиеЛицаКонтактнаяИнформация.ЗначенияПолей КАК ЗначенияПолей
		               |ПОМЕСТИТЬ ВТ_КОНТАКТНАЯ_ИНФОРМАЦИЯ
		               |ИЗ
		               |	Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
		               |ГДЕ
		               |	ФизическиеЛицаКонтактнаяИнформация.Ссылка В
		               |			(ВЫБРАТЬ
		               |				ВТ_СОТРУДНИКИ.ФизическоеЛицо
		               |			ИЗ
		               |				ВТ_СОТРУДНИКИ КАК ВТ_СОТРУДНИКИ)
		               |	И ФизическиеЛицаКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
		               |	И ФизическиеЛицаКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресПоПропискеФизическиеЛица)
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ФизическоеЛицо
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ФизическиеЛицаКонтактнаяИнформация.Ссылка КАК ФизическоеЛицо,
		               |	ФизическиеЛицаКонтактнаяИнформация.Вид КАК Вид,
		               |	ФизическиеЛицаКонтактнаяИнформация.ЗначенияПолей КАК ЗначенияПолей
		               |ПОМЕСТИТЬ ВТ_КОНТАКТНАЯ_ИНФОРМАЦИЯ_2
		               |ИЗ
		               |	Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
		               |ГДЕ
		               |	ФизическиеЛицаКонтактнаяИнформация.Ссылка В
		               |			(ВЫБРАТЬ
		               |				ВТ_СОТРУДНИКИ.ФизическоеЛицо
		               |			ИЗ
		               |				ВТ_СОТРУДНИКИ КАК ВТ_СОТРУДНИКИ)
		               |	И ФизическиеЛицаКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
		               |	И ФизическиеЛицаКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонМобильныйФизическиеЛица)
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ФизическоеЛицо
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ФИОФизическихЛицСрезПоследних.Фамилия КАК Фамилия,
		               |	ФИОФизическихЛицСрезПоследних.Имя КАК Имя,
		               |	ФИОФизическихЛицСрезПоследних.Отчество КАК Отчество,
		               |	ВТ_ФИЗИЧЕСКИЕ_ЛИЦА.ДатаРождения КАК ДатаРождения,
		               |	ВТ_ФИЗИЧЕСКИЕ_ЛИЦА.МестоРождения КАК МестоРождения,
		               |	ВЫБОР
		               |		КОГДА ВТ_ФИЗИЧЕСКИЕ_ЛИЦА.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.Мужской)
		               |			ТОГДА ""М""
		               |		ИНАЧЕ ""Ж""
		               |	КОНЕЦ КАК Пол,
		               |	643 КАК Гражданство,
		               |	1 КАК Резидент,
		               |	1 КАК ВидДУЛ,
		               |	ДокументыФизическихЛицСрезПоследних.Серия + ДокументыФизическихЛицСрезПоследних.Номер КАК НомерДУЛ,
		               |	ДокументыФизическихЛицСрезПоследних.КемВыдан КАК КемВыданДУЛ,
		               |	ДокументыФизическихЛицСрезПоследних.КодПодразделения КАК КодПодразделенияДУЛ,
		               |	ДокументыФизическихЛицСрезПоследних.ДатаВыдачи КАК ДатаВыдачиДУЛ,
		               |	"""" КАК НомерМиграционнойКарты,
		               |	"""" КАК ДатаНачалаСрокаПребывания,
		               |	"""" КАК ДатаОкончанияСрокаПребывания,
		               |	643 КАК КодСтраны,
		               |	ВТ_ФИЗИЧЕСКИЕ_ЛИЦА.ДатаРегистрации КАК ДатаРегистрации,
		               |	0 КАК ПризнакВременнойРегистрации,
		               |	ВТ_ФИЗИЧЕСКИЕ_ЛИЦА.ИНН КАК ИНН,
		               |	"""" КАК ОфисДоставки,
		               |	ВТ_КОНТАКТНАЯ_ИНФОРМАЦИЯ.ЗначенияПолей КАК КонтактнаяИнформация,
		               |	ВТ_КОНТАКТНАЯ_ИНФОРМАЦИЯ_2.ЗначенияПолей КАК ТелефонМобильный,
		               |	ВТ_СОТРУДНИКИ.Ссылка КАК Ссылка
		               |ИЗ
		               |	ВТ_СОТРУДНИКИ КАК ВТ_СОТРУДНИКИ
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц.СрезПоследних(, ) КАК ФИОФизическихЛицСрезПоследних
		               |		ПО ВТ_СОТРУДНИКИ.ФизическоеЛицо = ФИОФизическихЛицСрезПоследних.ФизическоеЛицо
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц.СрезПоследних КАК ДокументыФизическихЛицСрезПоследних
		               |		ПО ВТ_СОТРУДНИКИ.ФизическоеЛицо = ДокументыФизическихЛицСрезПоследних.Физлицо
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ФИЗИЧЕСКИЕ_ЛИЦА КАК ВТ_ФИЗИЧЕСКИЕ_ЛИЦА
		               |		ПО ВТ_СОТРУДНИКИ.ФизическоеЛицо = ВТ_ФИЗИЧЕСКИЕ_ЛИЦА.ФизическоеЛицо
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КОНТАКТНАЯ_ИНФОРМАЦИЯ КАК ВТ_КОНТАКТНАЯ_ИНФОРМАЦИЯ
		               |		ПО ВТ_СОТРУДНИКИ.ФизическоеЛицо = ВТ_КОНТАКТНАЯ_ИНФОРМАЦИЯ.ФизическоеЛицо
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КОНТАКТНАЯ_ИНФОРМАЦИЯ_2 КАК ВТ_КОНТАКТНАЯ_ИНФОРМАЦИЯ_2
		               |		ПО ВТ_СОТРУДНИКИ.ФизическоеЛицо = ВТ_КОНТАКТНАЯ_ИНФОРМАЦИЯ_2.ФизическоеЛицо
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Фамилия,
		               |	Имя,
		               |	Отчество,
		               |	ДатаРождения
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |УНИЧТОЖИТЬ ВТ_СОТРУДНИКИ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |УНИЧТОЖИТЬ ВТ_ФИЗИЧЕСКИЕ_ЛИЦА
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |УНИЧТОЖИТЬ ВТ_КОНТАКТНАЯ_ИНФОРМАЦИЯ";
		
	Иначе 
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	ПриемНаРаботу.Сотрудник КАК Сотрудник
		               |ПОМЕСТИТЬ ВТ_ПРИЕМ_НА_РАБОТУ
		               |ИЗ
		               |	Документ.ПриемНаРаботу КАК ПриемНаРаботу
		               |ГДЕ
		               |	ПриемНаРаботу.Дата >= &НачПериода
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Сотрудник
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	Сотрудники.Ссылка КАК Ссылка,
		               |	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо
		               |ПОМЕСТИТЬ ВТ_СОТРУДНИКИ
		               |ИЗ
		               |	Справочник.Сотрудники КАК Сотрудники
		               |ГДЕ
		               |	Сотрудники.Ссылка В
		               |			(ВЫБРАТЬ
		               |				ВТ_ПРИЕМ_НА_РАБОТУ.Сотрудник
		               |			ИЗ
		               |				ВТ_ПРИЕМ_НА_РАБОТУ КАК ВТ_ПРИЕМ_НА_РАБОТУ)
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ФизическоеЛицо
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ФизическиеЛица.Ссылка КАК ФизическоеЛицо,
		               |	ФизическиеЛица.ИНН КАК ИНН,
		               |	ФизическиеЛица.Пол КАК Пол,
		               |	ФизическиеЛица.МестоРождения КАК МестоРождения,
		               |	ФизическиеЛица.ДатаРождения КАК ДатаРождения,
		               |	ФизическиеЛица.ДатаРегистрации КАК ДатаРегистрации
		               |ПОМЕСТИТЬ ВТ_ФИЗИЧЕСКИЕ_ЛИЦА
		               |ИЗ
		               |	Справочник.ФизическиеЛица КАК ФизическиеЛица
		               |ГДЕ
		               |	ФизическиеЛица.Ссылка В
		               |			(ВЫБРАТЬ
		               |				ВТ_СОТРУДНИКИ.ФизическоеЛицо
		               |			ИЗ
		               |				ВТ_СОТРУДНИКИ КАК ВТ_СОТРУДНИКИ)
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ФизическоеЛицо
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ФизическиеЛицаКонтактнаяИнформация.Ссылка КАК ФизическоеЛицо,
		               |	ФизическиеЛицаКонтактнаяИнформация.Вид КАК Вид,
		               |	ФизическиеЛицаКонтактнаяИнформация.ЗначенияПолей КАК ЗначенияПолей
		               |ПОМЕСТИТЬ ВТ_КОНТАКТНАЯ_ИНФОРМАЦИЯ
		               |ИЗ
		               |	Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
		               |ГДЕ
		               |	ФизическиеЛицаКонтактнаяИнформация.Ссылка В
		               |			(ВЫБРАТЬ
		               |				ВТ_СОТРУДНИКИ.ФизическоеЛицо
		               |			ИЗ
		               |				ВТ_СОТРУДНИКИ КАК ВТ_СОТРУДНИКИ)
		               |	И ФизическиеЛицаКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
		               |	И ФизическиеЛицаКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресПоПропискеФизическиеЛица)
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ФизическоеЛицо
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ФизическиеЛицаКонтактнаяИнформация.Ссылка КАК ФизическоеЛицо,
		               |	ФизическиеЛицаКонтактнаяИнформация.Вид КАК Вид,
		               |	ФизическиеЛицаКонтактнаяИнформация.ЗначенияПолей КАК ЗначенияПолей
		               |ПОМЕСТИТЬ ВТ_КОНТАКТНАЯ_ИНФОРМАЦИЯ_2
		               |ИЗ
		               |	Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
		               |ГДЕ
		               |	ФизическиеЛицаКонтактнаяИнформация.Ссылка В
		               |			(ВЫБРАТЬ
		               |				ВТ_СОТРУДНИКИ.ФизическоеЛицо
		               |			ИЗ
		               |				ВТ_СОТРУДНИКИ КАК ВТ_СОТРУДНИКИ)
		               |	И ФизическиеЛицаКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
		               |	И ФизическиеЛицаКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонМобильныйФизическиеЛица)
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ФизическоеЛицо
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ФИОФизическихЛицСрезПоследних.Фамилия КАК Фамилия,
		               |	ФИОФизическихЛицСрезПоследних.Имя КАК Имя,
		               |	ФИОФизическихЛицСрезПоследних.Отчество КАК Отчество,
		               |	ВТ_ФИЗИЧЕСКИЕ_ЛИЦА.ДатаРождения КАК ДатаРождения,
		               |	ВТ_ФИЗИЧЕСКИЕ_ЛИЦА.МестоРождения КАК МестоРождения,
		               |	ВЫБОР
		               |		КОГДА ВТ_ФИЗИЧЕСКИЕ_ЛИЦА.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.Мужской)
		               |			ТОГДА ""М""
		               |		ИНАЧЕ ""Ж""
		               |	КОНЕЦ КАК Пол,
		               |	643 КАК Гражданство,
		               |	1 КАК Резидент,
		               |	1 КАК ВидДУЛ,
		               |	ДокументыФизическихЛицСрезПоследних.Серия + ДокументыФизическихЛицСрезПоследних.Номер КАК НомерДУЛ,
		               |	ДокументыФизическихЛицСрезПоследних.КемВыдан КАК КемВыданДУЛ,
		               |	ДокументыФизическихЛицСрезПоследних.КодПодразделения КАК КодПодразделенияДУЛ,
		               |	ДокументыФизическихЛицСрезПоследних.ДатаВыдачи КАК ДатаВыдачиДУЛ,
		               |	"""" КАК НомерМиграционнойКарты,
		               |	"""" КАК ДатаНачалаСрокаПребывания,
		               |	"""" КАК ДатаОкончанияСрокаПребывания,
		               |	643 КАК КодСтраны,
		               |	ВТ_ФИЗИЧЕСКИЕ_ЛИЦА.ДатаРегистрации КАК ДатаРегистрации,
		               |	0 КАК ПризнакВременнойРегистрации,
		               |	ВТ_ФИЗИЧЕСКИЕ_ЛИЦА.ИНН КАК ИНН,
		               |	"""" КАК ОфисДоставки,
		               |	ВТ_КОНТАКТНАЯ_ИНФОРМАЦИЯ.ЗначенияПолей КАК КонтактнаяИнформация,
		               |	ВТ_КОНТАКТНАЯ_ИНФОРМАЦИЯ_2.ЗначенияПолей КАК ТелефонМобильный,
		               |	ВТ_СОТРУДНИКИ.Ссылка КАК Ссылка
		               |ИЗ
		               |	ВТ_СОТРУДНИКИ КАК ВТ_СОТРУДНИКИ
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц.СрезПоследних(, ) КАК ФИОФизическихЛицСрезПоследних
		               |		ПО ВТ_СОТРУДНИКИ.ФизическоеЛицо = ФИОФизическихЛицСрезПоследних.ФизическоеЛицо
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц.СрезПоследних КАК ДокументыФизическихЛицСрезПоследних
		               |		ПО ВТ_СОТРУДНИКИ.ФизическоеЛицо = ДокументыФизическихЛицСрезПоследних.Физлицо
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ФИЗИЧЕСКИЕ_ЛИЦА КАК ВТ_ФИЗИЧЕСКИЕ_ЛИЦА
		               |		ПО ВТ_СОТРУДНИКИ.ФизическоеЛицо = ВТ_ФИЗИЧЕСКИЕ_ЛИЦА.ФизическоеЛицо
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КОНТАКТНАЯ_ИНФОРМАЦИЯ КАК ВТ_КОНТАКТНАЯ_ИНФОРМАЦИЯ
		               |		ПО ВТ_СОТРУДНИКИ.ФизическоеЛицо = ВТ_КОНТАКТНАЯ_ИНФОРМАЦИЯ.ФизическоеЛицо
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КОНТАКТНАЯ_ИНФОРМАЦИЯ_2 КАК ВТ_КОНТАКТНАЯ_ИНФОРМАЦИЯ_2
		               |		ПО ВТ_СОТРУДНИКИ.ФизическоеЛицо = ВТ_КОНТАКТНАЯ_ИНФОРМАЦИЯ_2.ФизическоеЛицо
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Фамилия,
		               |	Имя,
		               |	Отчество,
		               |	ДатаРождения
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |УНИЧТОЖИТЬ ВТ_ПРИЕМ_НА_РАБОТУ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |УНИЧТОЖИТЬ ВТ_СОТРУДНИКИ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |УНИЧТОЖИТЬ ВТ_ФИЗИЧЕСКИЕ_ЛИЦА
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |УНИЧТОЖИТЬ ВТ_КОНТАКТНАЯ_ИНФОРМАЦИЯ";
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НачПериода", НачалоДня(ЭтотОбъект.НачалоПериода));
	Запрос.УстановитьПараметр("Агентства", Справочники.ПодразделенияОрганизаций.НайтиПоКоду("504"));
	ПредварительныйРезультат = Запрос.Выполнить().Выгрузить();			
	
	//ПредварительныйРезультат.Колонки.Добавить("КодРегиона");
	ПредварительныйРезультат.Колонки.Добавить("НаименованиеРегиона",Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(120)));
	ПредварительныйРезультат.Колонки.Добавить("НаселенныйПункт", 	Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(120)));
	ПредварительныйРезультат.Колонки.Добавить("Улица",				Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(120)));
	ПредварительныйРезультат.Колонки.Добавить("Дом",				Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(120)));
	ПредварительныйРезультат.Колонки.Добавить("Корпус",				Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(120)));
	ПредварительныйРезультат.Колонки.Добавить("Квартира",			Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(120)));
	ПредварительныйРезультат.Колонки.Добавить("Индекс",				Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(120)));
	
	// Разберем контактную информацию	
	Для Каждого СтрокаПредварительнойТаблицы Из ПредварительныйРезультат Цикл
		// Уберем лишний проблел между серией и номером в паспорте
		СтрокаПредварительнойТаблицы.НомерДУЛ = СтрЗаменить(СтрокаПредварительнойТаблицы.НомерДУЛ," ",""); 
		// Заполним контактную информацию по полям XML
		ЗаполнитьКонтактнуюИнформациюВТаблице(СтрокаПредварительнойТаблицы.КонтактнаяИнформация, СтрокаПредварительнойТаблицы);
		СтрокаПредварительнойТаблицы.МестоРождения = ПолучитьМестоРождения(СтрокаПредварительнойТаблицы.МестоРождения);
		
		ЗаполнитьМобильныйТелефон(СтрокаПредварительнойТаблицы.ТелефонМобильный, СтрокаПредварительнойТаблицы); 
	КонецЦикла;
	
	ОкончательныйЗапрос = Новый Запрос();
	ОкончательныйЗапрос.УстановитьПараметр("Таблица",ПредварительныйРезультат); 
	ОкончательныйЗапрос.Текст = "ВЫБРАТЬ
								|	ВТ_ТЗ.Ссылка,
	                            |	ВТ_ТЗ.Фамилия,
	                            |	ВТ_ТЗ.Имя,
	                            |	ВТ_ТЗ.Отчество,
	                            |	ВТ_ТЗ.ДатаРождения,
	                            |	ВТ_ТЗ.МестоРождения,
	                            |	ВТ_ТЗ.Пол,
	                            |	ВТ_ТЗ.Гражданство,
	                            |	ВТ_ТЗ.Резидент,
	                            |	ВТ_ТЗ.ВидДУЛ,
	                            |	ВТ_ТЗ.НомерДУЛ,
	                            |	ВТ_ТЗ.КемВыданДУЛ,
	                            |	ВТ_ТЗ.КодПодразделенияДУЛ,
	                            |	ВТ_ТЗ.ДатаВыдачиДУЛ,
	                            |	ВТ_ТЗ.НомерМиграционнойКарты,
	                            |	ВТ_ТЗ.ДатаНачалаСрокаПребывания,
	                            |	ВТ_ТЗ.ДатаОкончанияСрокаПребывания,
	                            |	ВТ_ТЗ.КодСтраны,
	                            |	ВТ_ТЗ.ДатаРегистрации,
	                            |	ВТ_ТЗ.ПризнакВременнойРегистрации,
	                            |	ВТ_ТЗ.ТелефонМобильный,
	                            |	ВТ_ТЗ.ИНН,
	                            |	ВТ_ТЗ.ОфисДоставки,
	                            |	ВТ_ТЗ.НаименованиеРегиона,
	                            |	ВТ_ТЗ.НаселенныйПункт,
	                            |	ВТ_ТЗ.Улица,
	                            |	ВТ_ТЗ.Дом,
	                            |	ВТ_ТЗ.Корпус,
	                            |	ВТ_ТЗ.Квартира,
	                            |	ВТ_ТЗ.Индекс
	                            |ПОМЕСТИТЬ ВТ_ТЗ
	                            |ИЗ
	                            |	&Таблица КАК ВТ_ТЗ
	                            |;
	                            |
	                            |////////////////////////////////////////////////////////////////////////////////
	                            |ВЫБРАТЬ
								|	ВТ_ТЗ.Ссылка,
	                            |	ВТ_ТЗ.Фамилия КАК Фамилия,
	                            |	ВТ_ТЗ.Имя,
	                            |	ВТ_ТЗ.Отчество,
	                            |	ВТ_ТЗ.ДатаРождения,
	                            |	ВТ_ТЗ.МестоРождения,
	                            |	ВТ_ТЗ.Пол,
	                            |	ВТ_ТЗ.Гражданство,
	                            |	ВТ_ТЗ.Резидент,
	                            |	ВТ_ТЗ.ВидДУЛ,
	                            |	ВТ_ТЗ.НомерДУЛ,
	                            |	ВТ_ТЗ.КемВыданДУЛ,
	                            |	ВТ_ТЗ.КодПодразделенияДУЛ,
	                            |	ВТ_ТЗ.ДатаВыдачиДУЛ,
	                            |	ВТ_ТЗ.НомерМиграционнойКарты,
	                            |	ВТ_ТЗ.ДатаНачалаСрокаПребывания,
	                            |	ВТ_ТЗ.ДатаОкончанияСрокаПребывания,
	                            |	ВТ_ТЗ.КодСтраны,
	                            |	ВТ_ТЗ.ДатаРегистрации,
	                            |	ВТ_ТЗ.ПризнакВременнойРегистрации,
	                            |	ВТ_ТЗ.ТелефонМобильный,
	                            |	ВТ_ТЗ.ИНН,
	                            |	ВТ_ТЗ.ОфисДоставки,
	                            |	ВТ_ТЗ.НаселенныйПункт,
	                            |	ВТ_ТЗ.Улица,
	                            |	ВТ_ТЗ.Дом,
	                            |	ВТ_ТЗ.Корпус,
	                            |	ВТ_ТЗ.Квартира,
	                            |	ВТ_ТЗ.Индекс,
	                            |	АдресныеОбъекты.КодСубъектаРФ КАК КодРегиона
	                            |ИЗ
	                            |	ВТ_ТЗ КАК ВТ_ТЗ
	                            |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АдресныеОбъекты КАК АдресныеОбъекты
	                            |		ПО ВТ_ТЗ.НаименованиеРегиона = АдресныеОбъекты.Наименование
	                            |			И (АдресныеОбъекты.Уровень = 1)
	                            |			И (АдресныеОбъекты.Актуален = ИСТИНА)
	                            |
	                            |УПОРЯДОЧИТЬ ПО
	                            |	Фамилия
	                            |;
	                            |
	                            |////////////////////////////////////////////////////////////////////////////////
	                            |УНИЧТОЖИТЬ ВТ_ТЗ";
								
	РезультирующаяТаблица = ОкончательныйЗапрос.Выполнить().Выгрузить();		
	
	Если Не РезультирующаяТаблица.Количество() = 0 Тогда
		
		ДокРезультат = Новый ТабличныйДокумент;
		Макет = ПолучитьМакет("Макет");
		ОблШапка = Макет.ПолучитьОбласть("Шапка");
		ДокРезультат.Вывести(ОблШапка);
		ОблСтрока = Макет.ПолучитьОбласть("СтрокаТаблицы");
		Для Каждого Строка Из РезультирующаяТаблица Цикл
			ОблСтрока.Параметры.Заполнить(Строка);
			НаселенныйПункт = ИсправитьНаписание(Строка.НаселенныйПункт);
			Улица = ИсправитьНаписание(Строка.Улица);
			ОблСтрока.Параметры.Улица = Улица;
			ОблСтрока.Параметры.НаселенныйПункт = НаселенныйПункт;
			ДокРезультат.Вывести(ОблСтрока);
		КонецЦикла; 
		
		Возврат ДокРезультат;
		
	КонецЕсли; 

	Возврат Неопределено;

КонецФункции

Функция ИсправитьНаписание(НП)
	Если Не ПустаяСтрока(НП) Тогда 
		НовоеНаписаниеНП = "";
		ДлинаСтроки = СтрДлина(НП);
		Счетчик = 1;
		Пока Счетчик<=ДлинаСтроки Цикл
			СчитываемыйСимвол = Лев(Прав(НП, Счетчик),1);
			Если СчитываемыйСимвол = " " Тогда 
				Прервать;
			Иначе 
				НовоеНаписаниеНП = СчитываемыйСимвол + НовоеНаписаниеНП; 			
			КонецЕсли;
			Счетчик = Счетчик + 1;
		КонецЦикла;
		НовоеНаписаниеНП = НовоеНаписаниеНП + " " + Лев(НП, ДлинаСтроки - Счетчик);
	Иначе 
		НовоеНаписаниеНП = НП;
	КонецЕсли;
	Возврат НовоеНаписаниеНП;
КонецФункции

//////////////////////////////////////////////////
// Процедуры для выгрузки информации по агенту
////////////////////////////////////////////////// 
Процедура ЗаполнитьКонтактнуюИнформациюВТаблице(КонтактнаяИнформацияXML, СтрокаТаблицы)
		
	ИнформацияпоАдресу 		= ВыполнитьРазбор(КонтактнаяИнформацияXML);
	
	СтрокаТаблицы.Индекс 				= ИнформацияпоАдресу.Индекс;
	СтрокаТаблицы.НаименованиеРегиона 	= ИнформацияпоАдресу.СубъектРФ;
	СтрокаТаблицы.НаселенныйПункт		= ИнформацияпоАдресу.НаселенныйПункт;
	СтрокаТаблицы.Улица					= ИнформацияпоАдресу.Улица;
	СтрокаТаблицы.Дом					= ИнформацияпоАдресу.Дом;
	СтрокаТаблицы.Корпус				= ИнформацияпоАдресу.Корпус;
	СтрокаТаблицы.Квартира				= ИнформацияпоАдресу.Квартира;
	
КонецПроцедуры  // ЗаполнитьКонтактнуюИнформациюВТаблице()

Процедура ЗаполнитьМобильныйТелефон(КонтактнаяИнформацияXML, СтрокаТаблицы)
	
	Если Не ПустаяСтрока(КонтактнаяИнформацияXML) Тогда	
		
		Шаг1 = СтрЗаменить(СтрПолучитьСтроку(КонтактнаяИнформацияXML, 1), "<КонтактнаяИнформация xmlns=""http://www.v8.1c.ru/ssl/contactinfo"" Представление=""", "");
		Шаг2 = СтрЗаменить(Шаг1, "<КонтактнаяИнформация xmlns=""http://www.v8.1c.ru/ssl/contactinfo"" xmlns:xs=""http://www.w3.org/2001/XMLSchema"" xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance"" Представление=""", ""); 
		Шаг3 = СтрПолучитьСтроку(СтрЗаменить(Шаг2, "<", Символы.ПС + "<"),1);
		
		СтрокаТаблицы.ТелефонМобильный = СтрЗаменить(Шаг3, """>", "");
		
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьМобильныйТелефон()
 

Функция ПолучитьМестоРождения(МестоРождения)
	МассивПодстрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(МестоРождения,",",Истина);
	Если МассивПодстрок.Количество() = 1 Тогда
		Возврат МассивПодстрок[0];
	ИначеЕсли МассивПодстрок.Количество() >1 Тогда
		Возврат МассивПодстрок[1];
	Иначе
		Возврат "";
	КонецЕсли;
КонецФункции // ПолучитьМестоРождения()

//////////////////////////////////////////////////
// Процедуры получения контактной информации
////////////////////////////////////////////////// 
Функция ВыполнитьРазбор(Адрес)
	Результат = Новый Структура;
	Результат.Вставить("Город");
	Результат.Вставить("Страна");
	Результат.Вставить("Улица");
	Результат.Вставить("УлицаСокращение");
	Результат.Вставить("Индекс");
	Результат.Вставить("СубъектРФ");
	Результат.Вставить("Дом");
	Результат.Вставить("Квартира");
	Результат.Вставить("Корпус");
	Результат.Вставить("Район");
	Результат.Вставить("НаселенныйПункт");
	Результат.Вставить("НаселенныйПунктСокращение");
	
	СтрокаРазбора = СтрЗаменить(Адрес, "xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance"" xmlns:xs=""http://www.w3.org/2001/XMLSchema"" xmlns=""http://www.v8.1c.ru/ssl/contactinfo""", "");   
	СтрокаРазбора = СтрЗаменить(СтрокаРазбора, "xmlns=""http://www.v8.1c.ru/ssl/contactinfo"" xmlns:xs=""http://www.w3.org/2001/XMLSchema"" xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance""",""); 
	СтрокаРазбора = СтрЗаменить(СтрокаРазбора, Символы.ПС, " ");
	СтрокаРазбора = СтрЗаменить(СтрокаРазбора, "xsi:type=""Адрес""", "");
	СтрокаРазбора = СтрЗаменить(СтрокаРазбора, ">", ">|");
	
	МасстивПодстрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаРазбора,"|",Истина);
	
	Представление = "<КонтактнаяИнформация  Представление=";
	ДлиннаПредставления = СтрДлина(Представление);
	
	РезультатПеребора = Новый Массив;
	Для Каждого ЗначениеМассива Из МасстивПодстрок Цикл
		Если Не ЭтоМусорнаяСтрока(ЗначениеМассива) И Лев(ЗначениеМассива, ДлиннаПредставления) <> Представление Тогда
			Если ЭтоУлица(ЗначениеМассива) Тогда
				НазваниеУлицы = СокрЛП(СтрЗаменить(ЗначениеМассива,"</Улица>",""));
				Результат.Улица = НазваниеУлицы;
			ИначеЕсли ЭтоСубъектРФ(ЗначениеМассива) Тогда
				Результат.СубъектРФ = Лев(СокрЛП(СтрЗаменить(ЗначениеМассива,"</СубъектРФ>","")),Найти(СокрЛП(СтрЗаменить(ЗначениеМассива,"</СубъектРФ>",""))," ")-1);
			ИначеЕсли ЭтоИндекс(ЗначениеМассива) Тогда
				Результат.Индекс = СокрЛП(СтрЗаменить(СтрЗаменить(СтрЗаменить(ЗначениеМассива,"ТипАдрЭл=""10100000"" Значение=""",""),"<ДопАдрЭл",""),"""/>",""));
			ИначеЕсли ЭтоНаселенныйПункт(ЗначениеМассива) Тогда
				НазваниеНаселенногоПункта = СокрЛП(СтрЗаменить(ЗначениеМассива,"</НаселПункт>",""));
				Результат.НаселенныйПункт = НазваниеНаселенногоПункта;
			ИначеЕсли ЭтоДом(ЗначениеМассива) Тогда
				Результат.Дом = СокрЛП(СтрЗаменить(СтрЗаменить(ЗначениеМассива,"<Номер Тип=""1010"" Значение=""",""),"""/>",""));
			ИначеЕсли ЭтоКвартира(ЗначениеМассива) Тогда
				Результат.Квартира = СокрЛП(СтрЗаменить(СтрЗаменить(ЗначениеМассива,"<Номер Тип=""2010"" Значение=""",""),"""/>",""));
			ИначеЕсли ЭтоКорпус(ЗначениеМассива) Тогда
				Результат.Корпус = СокрЛП(СтрЗаменить(СтрЗаменить(ЗначениеМассива,"<Номер Тип=""1050"" Значение=""",""),"""/>",""));				
			ИначеЕсли ЭтоСтроение(ЗначениеМассива) Тогда
				Результат.Корпус = СокрЛП(СтрЗаменить(СтрЗаменить(ЗначениеМассива,"<Номер Тип=""1060"" Значение=""",""),"""/>",""));				
			ИначеЕсли ЭтоВладение(ЗначениеМассива) Тогда
				Результат.Дом = СокрЛП(СтрЗаменить(СтрЗаменить(ЗначениеМассива,"<Номер Тип=""1020"" Значение=""",""),"""/>",""));
			ИначеЕсли ЭтоДомовладение(ЗначениеМассива) Тогда
				Результат.Дом = СокрЛП(СтрЗаменить(СтрЗаменить(ЗначениеМассива,"<Номер Тип=""1030"" Значение=""",""),"""/>",""));								
			ИначеЕсли ЭтоПомещение(ЗначениеМассива) Тогда
				Результат.Квартира = СокрЛП(СтрЗаменить(СтрЗаменить(ЗначениеМассива,"<Номер Тип=""2020"" Значение=""",""),"""/>",""));
			ИначеЕсли ЭтоОфис(ЗначениеМассива) Тогда
				Результат.Квартира = СокрЛП(СтрЗаменить(СтрЗаменить(ЗначениеМассива,"<Номер Тип=""2030"" Значение=""",""),"""/>",""));
			ИначеЕсли ЭтоБокс(ЗначениеМассива) Тогда
				Результат.Квартира = СокрЛП(СтрЗаменить(СтрЗаменить(ЗначениеМассива,"<Номер Тип=""2040"" Значение=""",""),"""/>",""));
			ИначеЕсли ЭтоКомната(ЗначениеМассива) Тогда
				Результат.Квартира = СокрЛП(СтрЗаменить(СтрЗаменить(ЗначениеМассива,"<Номер Тип=""2050"" Значение=""",""),"""/>",""));				
			ИначеЕсли ЭтоУчасток(ЗначениеМассива) Тогда
				Результат.Корпус = СокрЛП(СтрЗаменить(СтрЗаменить(ЗначениеМассива,"<Номер Тип=""1040"" Значение=""",""),"""/>",""));				
			ИначеЕсли ЭтоСооружение(ЗначениеМассива) Тогда
				Результат.Корпус = СокрЛП(СтрЗаменить(СтрЗаменить(ЗначениеМассива,"<Номер Тип=""1070"" Значение=""",""),"""/>",""));				
			ИначеЕсли ЭтоЛитера(ЗначениеМассива) Тогда
				Результат.Корпус = СокрЛП(СтрЗаменить(СтрЗаменить(ЗначениеМассива,"<Номер Тип=""1080"" Значение=""",""),"""/>",""));
			ИначеЕсли ЭтоГород(ЗначениеМассива) Тогда
				Результат.Город = СокрЛП(СтрЗаменить(ЗначениеМассива,"</Город>",""));;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;  
	
	Если ПустаяСтрока(Результат.НаселенныйПункт) Тогда
		Результат.НаселенныйПункт = Результат.Город;		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоМусорнаяСтрока(Строка)
	
	МусорныеСтроки = Новый Массив;
	МусорныеСтроки.Добавить("</КонтактнаяИнформация>");
	МусорныеСтроки.Добавить("</Состав>");
	МусорныеСтроки.Добавить("<Комментарий/>");
	МусорныеСтроки.Добавить("<СубъектРФ>");
	МусорныеСтроки.Добавить("<Улица>");        
	МусорныеСтроки.Добавить("<Состав xsi:type=""АдресРФ"">");
	
	МусорныеСтроки.Добавить("<Округ>");
	МусорныеСтроки.Добавить("<Округ/>");      
	МусорныеСтроки.Добавить("<ВнутригРайон>");
	МусорныеСтроки.Добавить("<ВнутригРайон/>");     
	МусорныеСтроки.Добавить("<ДопАдрЭл>");
	МусорныеСтроки.Добавить("</ДопАдрЭл>");
	МусорныеСтроки.Добавить("<НаселПункт/>");
	МусорныеСтроки.Добавить("<НаселПункт>");           
	МусорныеСтроки.Добавить("<Район>");
	МусорныеСтроки.Добавить("<Район/>");      
	МусорныеСтроки.Добавить("<Город>");
	МусорныеСтроки.Добавить("<Город/>");      
	МусорныеСтроки.Добавить("<СвРайМО>");
	МусорныеСтроки.Добавить("</СвРайМО>");
	
	Если МусорныеСтроки.Найти(СокрЛП(Строка)) = Неопределено Тогда
		Возврат Ложь; 
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции //ЭтоМусорнаяСтрока()

Функция ЭтоУлица(Строка)
	Возврат ?(Найти(Строка, "</Улица>") > 0, Истина, Ложь);
КонецФункции // ЭтоУлица()

Функция ЭтоНаселенныйПункт(Строка)
	Возврат ?(Найти(Строка, "</НаселПункт>") > 0, Истина, Ложь);
КонецФункции // ЭтоУлица()

Функция ЭтоСубъектРФ(Строка)
	Возврат ?(Найти(Строка, "</СубъектРФ>") > 0, Истина, Ложь);
КонецФункции // ЭтоСубъектРФ()

Функция ЭтоИндекс(Строка)
	Возврат ?(Найти(Строка, "ТипАдрЭл=""10100000"" Значение=""") > 0, Истина, Ложь);
КонецФункции // ЭтоИндекс()

Функция ЭтоГород(Строка)
	Возврат ?(Найти(Строка, "</Город>") > 0, Истина, Ложь);      
КонецФункции // ЭтоГород()

Функция ЭтоДом(Строка)
	Возврат ?(Найти(Строка, "Номер Тип=""1010"" Значение=""") > 0, Истина, Ложь);
КонецФункции // ЭтоДом()

Функция ЭтоВладение(Строка)
	Возврат ?(Найти(Строка, "Номер Тип=""1020"" Значение=""") > 0, Истина, Ложь);
КонецФункции // ЭтоВладение()

Функция ЭтоДомовладение(Строка)
	Возврат ?(Найти(Строка, "Номер Тип=""1030"" Значение=""") > 0, Истина, Ложь);
КонецФункции // ЭтоДомовладение()

Функция ЭтоКвартира(Строка)
	Возврат ?(Найти(Строка, "Номер Тип=""2010"" Значение=""") > 0, Истина, Ложь);
КонецФункции // ЭтоКвартира()

Функция ЭтоПомещение(Строка)
	Возврат ?(Найти(Строка, "Номер Тип=""2020"" Значение=""") > 0, Истина, Ложь);
КонецФункции // ЭтоПомещение()

Функция ЭтоОфис(Строка)
	Возврат ?(Найти(Строка, "Номер Тип=""2030"" Значение=""") > 0, Истина, Ложь);
КонецФункции // ЭтоОфис()

Функция ЭтоБокс(Строка)
	Возврат ?(Найти(Строка, "Номер Тип=""2040"" Значение=""") > 0, Истина, Ложь);
КонецФункции // ЭтоБокс()

Функция ЭтоКомната(Строка)
	Возврат ?(Найти(Строка, "Номер Тип=""2050"" Значение=""") > 0, Истина, Ложь);
КонецФункции // ЭтоКомната()

Функция ЭтоУчасток(Строка)
	Возврат ?(Найти(Строка, "Номер Тип=""1040"" Значение=""") > 0, Истина, Ложь);
КонецФункции // ЭтоУчасток()

Функция ЭтоКорпус(Строка)
	Возврат ?(Найти(Строка, "Номер Тип=""1050"" Значение=""") > 0, Истина, Ложь);
КонецФункции // ЭтоКорпус()

Функция ЭтоСтроение(Строка)
	Возврат ?(Найти(Строка, "Номер Тип=""1060"" Значение=""") > 0, Истина, Ложь);
КонецФункции // ЭтоСтроение()

Функция ЭтоСооружение(Строка)
	Возврат ?(Найти(Строка, "Номер Тип=""1070"" Значение=""") > 0, Истина, Ложь);
КонецФункции // ЭтоСооружение()

Функция ЭтоЛитера(Строка)
	Возврат ?(Найти(Строка, "Номер Тип=""1080"" Значение=""") > 0, Истина, Ложь);
КонецФункции // ЭтоЛитера()

