
&НаКлиенте
Процедура Очистить(Команда)
	Объект.СписокФизЛиц.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	Объект.СписокФизЛиц.Очистить();
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Таблица = ПолучитьИтоговуюТаблицу();
	
	Если Таблица.Количество() > 0 Тогда 
		Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
		РегистрацияОрганизации = Организация.РегистрацияВНалоговомОргане;
		Для Каждого Выборка Из Таблица Цикл 
			НоваяСтрока = Объект.СписокФизЛиц.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			НоваяСтрока.ДатаПлатежа = Период;
			Если ЗначениеЗаполнено(Выборка.РегистрацияВНалоговомОргане) Тогда
				Если ЗначениеЗаполнено(Выборка.ОКТМО) И ЗначениеЗаполнено(Выборка.КПП) Тогда
					НоваяСтрока.РегистрацияВНалоговомОргане = Выборка.РегистрацияВНалоговомОргане;	
					НоваяСтрока.ОКТМО_КПП = Выборка.ОКТМО + "/" + Выборка.КПП;	
				Иначе
					НоваяСтрока.РегистрацияВНалоговомОргане = Выборка.РегистрацияВНалоговомОргане;
					НоваяСтрока.ОКТМО_КПП = Выборка.РегистрацияВНалоговомОргане.КодПоОКТМО+ "/" + Выборка.РегистрацияВНалоговомОргане.КПП;	
				КонецЕсли;
			Иначе
				НоваяСтрока.РегистрацияВНалоговомОргане = РегистрацияОрганизации;
				НоваяСтрока.ОКТМО_КПП = "45382000   /997950001";	
			КонецЕсли;
		КонецЦикла; 
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИтоговуюТаблицу()
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	СведенияОДоходах.ФизическоеЛицо,
	               |	СведенияОДоходах.МесяцНалоговогоПериода КАК Период
	               |ПОМЕСТИТЬ ВТФизическиеЛицаПериоды
	               |ИЗ
	               |	РегистрНакопления.СведенияОДоходахНДФЛ КАК СведенияОДоходах
	               |ГДЕ
	               |	СведенияОДоходах.Период МЕЖДУ &НачалоПериода И &КонецПериода
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ФизическиеЛицаПериоды.ФизическоеЛицо,
	               |	ФизическиеЛицаПериоды.Период,
	               |	ВЫБОР
	               |		КОГДА ФизическиеЛицаПериоды.Период < &ДатаЗакона285ФЗ
	               |				И СтатусФизическихЛицКакНалогоплательщиковНДФЛ.Статус = ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Беженцы)
	               |			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Нерезидент)
	               |		ИНАЧЕ ЕСТЬNULL(СтатусФизическихЛицКакНалогоплательщиковНДФЛ.Статус, ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент))
	               |	КОНЕЦ КАК Статус
	               |ПОМЕСТИТЬ ВТФизическиеЛицаСтатусыНДФЛ
	               |ИЗ
	               |	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |		СписокФизическихЛиц.ФизическоеЛицо КАК ФизическоеЛицо,
	               |		МАКСИМУМ(СтатусФизическихЛиц.Период) КАК ПериодСтатуса,
	               |		СписокФизическихЛиц.Период КАК Период
	               |	ИЗ
	               |		ВТФизическиеЛицаПериоды КАК СписокФизическихЛиц
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусФизическихЛицКакНалогоплательщиковНДФЛ КАК СтатусФизическихЛиц
	               |			ПО СписокФизическихЛиц.ФизическоеЛицо = СтатусФизическихЛиц.ФизическоеЛицо
	               |				И СписокФизическихЛиц.Период >= СтатусФизическихЛиц.Период
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		СписокФизическихЛиц.ФизическоеЛицо,
	               |		СписокФизическихЛиц.Период) КАК ФизическиеЛицаПериоды
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусФизическихЛицКакНалогоплательщиковНДФЛ КАК СтатусФизическихЛицКакНалогоплательщиковНДФЛ
	               |		ПО ФизическиеЛицаПериоды.ФизическоеЛицо = СтатусФизическихЛицКакНалогоплательщиковНДФЛ.ФизическоеЛицо
	               |			И ФизическиеЛицаПериоды.ПериодСтатуса = СтатусФизическихЛицКакНалогоплательщиковНДФЛ.Период
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВЫБОР
	               |		КОГДА НачисленныйУдержанныйНДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	               |			ТОГДА 2
	               |		КОГДА НачисленныйУдержанныйНДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
	               |			ТОГДА 3
	               |		КОГДА НачисленныйУдержанныйНДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ЗачетАвансовыхПлатежей)
	               |			ТОГДА 6
	               |		КОГДА НачисленныйУдержанныйНДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ВозвращеноНалоговымАгентом)
	               |			ТОГДА 7
	               |		КОГДА НачисленныйУдержанныйНДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ПереданоНаВзысканиеВНалоговыйОрган)
	               |			ТОГДА 8
	               |		ИНАЧЕ 3
	               |	КОНЕЦ КАК ВидЗаписи,
	               |	НАЧАЛОПЕРИОДА(НачисленныйУдержанныйНДФЛ.Период, МЕСЯЦ) КАК Период,
	               |	НАЧАЛОПЕРИОДА(НачисленныйУдержанныйНДФЛ.МесяцНалоговогоПериода, МЕСЯЦ) КАК МесяцНалоговогоПериода,
	               |	НачисленныйУдержанныйНДФЛ.ГоловнаяОрганизация,
	               |	НачисленныйУдержанныйНДФЛ.Организация,
	               |	НачисленныйУдержанныйНДФЛ.ФизическоеЛицо,
	               |	НачисленныйУдержанныйНДФЛ.РегистрацияВНалоговомОргане,
	               |	ВЫБОР
	               |		КОГДА НачисленныйУдержанныйНДФЛ.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка13)
	               |			ТОГДА ВЫБОР
	               |					КОГДА ЕСТЬNULL(ФизическиеЛицаСтатусыНДФЛ.Статус, ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент)) = ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Нерезидент)
	               |						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	               |					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	               |				КОНЕЦ
	               |		КОГДА НачисленныйУдержанныйНДФЛ.КодДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код1010)
	               |			ТОГДА ВЫБОР
	               |					КОГДА ЕСТЬNULL(ФизическиеЛицаСтатусыНДФЛ.Статус, ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент)) <> ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент)
	               |						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
	               |					КОГДА НАЧАЛОПЕРИОДА(НачисленныйУдержанныйНДФЛ.МесяцНалоговогоПериода, МЕСЯЦ) >= ДАТАВРЕМЯ(2015, 1, 1)
	               |						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	               |					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка09)
	               |				КОНЕЦ
	               |		КОГДА ЕСТЬNULL(ФизическиеЛицаСтатусыНДФЛ.Статус, ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент)) = ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент)
	               |			ТОГДА ВЫБОР
	               |					КОГДА НачисленныйУдержанныйНДФЛ.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка09)
	               |						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка09)
	               |					КОГДА НачисленныйУдержанныйНДФЛ.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка35)
	               |						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка35)
	               |					ИНАЧЕ """"""""
	               |				КОНЕЦ
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	               |	КОНЕЦ КАК Ставка,
	               |	СУММА(ВЫБОР
	               |			КОГДА НачисленныйУдержанныйНДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	               |					И НачисленныйУдержанныйНДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ВозвращеноНалоговымАгентом)
	               |				ТОГДА -НачисленныйУдержанныйНДФЛ.Сумма
	               |			ИНАЧЕ НачисленныйУдержанныйНДФЛ.Сумма
	               |		КОНЕЦ) КАК СуммаНалога,
	               |	НачисленныйУдержанныйНДФЛ.Регистратор КАК Документ,
	               |	НачисленныйУдержанныйНДФЛ.Регистратор.ПланируемаяДатаВыплаты КАК ДатаВыплаты,
	               |	НачисленныйУдержанныйНДФЛ.Подразделение,
	               |	НачисленныйУдержанныйНДФЛ.ДокументОснование
	               |ПОМЕСТИТЬ ВТНачисленныйУдержанныйНДФЛ
	               |ИЗ
	               |	РегистрНакопления.РасчетыНалогоплательщиковСБюджетомПоНДФЛ КАК НачисленныйУдержанныйНДФЛ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТФизическиеЛицаСтатусыНДФЛ КАК ФизическиеЛицаСтатусыНДФЛ
	               |		ПО НачисленныйУдержанныйНДФЛ.ФизическоеЛицо = ФизическиеЛицаСтатусыНДФЛ.ФизическоеЛицо
	               |			И (НАЧАЛОПЕРИОДА(НачисленныйУдержанныйНДФЛ.МесяцНалоговогоПериода, МЕСЯЦ) = ФизическиеЛицаСтатусыНДФЛ.Период)
	               |ГДЕ
	               |	НачисленныйУдержанныйНДФЛ.МесяцНалоговогоПериода МЕЖДУ &НачалоПериода И &КонецПериода
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	НАЧАЛОПЕРИОДА(НачисленныйУдержанныйНДФЛ.Период, МЕСЯЦ),
	               |	НачисленныйУдержанныйНДФЛ.МесяцНалоговогоПериода,
	               |	НачисленныйУдержанныйНДФЛ.ГоловнаяОрганизация,
	               |	НачисленныйУдержанныйНДФЛ.Организация,
	               |	НачисленныйУдержанныйНДФЛ.ФизическоеЛицо,
	               |	НачисленныйУдержанныйНДФЛ.РегистрацияВНалоговомОргане,
	               |	ФизическиеЛицаСтатусыНДФЛ.Статус,
	               |	НачисленныйУдержанныйНДФЛ.КодДохода,
	               |	НачисленныйУдержанныйНДФЛ.СтавкаНалогообложенияРезидента,
	               |	ВЫБОР
	               |		КОГДА НачисленныйУдержанныйНДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	               |			ТОГДА 2
	               |		КОГДА НачисленныйУдержанныйНДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
	               |			ТОГДА 3
	               |		КОГДА НачисленныйУдержанныйНДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ЗачетАвансовыхПлатежей)
	               |			ТОГДА 6
	               |		КОГДА НачисленныйУдержанныйНДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ВозвращеноНалоговымАгентом)
	               |			ТОГДА 7
	               |		КОГДА НачисленныйУдержанныйНДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ПереданоНаВзысканиеВНалоговыйОрган)
	               |			ТОГДА 8
	               |		ИНАЧЕ 3
	               |	КОНЕЦ,
	               |	НачисленныйУдержанныйНДФЛ.Регистратор.ПланируемаяДатаВыплаты,
	               |	НачисленныйУдержанныйНДФЛ.Регистратор,
	               |	НачисленныйУдержанныйНДФЛ.Подразделение,
	               |	НачисленныйУдержанныйНДФЛ.ДокументОснование
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	2 КАК ВидЗаписи,
	               |	НАЧАЛОПЕРИОДА(СведенияОДоходах.Период, МЕСЯЦ) КАК Период,
	               |	НАЧАЛОПЕРИОДА(СведенияОДоходах.МесяцНалоговогоПериода, МЕСЯЦ) КАК МесяцНалоговогоПериода,
	               |	СведенияОДоходах.ГоловнаяОрганизация,
	               |	СведенияОДоходах.Организация,
	               |	СведенияОДоходах.ФизическоеЛицо,
	               |	СведенияОДоходах.РегистрацияВНалоговомОргане,
	               |	ВЫБОР
	               |		КОГДА СведенияОДоходах.КодДохода.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка13)
	               |			ТОГДА ВЫБОР
	               |					КОГДА ЕСТЬNULL(ФизическиеЛицаСтатусыНДФЛ.Статус, ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент)) = ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Нерезидент)
	               |						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	               |					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	               |				КОНЕЦ
	               |		КОГДА СведенияОДоходах.КодДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код1010)
	               |			ТОГДА ВЫБОР
	               |					КОГДА ЕСТЬNULL(ФизическиеЛицаСтатусыНДФЛ.Статус, ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент)) <> ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент)
	               |						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
	               |					КОГДА СведенияОДоходах.МесяцНалоговогоПериода >= ДАТАВРЕМЯ(2015, 1, 1)
	               |						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	               |					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка09)
	               |				КОНЕЦ
	               |		КОГДА ЕСТЬNULL(ФизическиеЛицаСтатусыНДФЛ.Статус, ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент)) = ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент)
	               |			ТОГДА ВЫБОР
	               |					КОГДА СведенияОДоходах.КодДохода.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка09)
	               |						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка09)
	               |					КОГДА СведенияОДоходах.КодДохода.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка35)
	               |						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка35)
	               |					ИНАЧЕ """"""""
	               |				КОНЕЦ
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	               |	КОНЕЦ КАК Ставка,
	               |	0 КАК СуммаНалога,
	               |	СУММА(СведенияОДоходах.СуммаДохода) КАК Доход,
	               |	СУММА(СведенияОДоходах.СуммаВычета) КАК Вычет,
	               |	СУММА(ВЫБОР
	               |			КОГДА СведенияОДоходах.КодДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код2760)
	               |					ИЛИ СведенияОДоходах.КодДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код2761)
	               |					ИЛИ СведенияОДоходах.КодДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код2762)
	               |				ТОГДА СведенияОДоходах.СуммаДохода
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК ДоходМатпомощь,
	               |	СУММА(ВЫБОР
	               |			КОГДА СведенияОДоходах.КодДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код2760)
	               |					ИЛИ СведенияОДоходах.КодДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код2761)
	               |					ИЛИ СведенияОДоходах.КодДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код2762)
	               |				ТОГДА СведенияОДоходах.СуммаВычета
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК ВычетМатпомощь,
	               |	0 КАК СтандартныйВычет,
	               |	0 КАК ИмущественныйВычет,
	               |	СведенияОДоходах.Регистратор КАК Документ,
	               |	NULL КАК ДатаВыплаты,
	               |	СведенияОДоходах.ПодразделениеСотрудника КАК Подразделение,
	               |	NULL КАК ДокументОснование
	               |ПОМЕСТИТЬ ВТПолныеСведенияНДФЛ
	               |ИЗ
	               |	РегистрНакопления.СведенияОДоходахНДФЛ КАК СведенияОДоходах
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТФизическиеЛицаСтатусыНДФЛ КАК ФизическиеЛицаСтатусыНДФЛ
	               |		ПО СведенияОДоходах.ФизическоеЛицо = ФизическиеЛицаСтатусыНДФЛ.ФизическоеЛицо
	               |			И СведенияОДоходах.МесяцНалоговогоПериода = ФизическиеЛицаСтатусыНДФЛ.Период
	               |ГДЕ
	               |	СведенияОДоходах.Период МЕЖДУ &НачалоПериода И &КонецПериода
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	НАЧАЛОПЕРИОДА(СведенияОДоходах.Период, МЕСЯЦ),
	               |	НАЧАЛОПЕРИОДА(СведенияОДоходах.МесяцНалоговогоПериода, МЕСЯЦ),
	               |	СведенияОДоходах.ГоловнаяОрганизация,
	               |	СведенияОДоходах.Организация,
	               |	СведенияОДоходах.ФизическоеЛицо,
	               |	СведенияОДоходах.РегистрацияВНалоговомОргане,
	               |	СведенияОДоходах.КодДохода,
	               |	ФизическиеЛицаСтатусыНДФЛ.Статус,
	               |	ВЫБОР
	               |		КОГДА СведенияОДоходах.КодДохода.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка13)
	               |			ТОГДА ВЫБОР
	               |					КОГДА ЕСТЬNULL(ФизическиеЛицаСтатусыНДФЛ.Статус, ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент)) = ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Нерезидент)
	               |						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	               |					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	               |				КОНЕЦ
	               |		КОГДА СведенияОДоходах.КодДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код1010)
	               |			ТОГДА ВЫБОР
	               |					КОГДА ЕСТЬNULL(ФизическиеЛицаСтатусыНДФЛ.Статус, ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент)) <> ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент)
	               |						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
	               |					КОГДА СведенияОДоходах.МесяцНалоговогоПериода >= ДАТАВРЕМЯ(2015, 1, 1)
	               |						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	               |					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка09)
	               |				КОНЕЦ
	               |		КОГДА ЕСТЬNULL(ФизическиеЛицаСтатусыНДФЛ.Статус, ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент)) = ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент)
	               |			ТОГДА ВЫБОР
	               |					КОГДА СведенияОДоходах.КодДохода.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка09)
	               |						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка09)
	               |					КОГДА СведенияОДоходах.КодДохода.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка35)
	               |						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка35)
	               |					ИНАЧЕ """"""""
	               |				КОНЕЦ
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	               |	КОНЕЦ,
	               |	СведенияОДоходах.Регистратор,
	               |	СведенияОДоходах.ПодразделениеСотрудника
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	2,
	               |	НАЧАЛОПЕРИОДА(СтандартныеВычеты.Период, МЕСЯЦ),
	               |	НАЧАЛОПЕРИОДА(СтандартныеВычеты.МесяцНалоговогоПериода, МЕСЯЦ),
	               |	СтандартныеВычеты.ГоловнаяОрганизация,
	               |	СтандартныеВычеты.Организация,
	               |	СтандартныеВычеты.ФизическоеЛицо,
	               |	СтандартныеВычеты.РегистрацияВНалоговомОргане,
	               |	ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13),
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	СУММА(СтандартныеВычеты.Сумма),
	               |	0,
	               |	СтандартныеВычеты.Регистратор,
	               |	NULL,
	               |	СтандартныеВычеты.Подразделение,
	               |	NULL
	               |ИЗ
	               |	РегистрНакопления.ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ КАК СтандартныеВычеты
	               |ГДЕ
	               |	СтандартныеВычеты.МесяцНалоговогоПериода МЕЖДУ &НачалоПериода И &КонецПериода
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	НАЧАЛОПЕРИОДА(СтандартныеВычеты.Период, МЕСЯЦ),
	               |	НАЧАЛОПЕРИОДА(СтандартныеВычеты.МесяцНалоговогоПериода, МЕСЯЦ),
	               |	СтандартныеВычеты.ГоловнаяОрганизация,
	               |	СтандартныеВычеты.Организация,
	               |	СтандартныеВычеты.ФизическоеЛицо,
	               |	СтандартныеВычеты.РегистрацияВНалоговомОргане,
	               |	СтандартныеВычеты.Регистратор,
	               |	СтандартныеВычеты.Подразделение
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	2,
	               |	НАЧАЛОПЕРИОДА(ИмущественныеВычеты.Период, МЕСЯЦ),
	               |	НАЧАЛОПЕРИОДА(ИмущественныеВычеты.Период, МЕСЯЦ),
	               |	ИмущественныеВычеты.ГоловнаяОрганизация,
	               |	ИмущественныеВычеты.Организация,
	               |	ИмущественныеВычеты.ФизическоеЛицо,
	               |	ИмущественныеВычеты.РегистрацияВНалоговомОргане,
	               |	ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13),
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	СУММА(ИмущественныеВычеты.Сумма),
	               |	ИмущественныеВычеты.Регистратор,
	               |	NULL,
	               |	ИмущественныеВычеты.Подразделение,
	               |	NULL
	               |ИЗ
	               |	РегистрНакопления.ИмущественныеВычетыНДФЛ КАК ИмущественныеВычеты
	               |ГДЕ
	               |	ИмущественныеВычеты.Период МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ИмущественныеВычеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	НАЧАЛОПЕРИОДА(ИмущественныеВычеты.Период, МЕСЯЦ),
	               |	ИмущественныеВычеты.ГоловнаяОрганизация,
	               |	ИмущественныеВычеты.Организация,
	               |	ИмущественныеВычеты.ФизическоеЛицо,
	               |	ИмущественныеВычеты.РегистрацияВНалоговомОргане,
	               |	ИмущественныеВычеты.Регистратор,
	               |	ИмущественныеВычеты.Подразделение,
	               |	НАЧАЛОПЕРИОДА(ИмущественныеВычеты.Период, МЕСЯЦ)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	НачисленныйУдержанныйНДФЛ.ВидЗаписи,
	               |	НачисленныйУдержанныйНДФЛ.Период,
	               |	НАЧАЛОПЕРИОДА(НачисленныйУдержанныйНДФЛ.МесяцНалоговогоПериода, МЕСЯЦ),
	               |	НачисленныйУдержанныйНДФЛ.ГоловнаяОрганизация,
	               |	НачисленныйУдержанныйНДФЛ.Организация,
	               |	НачисленныйУдержанныйНДФЛ.ФизическоеЛицо,
	               |	НачисленныйУдержанныйНДФЛ.РегистрацияВНалоговомОргане,
	               |	НачисленныйУдержанныйНДФЛ.Ставка,
	               |	СУММА(НачисленныйУдержанныйНДФЛ.СуммаНалога),
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	НачисленныйУдержанныйНДФЛ.Документ,
	               |	НачисленныйУдержанныйНДФЛ.ДатаВыплаты,
	               |	НачисленныйУдержанныйНДФЛ.Подразделение,
	               |	НачисленныйУдержанныйНДФЛ.ДокументОснование
	               |ИЗ
	               |	ВТНачисленныйУдержанныйНДФЛ КАК НачисленныйУдержанныйНДФЛ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТФизическиеЛицаСтатусыНДФЛ КАК ФизическиеЛицаСтатусыНДФЛ
	               |		ПО НачисленныйУдержанныйНДФЛ.ФизическоеЛицо = ФизическиеЛицаСтатусыНДФЛ.ФизическоеЛицо
	               |			И (НАЧАЛОПЕРИОДА(НачисленныйУдержанныйНДФЛ.МесяцНалоговогоПериода, МЕСЯЦ) = ФизическиеЛицаСтатусыНДФЛ.Период)
	               |ГДЕ
	               |	НачисленныйУдержанныйНДФЛ.МесяцНалоговогоПериода МЕЖДУ &НачалоПериода И &КонецПериода
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	НачисленныйУдержанныйНДФЛ.Период,
	               |	НАЧАЛОПЕРИОДА(НачисленныйУдержанныйНДФЛ.МесяцНалоговогоПериода, МЕСЯЦ),
	               |	НачисленныйУдержанныйНДФЛ.ГоловнаяОрганизация,
	               |	НачисленныйУдержанныйНДФЛ.Организация,
	               |	НачисленныйУдержанныйНДФЛ.ФизическоеЛицо,
	               |	НачисленныйУдержанныйНДФЛ.РегистрацияВНалоговомОргане,
	               |	ФизическиеЛицаСтатусыНДФЛ.Статус,
	               |	НачисленныйУдержанныйНДФЛ.Ставка,
	               |	НачисленныйУдержанныйНДФЛ.ВидЗаписи,
	               |	НачисленныйУдержанныйНДФЛ.Документ,
	               |	НачисленныйУдержанныйНДФЛ.ДатаВыплаты,
	               |	НачисленныйУдержанныйНДФЛ.Подразделение,
	               |	НачисленныйУдержанныйНДФЛ.ДокументОснование
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	4,
	               |	НАЧАЛОПЕРИОДА(УплаченныйНДФЛ.Период, МЕСЯЦ),
	               |	НАЧАЛОПЕРИОДА(УплаченныйНДФЛ.МесяцНалоговогоПериода, МЕСЯЦ),
	               |	УплаченныйНДФЛ.Организация.ГоловнаяОрганизация,
	               |	УплаченныйНДФЛ.Организация,
	               |	УплаченныйНДФЛ.ФизическоеЛицо,
	               |	УплаченныйНДФЛ.РегистрацияВНалоговомОргане,
	               |	УплаченныйНДФЛ.Ставка,
	               |	СУММА(ЕСТЬNULL(ВЫБОР
	               |				КОГДА УплаченныйНДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	               |					ТОГДА УплаченныйНДФЛ.Сумма
	               |				ИНАЧЕ 0
	               |			КОНЕЦ, 0)),
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	NULL
	               |ИЗ
	               |	РегистрНакопления.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ КАК УплаченныйНДФЛ
	               |ГДЕ
	               |	УплаченныйНДФЛ.МесяцНалоговогоПериода МЕЖДУ &НачалоПериода И &КонецПериода
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	НАЧАЛОПЕРИОДА(УплаченныйНДФЛ.Период, МЕСЯЦ),
	               |	НАЧАЛОПЕРИОДА(УплаченныйНДФЛ.МесяцНалоговогоПериода, МЕСЯЦ),
	               |	УплаченныйНДФЛ.Организация.ГоловнаяОрганизация,
	               |	УплаченныйНДФЛ.Организация,
	               |	УплаченныйНДФЛ.ФизическоеЛицо,
	               |	УплаченныйНДФЛ.РегистрацияВНалоговомОргане,
	               |	УплаченныйНДФЛ.Ставка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	1,
	               |	НАЧАЛОПЕРИОДА(УплаченныйНДФЛ.Период, МЕСЯЦ),
	               |	NULL,
	               |	УплаченныйНДФЛ.Организация.ГоловнаяОрганизация,
	               |	УплаченныйНДФЛ.Организация,
	               |	УплаченныйНДФЛ.ФизическоеЛицо,
	               |	УплаченныйНДФЛ.РегистрацияВНалоговомОргане,
	               |	NULL,
	               |	СУММА(ЕСТЬNULL(УплаченныйНДФЛ.СуммаНачальныйОстаток, 0)),
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	NULL
	               |ИЗ
	               |	РегистрНакопления.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, МЕСЯЦ, , ) КАК УплаченныйНДФЛ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	НАЧАЛОПЕРИОДА(УплаченныйНДФЛ.Период, МЕСЯЦ),
	               |	УплаченныйНДФЛ.Организация.ГоловнаяОрганизация,
	               |	УплаченныйНДФЛ.Организация,
	               |	УплаченныйНДФЛ.ФизическоеЛицо,
	               |	УплаченныйНДФЛ.РегистрацияВНалоговомОргане
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	5,
	               |	НАЧАЛОПЕРИОДА(УплаченныйНДФЛ.Период, МЕСЯЦ),
	               |	NULL,
	               |	УплаченныйНДФЛ.Организация.ГоловнаяОрганизация,
	               |	УплаченныйНДФЛ.Организация,
	               |	УплаченныйНДФЛ.ФизическоеЛицо,
	               |	УплаченныйНДФЛ.РегистрацияВНалоговомОргане,
	               |	NULL,
	               |	СУММА(ЕСТЬNULL(УплаченныйНДФЛ.СуммаКонечныйОстаток, 0)),
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	NULL
	               |ИЗ
	               |	РегистрНакопления.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, МЕСЯЦ, , ) КАК УплаченныйНДФЛ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	НАЧАЛОПЕРИОДА(УплаченныйНДФЛ.Период, МЕСЯЦ),
	               |	УплаченныйНДФЛ.Организация.ГоловнаяОрганизация,
	               |	УплаченныйНДФЛ.Организация,
	               |	УплаченныйНДФЛ.ФизическоеЛицо,
	               |	УплаченныйНДФЛ.РегистрацияВНалоговомОргане
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПолныеСведенияНДФЛ.ВидЗаписи КАК ВидЗаписи,
	               |	ПолныеСведенияНДФЛ.Период КАК Период,
	               |	ПолныеСведенияНДФЛ.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	               |	ПолныеСведенияНДФЛ.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	               |	ПолныеСведенияНДФЛ.Организация КАК Организация,
	               |	ПолныеСведенияНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
	               |	ПолныеСведенияНДФЛ.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	               |	ПолныеСведенияНДФЛ.Ставка КАК Ставка,
	               |	СУММА(ПолныеСведенияНДФЛ.Доход) КАК Доход,
	               |	СУММА(ПолныеСведенияНДФЛ.Вычет) КАК Вычет,
	               |	СУММА(ПолныеСведенияНДФЛ.ДоходМатпомощь) КАК ДоходМатпомощь,
	               |	СУММА(ПолныеСведенияНДФЛ.ВычетМатпомощь) КАК ВычетМатпомощь,
	               |	СУММА(ПолныеСведенияНДФЛ.ИмущественныйВычет) КАК ИмущественныйВычет,
	               |	СУММА(ПолныеСведенияНДФЛ.СтандартныйВычет) КАК СтандартныйВычет,
	               |	СУММА(ПолныеСведенияНДФЛ.СуммаНалога) КАК СуммаНалога,
	               |	ПолныеСведенияНДФЛ.Документ КАК Документ,
	               |	ПолныеСведенияНДФЛ.ДатаВыплаты КАК ДатаВыплаты,
	               |	ПолныеСведенияНДФЛ.ДокументОснование,
	               |	ВедомостьНаВыплатуЗарплатыВБанкНДФЛ.Ссылка.Дата КАК ВедомостьДатаВыплаты,
	               |	ПолныеСведенияНДФЛ.Подразделение
	               |{ВЫБРАТЬ
	               |	ВидЗаписи,
	               |	Период,
	               |	МесяцНалоговогоПериода,
	               |	ГоловнаяОрганизация.*,
	               |	Организация.*,
	               |	ФизическоеЛицо.*,
	               |	РегистрацияВНалоговомОргане.*,
	               |	Ставка,
	               |	Доход,
	               |	Вычет,
	               |	ДоходМатпомощь,
	               |	ВычетМатпомощь,
	               |	ИмущественныйВычет,
	               |	СтандартныйВычет,
	               |	СуммаНалога,
	               |	Документ,
	               |	ДатаВыплаты}
	               |ИЗ
	               |	ВТПолныеСведенияНДФЛ КАК ПолныеСведенияНДФЛ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВедомостьНаВыплатуЗарплатыВБанк.НДФЛ КАК ВедомостьНаВыплатуЗарплатыВБанкНДФЛ
	               |		ПО ПолныеСведенияНДФЛ.Документ = ВедомостьНаВыплатуЗарплатыВБанкНДФЛ.Ссылка
	               |			И ПолныеСведенияНДФЛ.ФизическоеЛицо = ВедомостьНаВыплатуЗарплатыВБанкНДФЛ.ФизическоеЛицо
	               |			И ПолныеСведенияНДФЛ.СуммаНалога = ВедомостьНаВыплатуЗарплатыВБанкНДФЛ.Сумма
	               |ГДЕ
	               |	ПолныеСведенияНДФЛ.ВидЗаписи <> 1
	               |	И ПолныеСведенияНДФЛ.ВидЗаписи <> 5
	               |	И ТИПЗНАЧЕНИЯ(ПолныеСведенияНДФЛ.Документ) <> ТИП(Документ.Отпуск)
	               |	И ТИПЗНАЧЕНИЯ(ПолныеСведенияНДФЛ.Документ) <> ТИП(Документ.БольничныйЛист)
	               |{ГДЕ
	               |	ПолныеСведенияНДФЛ.ВидЗаписи,
	               |	ПолныеСведенияНДФЛ.Период,
	               |	ПолныеСведенияНДФЛ.МесяцНалоговогоПериода,
	               |	ПолныеСведенияНДФЛ.ГоловнаяОрганизация.*,
	               |	ПолныеСведенияНДФЛ.Организация.*,
	               |	ПолныеСведенияНДФЛ.ФизическоеЛицо.*,
	               |	ПолныеСведенияНДФЛ.РегистрацияВНалоговомОргане.*,
	               |	ПолныеСведенияНДФЛ.Ставка,
	               |	ПолныеСведенияНДФЛ.Доход,
	               |	ПолныеСведенияНДФЛ.Вычет,
	               |	ПолныеСведенияНДФЛ.ДоходМатпомощь,
	               |	ПолныеСведенияНДФЛ.ВычетМатпомощь,
	               |	ПолныеСведенияНДФЛ.ИмущественныйВычет,
	               |	ПолныеСведенияНДФЛ.СтандартныйВычет,
	               |	ПолныеСведенияНДФЛ.СуммаНалога,
	               |	ПолныеСведенияНДФЛ.Документ,
	               |	ПолныеСведенияНДФЛ.ДатаВыплаты}
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПолныеСведенияНДФЛ.ВидЗаписи,
	               |	ПолныеСведенияНДФЛ.Период,
	               |	ПолныеСведенияНДФЛ.МесяцНалоговогоПериода,
	               |	ПолныеСведенияНДФЛ.ГоловнаяОрганизация,
	               |	ПолныеСведенияНДФЛ.Организация,
	               |	ПолныеСведенияНДФЛ.ФизическоеЛицо,
	               |	ПолныеСведенияНДФЛ.РегистрацияВНалоговомОргане,
	               |	ПолныеСведенияНДФЛ.Ставка,
	               |	ПолныеСведенияНДФЛ.Документ,
	               |	ПолныеСведенияНДФЛ.ДатаВыплаты,
	               |	ВедомостьНаВыплатуЗарплатыВБанкНДФЛ.Ссылка.Дата,
	               |	ПолныеСведенияНДФЛ.Подразделение,
	               |	ПолныеСведенияНДФЛ.ДокументОснование
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ВТФизическиеЛицаПериоды
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ВТФизическиеЛицаСтатусыНДФЛ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ВТНачисленныйУдержанныйНДФЛ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ВТПолныеСведенияНДФЛ";
	
	Запрос.УстановитьПараметр("НачалоПериода",НачалоМесяца(НачалоМесяца(Период)-1));  // Берем предыдущий месяц из-за зарплаты
	Запрос.УстановитьПараметр("КонецПериода",КонецМесяца(Период));
	Запрос.УстановитьПараметр("ДатаЗакона285ФЗ",УчетНДФЛ.ДатаЗакона285ФЗ());
	Выгрузка = Запрос.Выполнить().Выгрузить();	
	
	ИтоговаяТаблица = Новый ТаблицаЗначений;
	КвалификаторыДаты = Новый КвалификаторыДаты(ЧастиДаты.Дата);
	ИтоговаяТаблица.Колонки.Добавить("ДатаВыплаты", 			Новый ОписаниеТипов("Дата", КвалификаторыДаты));
	ИтоговаяТаблица.Колонки.Добавить("Период",		 			Новый ОписаниеТипов("Дата", КвалификаторыДаты));
	ИтоговаяТаблица.Колонки.Добавить("ДатаПеречисленияНДФЛ", 	Новый ОписаниеТипов("Дата"));
	ИтоговаяТаблица.Колонки.Добавить("НБ", 						Новый ОписаниеТипов("Число"));
	ИтоговаяТаблица.Колонки.Добавить("Вычет",					Новый ОписаниеТипов("Число"));
	ИтоговаяТаблица.Колонки.Добавить("НДФЛИсчисленный",			Новый ОписаниеТипов("Число"));
	ИтоговаяТаблица.Колонки.Добавить("НДФЛУдержанный",			Новый ОписаниеТипов("Число"));
	ИтоговаяТаблица.Колонки.Добавить("СуммаНДФЛНеудержанного",	Новый ОписаниеТипов("Число"));
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.РегистрацииВНалоговомОргане"));
	ИтоговаяТаблица.Колонки.Добавить("РегистрацияВНалоговомОргане", Новый ОписаниеТипов(МассивТипов));
	КвалификаторыСтроки = Новый КвалификаторыСтроки(11);
	ИтоговаяТаблица.Колонки.Добавить("ОКТМО", Новый ОписаниеТипов("Строка", КвалификаторыСтроки));
	КвалификаторыСтроки = Новый КвалификаторыСтроки(9);
	ИтоговаяТаблица.Колонки.Добавить("КПП", Новый ОписаниеТипов("Строка", КвалификаторыСтроки));
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.ФизическиеЛица"));
	ИтоговаяТаблица.Колонки.Добавить("ФИО", 					Новый ОписаниеТипов(МассивТипов));
	МассивТипов.Добавить(Тип("СправочникСсылка.ПодразделенияОрганизаций"));
	ИтоговаяТаблица.Колонки.Добавить("Подразделение",			Новый ОписаниеТипов(МассивТипов));	
	ИтоговаяТаблица.Колонки.Добавить("Документ", 				Документы.ТипВсеСсылки());
	
	ТаблицаПроизводственногоКалендаря = ПолучитьПроизводственныйКалендарь();
	МассивФизЛиц = ОбщегоНазначенияКлиентСервер.СвернутьМассив(Выгрузка.ВыгрузитьКолонку("ФизическоеЛицо"));
	Для Каждого ФизЛицо из МассивФизЛиц Цикл 
		
 		ПромежуточныйРезультат = ИтоговаяТаблица.СкопироватьКолонки();
		
		ТаблицаОтбор = Выгрузка.Скопировать(Новый Структура("ФизическоеЛицо",ФизЛицо));		
		ТаблицаОтбор.Свернуть("ВедомостьДатаВыплаты, ВидЗаписи, ГоловнаяОрганизация, ДатаВыплаты, Документ, ДокументОснование, 
		|Организация, Период, РегистрацияВНалоговомОргане, Ставка, ФизическоеЛицо, Подразделение",
		"Вычет, ВычетМатпомощь, Доход, ДоходМатПомощь, ИмущественныйВычет, СтандартныйВычет, СуммаНалога");
		
		ТаблицаДохода = ТаблицаОтбор.СкопироватьКолонки();
		Для Каждого СтрокаДохода Из ТаблицаОтбор Цикл 
			Если СтрокаДохода.Доход<>0 Тогда 
				НоваяСтрока = ТаблицаДохода.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДохода);
			КонецЕсли;
		КонецЦикла;
		
		// Добавим документы, по которым нет дохода, но есть налог
		Для Каждого СтрокаДанных Из ТаблицаОтбор Цикл 
			Если СтрокаДанных.СуммаНалога <> 0 И СтрокаДанных.ВидЗаписи = 2 Тогда 
				Документ = СтрокаДанных.Документ;
				НайденныеСтроки = ТаблицаДохода.НайтиСтроки(Новый Структура("Документ",Документ));
				Если НайденныеСтроки.Количество()=0 Тогда 
					НоваяСтрока = ТаблицаДохода.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанных);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого СтрокаДохода Из ТаблицаДохода Цикл 
			НоваяСтрока = ПромежуточныйРезультат.Добавить();
			НоваяСтрока.Документ 					= СтрокаДохода.Документ;
			НоваяСтрока.НБ 							= СтрокаДохода.Доход;
			НоваяСтрока.ФИО 						= СтрокаДохода.ФизическоеЛицо;
			НоваяСтрока.Вычет 						= СтрокаДохода.ИмущественныйВычет + СтрокаДохода.СтандартныйВычет+СтрокаДохода.ВычетМатпомощь;
			НоваяСтрока.РегистрацияВНалоговомОргане = СтрокаДохода.РегистрацияВНалоговомОргане;
			НоваяСтрока.Подразделение				= СтрокаДохода.Подразделение;
			НоваяСтрока.Период 						= СтрокаДохода.Период;
		КонецЦикла;		
		
		Для Каждого СтрокаДанных Из ПромежуточныйРезультат Цикл 
			Для Каждого СтрокаОтбора Из ТаблицаОтбор Цикл 
				Если СтрокаОтбора.Документ = СтрокаДанных.Документ И СтрокаОтбора.ВидЗаписи = 2 И СтрокаОтбора.СуммаНалога <> 0 И СтрокаОтбора.Подразделение = СтрокаДанных.Подразделение Тогда 
					СтрокаДанных.НДФЛИсчисленный = СтрокаОтбора.СуммаНалога;
					Прервать;
				КонецЕсли;
			КонецЦикла;			
		КонецЦикла;
		
		Для Каждого СтрокаДанных Из ПромежуточныйРезультат Цикл 
			НайденныеСтроки = ТаблицаОтбор.НайтиСтроки(Новый Структура("ДокументОснование, ВидЗаписи, Подразделение", СтрокаДанных.Документ, 3, СтрокаДанных.Подразделение));
			Если НайденныеСтроки.Количество()>0 Тогда 
				СтрокаДанных.НДФЛУдержанный = НайденныеСтроки[0].СуммаНалога;
				СтрокаДанных.ДатаВыплаты = НайденныеСтроки[0].ВедомостьДатаВыплаты;  
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого СтрокаДанных Из ПромежуточныйРезультат Цикл 
			СтрокаДанных.СуммаНДФЛНеудержанного = СтрокаДанных.НДФЛИсчисленный - СтрокаДанных.НДФЛУдержанный;
		КонецЦикла;
		
		// Дозаполним дату, если она не заполнена		
		Для Каждого СтрокаДанных  Из ПромежуточныйРезультат Цикл 
			Если Не ЗначениеЗаполнено(СтрокаДанных.ДатаВыплаты) И (ТипЗнч(СтрокаДанных.Документ) = Тип("ДокументСсылка.Премия") 
				ИЛИ ТипЗнч(СтрокаДанных.Документ) = Тип("ДокументСсылка.БольничныйЛист") 
				ИЛИ ТипЗнч(СтрокаДанных.Документ) = Тип("ДокументСсылка.Увольнение")
				ИЛИ ТипЗнч(СтрокаДанных.Документ) = Тип("ДокументСсылка.РазовоеНачисление")
				ИЛИ ТипЗнч(СтрокаДанных.Документ) = Тип("ДокументСсылка.ОплатаПоСреднемуЗаработку")
				ИЛИ ТипЗнч(СтрокаДанных.Документ) = Тип("ДокументСсылка.МатериальнаяПомощь")
				ИЛИ ТипЗнч(СтрокаДанных.Документ) = Тип("ДокументСсылка.Отпуск")) Тогда 
				СтрокаДанных.ДатаВыплаты = СтрокаДанных.Документ.ПланируемаяДатаВыплаты;
			//ИначеЕсли Не ЗначениеЗаполнено(СтрокаДанных.ДатаВыплаты) И ТипЗнч(СтрокаДанных.Документ) = Тип("ДокументСсылка.ДоходВНатуральнойФорме") Тогда 
			//	СтрокаДанных.ДатаВыплаты = СтрокаДанных.Документ.ДатаПолученияДохода;
			ИначеЕсли Не ЗначениеЗаполнено(СтрокаДанных.ДатаВыплаты) И (ТипЗнч(СтрокаДанных.Документ) = Тип("ДокументСсылка.НачислениеЗарплаты") ИЛИ ТипЗнч(СтрокаДанных.Документ) = Тип("ДокументСсылка.ДоходВНатуральнойФорме")) Тогда 
				СтрокаДанных.ДатаВыплаты = ОпределитьДатуВыплатыНачисленияЗарплаты(СтрокаДанных.Документ.МесяцНачисления, ТаблицаПроизводственногоКалендаря, СтрокаДанных.Документ);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого СтрокаДанных Из ПромежуточныйРезультат Цикл 
			НоваяСтрокаИтог = ИтоговаяТаблица.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаИтог, СтрокаДанных);
			Если ЗначениеЗаполнено(СтрокаДанных.РегистрацияВНалоговомОргане) Тогда 
				НоваяСтрокаИтог.ОКТМО	= СтрокаДанных.РегистрацияВНалоговомОргане.КодПоОКТМО;
				НоваяСтрокаИтог.КПП		= СтрокаДанных.РегистрацияВНалоговомОргане.КПП;
			КонецЕсли;
		КонецЦикла;	
		
	КонецЦикла;
	
	ТаблицаНаОтбор = ИтоговаяТаблица.Скопировать(,"Период,ДатаВыплаты,НДФЛУдержанный,НДФЛИсчисленный, СуммаНДФЛНеудержанного, ФИО,РегистрацияВНалоговомОргане,Подразделение, ОКТМО,КПП");
	ЗапросОтбор = Новый Запрос();
	ЗапросОтбор.Текст = "ВЫБРАТЬ
						|	ВЫРАЗИТЬ(Таблица.Период КАК ДАТА) КАК Период,
	                    |	ВЫРАЗИТЬ(Таблица.ДатаВыплаты КАК ДАТА) КАК ДатаВыплаты,
	                    |	ВЫРАЗИТЬ(Таблица.НДФЛУдержанный КАК ЧИСЛО(15, 2)) КАК Сумма,
						|	ВЫРАЗИТЬ(Таблица.СуммаНДФЛНеудержанного КАК ЧИСЛО(15, 2)) КАК НДФЛНеудержанный, 
	                    |	ВЫРАЗИТЬ(Таблица.ФИО КАК Справочник.ФизическиеЛица) КАК ФизическоеЛицо,
	                    |	Таблица.РегистрацияВНалоговомОргане,
						|	Таблица.Подразделение,
	                    |	Таблица.ОКТМО,
	                    |	Таблица.КПП
	                    |ПОМЕСТИТЬ ВТДанные
	                    |ИЗ
	                    |	&Таблица КАК Таблица
	                    |;
	                    |
	                    |////////////////////////////////////////////////////////////////////////////////
	                    |ВЫБРАТЬ
						|	ВТДанные.Период,
	                    |	ВТДанные.ДатаВыплаты,
	                    |	СУММА(ВТДанные.Сумма) КАК Сумма,
						|	СУММА(ВТДанные.НДФЛНеудержанный) КАК НДФЛНеудержанный,
	                    |	ВТДанные.ФизическоеЛицо,
	                    |	ВТДанные.РегистрацияВНалоговомОргане,
						|	ВТДанные.Подразделение,
	                    |	ВТДанные.ОКТМО КАК ОКТМО,
	                    |	ВТДанные.КПП КАК КПП,
	                    |	ВТДанные.ФизическоеЛицо.Наименование КАК ФизическоеЛицоНаименование
	                    |ИЗ
	                    |	ВТДанные КАК ВТДанные
	                    |ГДЕ
	                    |	ВТДанные.ДатаВыплаты МЕЖДУ &НачалоПериода И &КонецПериода
	                    |
	                    |СГРУППИРОВАТЬ ПО
	                    |	ВТДанные.ФизическоеЛицо,
	                    |	ВТДанные.РегистрацияВНалоговомОргане,
						|	ВТДанные.Подразделение,
						|	ВТДанные.Период,
	                    |	ВТДанные.ДатаВыплаты,
	                    |	ВТДанные.ОКТМО,
	                    |	ВТДанные.КПП
	                    |
	                    |УПОРЯДОЧИТЬ ПО
	                    |	ФизическоеЛицоНаименование
	                    |;
	                    |
	                    |////////////////////////////////////////////////////////////////////////////////
	                    |УНИЧТОЖИТЬ ВТДанные";
	ЗапросОтбор.УстановитьПараметр("Таблица",ТаблицаНаОтбор);							
	ЗапросОтбор.УстановитьПараметр("НачалоПериода",НачалоДня(Период));
	ЗапросОтбор.УстановитьПараметр("КонецПериода",КонецДня(Период));	
	
	ТаблицаВыгрузка = ЗапросОтбор.Выполнить().Выгрузить();
	
	Возврат ТаблицаВыгрузка;

КонецФункции

&НаСервере
Функция ПолучитьПроизводственныйКалендарь()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДанныеПроизводственногоКалендаря.Дата,
	               |	ДанныеПроизводственногоКалендаря.ВидДня
	               |ИЗ
	               |	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря";
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

&НаСервере
Функция ОпределитьДатуВыплатыНачисленияЗарплаты(Месяц, ТаблицаПроизводственногоКалендаря, Документ)
	ДатаВедомости = НайтиДатуЗарплатыВВедомости(Документ);	
	Если ЗначениеЗаполнено(ДатаВедомости) Тогда 
		Возврат ДатаВедомости;
	КонецЕсли;
	
	ДатаДняВыплаты = 5;
	МесяцВыплаты = Месяц(Месяц) + 1;
	Если Месяц(Месяц) = 12 Тогда 
		МесяцВыплаты = МесяцВыплаты - 1;
		ДатаДняВыплаты = 31;
	КонецЕсли; 
	ПланируемаяДатаВыплаты = Дата(Год(Месяц),МесяцВыплаты, ДатаДняВыплаты);
	Если Не РабочийДень(ПланируемаяДатаВыплаты, ТаблицаПроизводственногоКалендаря) Тогда 
		Возврат	НайтиРабочийДень(ПланируемаяДатаВыплаты, ТаблицаПроизводственногоКалендаря);
	Иначе 		
		Возврат ПланируемаяДатаВыплаты;
	КонецЕсли;
КонецФункции

&НаСервере
Функция НайтиДатуЗарплатыВВедомости(Документ)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВедомостьНаВыплатуЗарплатыВБанкНДФЛ.Ссылка.Дата КАК Дата
	|ИЗ
	|	Документ.ВедомостьНаВыплатуЗарплатыВБанк.НДФЛ КАК ВедомостьНаВыплатуЗарплатыВБанкНДФЛ
	|ГДЕ
	|	ВедомостьНаВыплатуЗарплатыВБанкНДФЛ.ДокументОснование = &ДокументОснование";
	Запрос.УстановитьПараметр("ДокументОснование",Документ);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Дата;	
КонецФункции

&НаСервере
Функция НайтиРабочийДень(Дата, ТаблицаПроизводственногоКалендаря)
	ПроверяемаяДата = НачалоДня(НачалоДня(Дата)-1);
	Если Не РабочийДень(ПроверяемаяДата, ТаблицаПроизводственногоКалендаря) Тогда 
		НайтиРабочийДень(ПроверяемаяДата, ТаблицаПроизводственногоКалендаря);
	КонецЕсли;
	
	Возврат ПроверяемаяДата;
КонецФункции

&НаСервере
Функция РабочийДень(Дата, ТаблицаПроизводственногоКалендаря)
	
	НайденныеСтроки = ТаблицаПроизводственногоКалендаря.НайтиСтроки(Новый Структура("Дата",Дата));
	Если НайденныеСтроки.Количество()>0 Тогда 
		Если НайденныеСтроки[0].ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий ИЛИ 
			НайденныеСтроки[0].ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Предпраздничный Тогда 
			Возврат Истина;
		Иначе 
			Возврат Ложь;
		КонецЕсли;
	Иначе 
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Период = НачалоДня(ТекущаяДата());
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДокументы(Команда)
	СформироватьДокументыНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьДокументыНаСервере()
	
	Если Объект.СписокФизЛиц.Количество()=0 Тогда 
		Возврат;
	КонецЕсли;
	
	Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
	ТЗ = Объект.СписокФизЛиц.Выгрузить();
	МассивРегистраций 	= ОбщегоНазначенияКлиентСервер.СвернутьМассив(Тз.ВыгрузитьКолонку("РегистрацияВНалоговомОргане"));
	МассивПериодов = ОбщегоНазначенияКлиентСервер.СвернутьМассив(Тз.ВыгрузитьКолонку("Период"));
	
	Для Каждого Регистрация из МассивРегистраций Цикл 
		Для Каждого НалоговыйПериод Из МассивПериодов Цикл 
			Отбор = Новый Структура("РегистрацияВНалоговомОргане, Период", Регистрация, НалоговыйПериод);
			ТаблицаОтбор = ТЗ.Скопировать(Отбор);
			Если ТаблицаОтбор.Количество() <> 0 Тогда 
				ДокПеречислениеНДФЛ = Документы.ППФ_ПеречислениеНДФЛВБюджет.СоздатьДокумент();
				ДокПеречислениеНДФЛ.ДатаПлатежа 				= НачалоДня(Период);
				ДокПеречислениеНДФЛ.Дата 						= НачалоДня(Период);
				ДокПеречислениеНДФЛ.Организация 				= Организация;
				ДокПеречислениеНДФЛ.МесяцНалоговогоПериода 		= НачалоДня(НачалоМесяца(НалоговыйПериод));
				ДокПеречислениеНДФЛ.РегистрацияВНалоговомОргане	= Регистрация;			
				ДокПеречислениеНДФЛ.ОКТМО_КПП					= Регистрация.КодПоОКТМО + "/" + Регистрация.КПП;
				ДокПеречислениеНДФЛ.Ответственный 				= ПараметрыСеанса.ТекущийПользователь;
				ДокПеречислениеНДФЛ.Сумма 						= ТаблицаОтбор.Итог("Сумма");
				ТЧФизическиеЛица = ДокПеречислениеНДФЛ.ФизическиеЛица;
				Для Каждого СтрокаДанных Из ТаблицаОтбор Цикл 
					НоваяЗапись = ТЧФизическиеЛица.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаДанных);
				КонецЦикла;
				Попытка
					ДокПеречислениеНДФЛ.Записать(РежимЗаписиДокумента.Проведение);
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = НСтр("ru = 'Проведен документ - '") + Строка(ДокПеречислениеНДФЛ.Ссылка);
					Сообщение.Сообщить(); 
				Исключение
					ДокПеречислениеНДФЛ.Записать(РежимЗаписиДокумента.Запись);
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = НСтр("ru = 'Записан документ - '") + Строка(ДокПеречислениеНДФЛ.Ссылка);
					Сообщение.Сообщить(); 
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоКПП(Команда)
	ТекущаяСтрока = Элементы.СписокФизЛиц.ТекущиеДанные;
	Если ТекущаяСтрока<>Неопределено Тогда 
		ТекущийКПП = ТекущаяСтрока.РегистрацияВНалоговомОргане;
		Если ТекущийКПП<>Неопределено Тогда				
			ОтборПоКПП_НаСервере(ТекущийКПП);                              
		КонецЕсли;
	КонецЕсли;    
КонецПроцедуры

&НаСервере
Процедура ОтборПоКПП_НаСервере(ТекущийКПП)
		ТаблицаКопия = Объект.СписокФизЛиц.Выгрузить(Новый Структура("РегистрацияВНалоговомОргане", ТекущийКПП));
		Объект.СписокФизЛиц.Очистить();
		Объект.СписокФизЛиц.Загрузить(ТаблицаКопия);
КонецПроцедуры
