Перем КаталогИмпорта;
//Перем ЛогФайл;
//Перем ЛогФайлИмя;

Перем Всплывающее;//1
Перем Статус;//2
Перем ВСообщение;//4
Перем Лог;//8
Перем ИмяРеестра;
Перем ПустаяДата;

Процедура ВывестиСообщение (СпособВывода,Сообщение)
	Выводить=СпособВывода;
	Если Выводить>=8 Тогда
		//Лог
		Выводить=Выводить-8;
		Попытка
			//ЛогФайл.ЗаписатьСтроку(Сообщение);
		Исключение
		КонецПопытки;
	КонецЕсли;
	Если Выводить>=4 Тогда
		//ВСообщение
		Выводить=Выводить-4;
		Сообщить(Сообщение);
	КонецЕсли;
	Если Выводить>=2 Тогда
		//Статус
		Выводить=Выводить-2;
		Состояние(Сообщение);
	КонецЕсли;
	Если Выводить>=1 Тогда
		//Всплывающее
		Выводить=Выводить-1;
		Предупреждение(Сообщение);
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьРеквизит (Стр,Номер)
	СтрокаСРеквизитами=Стр;
	НомерРекв=Номер;
	Пока НомерРекв>1 Цикл
		СтрокаСРеквизитами=СтрокаСРеквизитами+";";
		СтрокаСРеквизитами=Сред(СтрокаСРеквизитами,Найти(СтрокаСРеквизитами,";")+1,СтрДлина(СтрокаСРеквизитами));
		НомерРекв=НомерРекв-1
	КонецЦикла;
	Возврат(Лев(СтрокаСРеквизитами,Найти(СтрокаСРеквизитами,";")-1));
КонецФункции

Функция ИзвлечьДату (Исходное)
	Возврат Дата(Число(Сред(Исходное,7,4)),Число(Сред(Исходное,4,2)),Число(Сред(Исходное,1,2)));
КонецФункции

Процедура КнопкаВыполнитьНажатие(Кнопка)
	ВывестиСообщение(ВСообщение,"-------------------------");
	ВывестиСообщение(Лог+ВСообщение,"Начало загрузки премий");
	ВывестиСообщение(Лог+ВСообщение,"-------------------------");
	Отменить=Ложь;
	Если СокрЛП(ФайлДляЗагрузки)="" Тогда
		ВывестиСообщение(ВСообщение,"Файл для импорта не выбран.");
		Отменить=Истина;
	КонецЕсли;
	ФС=Новый Файл(ФайлДляЗагрузки);
	Если НЕ ФС.Существует() Тогда
		ВывестиСообщение(Лог+ВСообщение,"Файл для импорта не существует.");
		Отменить=Истина;
	КонецЕсли;
	Если Организация=Справочники.Организации.ПустаяСсылка() Тогда
		ВывестиСообщение(Лог+ВСообщение,"Организация не выбрана.");
		Отменить=Истина;
	КонецЕсли;
	Если ОсновноеНачисление=ПланыВидовРасчета.ДополнительныеНачисленияОрганизаций.ПустаяСсылка() Тогда
		ВывестиСообщение(Лог+ВСообщение,"Основное начисление не выбрано.");
		Отменить=Истина;
	КонецЕсли;
	Если ДатаНачисления=Дата(1,1,1) Тогда
		ВывестиСообщение(Лог+ВСообщение,"Дата начисления не выбрана.");
		Отменить=Истина;
	КонецЕсли;
	
	Если Отменить Тогда
		ВывестиСообщение(?(СокрЛП(ФайлДляЗагрузки)="",0,Лог)+ВСообщение+Всплывающее,"Импорт отменен.");
		Возврат;
	КонецЕсли;
	
	ДокНЗ=Документы.РегистрацияРазовыхНачисленийРаботниковОрганизаций.СоздатьДокумент();
	ДокНЗ.Дата 				= ДатаНачисления;
	ДокНЗ.Организация		= Организация;
	ДокНЗ.ПериодРегистрации	= ДокНЗ.Дата;
	ДокНЗ.Ответственный		= ОбщегоНазначенияЗК.ПолучитьЗначениеПеременной("глТекущийПользователь");
	ДокНЗ.ДатаВыплатыДохода = КонецМесяца(ДокНЗ.Дата);
	
	//обработка файла
	Загружаем = ПрочитатьТабличныйДокументИзExcel(ФайлДляЗагрузки, 1);
	НачатьТранзакцию();
	Для Каждого Стр Из Загружаем Цикл
		ФИО=Стр.ФИО;
		ТабНомер=Стр.ТабНомер;
		Попытка
			Сумма=Число(Стр.Сумма);
		Исключение
			ВывестиСообщение(Лог+ВСообщение,"Неверный формат суммы в строке "+Число(Загружаем.Индекс(Стр)+2)+": "+Стр.Сумма+". Импорт отменен.");
			Возврат
		КонецПопытки;
		
		Сотр=Справочники.СотрудникиОрганизаций.НайтиПоКоду(ТабНомер);
		Если Сотр=Справочники.СотрудникиОрганизаций.ПустаяСсылка() Тогда
			ВывестиСообщение(Лог+ВСообщение,"Сотрудник с табельным номером "+ТабНомер+" не найден. Импорт отменен.");
			Возврат
		ИначеЕсли СокрЛП(ФИО)<>СокрЛП(Сотр.Наименование) Тогда
			ВывестиСообщение(Лог+ВСообщение,"ФИО сотрудника в файле в строке "+Число(Загружаем.Индекс(Стр)+2)+": "+ФИО+"."+Символы.ВК+Символы.ПС+
											"ФИО сотрудника в базе: "+Сотр.Наименование+";"+Символы.ВК+Символы.ПС+
											"Несовпадение ФИО. Импорт отменен");
			Возврат
		КонецЕсли;			
		СтрДок=ДокНЗ.ДополнительныеНачисления.Добавить();
		СтрДок.Сотрудник 	= Сотр;
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Дата, Организация = &Организация) КАК РаботникиОрганизацийСрезПоследних
		|ГДЕ
		|	РаботникиОрганизацийСрезПоследних.Сотрудник = &Сотрудник";
		
		Запрос.УстановитьПараметр("Дата", ДатаНачисления);
		Запрос.УстановитьПараметр("Сотрудник", Сотр);
		Запрос.УстановитьПараметр("Организация",Организация );
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
		
		СтрДок.ПодразделениеОрганизации=Выборка.ПодразделениеОрганизации;	
		
		КонецЦикла;
		СтрДок.Показатель1 	= Сумма;
		СтрДок.Результат	= Сумма;
		СтрДок.Авторасчет	= Истина;
		СтрДок.Физлицо		= Сотр.Физлицо;
		СтрДок.ВидРасчета 	= ОсновноеНачисление;
		
		Попытка
			СтрДок.ДатаНачала   = ИзвлечьДату(Стр.ДатаНачала);
		Исключение
			
		КонецПопытки;
		
		Попытка
			СтрДок.ДатаОкончания   = ИзвлечьДату(Стр.ДатаОкончания);
		Исключение
			
		КонецПопытки;	
		
	КонецЦикла;
	ЗафиксироватьТранзакцию();
	ДокНЗ.Записать(РежимЗаписиДокумента.Запись);
	ВывестиСообщение(Лог+ВСообщение,"Создан документ "+Строка(ДокНЗ));
	ВывестиСообщение(Лог+ВСообщение,"Импорт завершен в "+ТекущаяДата());
	ВывестиСообщение(Всплывающее,"Импорт завершен.");
КонецПроцедуры

Процедура ФайлДляЗагрузкиНачалоВыбора(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ВыборФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ВыборФайла.Заголовок = "Выберите файл с информацией о продавцах";
	ВыборФайла.ПроверятьСуществованиеФайла = Истина;
	ВыборФайла.Каталог = КаталогИмпорта;
	ВыборФайла.Фильтр = "Файлы XLS (*.xls,*.xlsx)|*.xls?";
	
	Если Не ВыборФайла.Выбрать() Тогда
		Возврат;
	Иначе
		ФайлДляЗагрузки = ВыборФайла.ПолноеИмяФайла
	КонецЕсли;
	
	КаталогИмпорта = ВыборФайла.Каталог;
	ИмяРеестра = РаботаСФайлами.ПолучитьИмяФайлаИзПолногоПути(ВыборФайла.ПолноеИмяФайла);
	
	//ЛогФайлИмя = Лев(ФайлДляЗагрузки,СтрДлина(ФайлДляЗагрузки)-4)+"_LOG.txt";
КонецПроцедуры

Функция ПрочитатьТабличныйДокументИзExcel(ИмяФайла, НомерЛистаExcel) 
	
	ВывестиСообщение(Лог+ВСообщение,"Читается файл "+ИмяФайла+"...");
	
	xlLastCell = 11;
	
	ВыбФайл = Новый Файл(ИмяФайла);
	Если НЕ ВыбФайл.Существует() Тогда
		ВывестиСообщение(Лог+ВСообщение,"Файл не существует!");
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(ИмяФайла);
		Состояние("Обработка файла Microsoft Excel...");
		ExcelЛист = Excel.Sheets(НомерЛистаExcel);
	Исключение
		ВывестиСообщение(Лог+ВСообщение,"Ошибка. Возможно неверно указан номер листа книги Excel.");
		Возврат ложь;
		
	КонецПопытки;
	
	ТабЗнач=Новый ТаблицаЗначений;
	
	ActiveCell = Excel.ActiveCell.SpecialCells(xlLastCell);
	RowCount = ActiveCell.Row;
	ColumnCount = ActiveCell.Column;
	Для Column = 1 По ColumnCount Цикл
		ИмяКолонки=СокрЛП(ExcelЛист.Cells(1,Column).Text);
		ИмяКолонки=СтрЗаменить(ИмяКолонки," ","");
		Если ИмяКолонки="" Тогда
			Прервать
		Иначе
			ТабЗнач.Колонки.Добавить(ИмяКолонки);
		КонецЕсли;
	КонецЦикла;
	ColumnCount=ТабЗнач.Колонки.Количество();
	Для Row = 2 По RowCount Цикл
		ТабСтр=ТабЗнач.Добавить();
		ВсеПустые=Истина;
		Для Column = 1 По ColumnCount Цикл
			Значение=СокрЛП(ExcelЛист.Cells(Row,Column).Text);
			Если Column=1 И Лев(Значение,1)="(" И Найти(ВРЕГ(ИмяФайла),"EMPLOYEEMOVE")>0 Тогда
				Прервать
			КонецЕсли;
			ТабСтр[Column-1]=?(Значение="NULL",Неопределено,Значение);
			Если ТабСтр[Column-1]<>"" И ТабСтр[Column-1]<>Неопределено Тогда
				ВсеПустые=Ложь
			КонецЕсли;
		КонецЦикла;
		Состояние("Обработка файла Microsoft Excel",Row,RowCount);
		Если ВсеПустые Тогда
			ТабЗнач.Удалить(ТабЗнач.Количество()-1);
			Прервать
		КонецЕсли;
	КонецЦикла;
	
	Excel.WorkBooks.Close();
	Excel = 0;
	
	Возврат ТабЗнач;
	
КонецФункции 

КаталогИмпорта="";
Всплывающее=1;
Статус=2;
ВСообщение=4;
Лог=8;
ИмяРеестра="";
ПустаяДата=Дата("000000000000");