&НаКлиенте
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ОбъектыНазначенияМассив, СозданныеОбъекты) Экспорт

   ТабличаяЧасть 		= ВладелецФормы.Объект.НДФЛ;
   ПериодРегистрации 	= ВладелецФормы.Объект.ПериодРегистрации;
   ДатаПлатежа 			= ВладелецФормы.Объект.Дата;
   Если ВладелецФормы.Объект.СпособВыплаты = ПредопределенноеЗначение("Справочник.СпособыВыплатыЗарплаты.Зарплата") Тогда 
	   ОтпускаБольничные = Ложь;
   Иначе 
	   ОтпускаБольничные = Истина;
   КонецЕсли;
   
   ТаблицаНДФЛ = Новый Массив;
   
   Для Каждого СтрокаДанных Из ТабличаяЧасть Цикл 
	   СтрокаТаблица = Новый Массив;
	   СтрокаТаблица.Добавить(СтрокаДанных.ФизическоеЛицо);
	   СтрокаТаблица.Добавить(СтрокаДанных.Сумма);
	   СтрокаТаблица.Добавить(СтрокаДанных.РегистрацияВНалоговомОргане);
	   ТаблицаНДФЛ.Добавить(СтрокаТаблица);
   КонецЦикла;
   
   СоздатьДокументыПеречисленияНДФЛВБюджет(ТаблицаНДФЛ, ПериодРегистрации, ДатаПлатежа, ОтпускаБольничные);

КонецПроцедуры

&НаСервере
Процедура СоздатьДокументыПеречисленияНДФЛВБюджет(ТаблицаДанных, ПериодРегистрации, ДатаПлатежа, ОтпускаБольничные)
	
	Если ТаблицаДанных.Количество()>0 Тогда 
		
		ТаблицаДляОбработки = Новый ТаблицаЗначений;
		ТаблицаДляОбработки.Колонки.Добавить("ФизическоеЛицо");
		ТаблицаДляОбработки.Колонки.Добавить("Сумма");
		ТаблицаДляОбработки.Колонки.Добавить("РегистрацияВНалоговомОргане");		
		
		Для Каждого СтрокаДанных Из ТаблицаДанных Цикл 
			
			НоваяСтрока = ТаблицаДляОбработки.Добавить();
			
			Для Сч=0 По 2 Цикл 
				НоваяСтрока[Сч] = СтрокаДанных[Сч];
			КонецЦикла;
			
		КонецЦикла;
		
		МассивРегистрацийВНалоговомОргане = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТаблицаДляОбработки.ВыгрузитьКолонку("РегистрацияВНалоговомОргане"));
		
		Орагнизация = Справочники.Организации.ОрганизацияПоУмолчанию();
		
		Для Каждого РегистрацияВНалоговомОргане Из МассивРегистрацийВНалоговомОргане Цикл 
			
			ТаблицаОтборПоРегистрации = ТаблицаДляОбработки.Скопировать(Новый Структура("РегистрацияВНалоговомОргане",РегистрацияВНалоговомОргане));
			
			НовыйДокумент = Документы.ППФ_ПеречислениеНДФЛВБюджет.СоздатьДокумент();
			НовыйДокумент.Дата = ТекущаяДата();
			НовыйДокумент.МесяцНалоговогоПериода = ПериодРегистрации;
			НовыйДокумент.Организация = Орагнизация;
			НовыйДокумент.РегистрацияВНалоговомОргане = РегистрацияВНалоговомОргане;
			НовыйДокумент.ОКТМО_КПП = ПолучитьОКТМО_КПП(РегистрацияВНалоговомОргане); 
			НовыйДокумент.ДатаПлатежа = ДатаПлатежа;
			НовыйДокумент.Сумма = ТаблицаОтборПоРегистрации.Итог("Сумма");
			НовыйДокумент.Ответственный = ПараметрыСеанса.ТекущийПользователь;
			НовыйДокумент.ОтпускаБольничные = ОтпускаБольничные;
			
			ТЧФизЛица = НовыйДокумент.ФизическиеЛица;
			
			Для Каждого СтрокаТаблицаСОтбором Из ТаблицаОтборПоРегистрации Цикл 
				
				ЗаполнитьЗначенияСвойств(ТЧФизЛица.Добавить(), СтрокаТаблицаСОтбором);
				
			КонецЦикла; 		
			
			Попытка
				НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
				Сообщить("Был создан документ " + НовыйДокумент.Ссылка);
			Исключение
				Сообщить(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;
			
		КонецЦикла;	
		
	Иначе 
		
		Сообщить("Нет данных. Проверьте заполненность НДФЛ в ведомости.");
		
	КонецЕсли;
			
КонецПроцедуры

&НаСервере
Функция ПолучитьОКТМО_КПП(РегистрацияВНалоговомОргане)
	
	ОКТМО_КПП = "";
		
	Если ЗначениеЗаполнено(РегистрацияВНалоговомОргане) Тогда 
		ОКТМО_КПП = РегистрацияВНалоговомОргане.КодПоОКТМО + "/" + РегистрацияВНалоговомОргане.КПП;	
	Иначе 
		ОКТМО_КПП = "45382000   /997950001";	
	КонецЕсли; 
	
	Возврат ОКТМО_КПП;
КонецФункции
