////////////////////////////////////////////////////////
// Синхронизация баз Штат и Агенты
////////////////////////////////////////////////////////
Процедура Синхронизировать(Месяц = Неопределено) Экспорт 
	Если Месяц = Неопределено Тогда 
		Дата = ТекущаяДата();
	Иначе 
		Дата = Месяц;
	КонецЕсли;
	
	Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
	НовыйДокумент = Документы.ППФ_СведенияОДоходах.СоздатьДокумент();
	НовыйДокумент.Организация 	= Организация;
	НовыйДокумент.Дата 			= Дата;
	НовыйДокумент.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	НовыйДокумент.Комментарий 	= "Документ создан автоматически. Данные заполнены за "+Дата;
	НовыйДокумент.ЗаполнитьДанные();
	Попытка
		НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
		ЗаписьЖурналаРегистрации("Документ.ППФ_СведенияОДоходах",УровеньЖурналаРегистрации.Информация, , ,"Создан документ "+НовыйДокумент.Ссылка);
	Исключение
		ЗаписьЖурналаРегистрации("Документ.ППФ_СведенияОДоходах",УровеньЖурналаРегистрации.Ошибка, , ,"Ошибка записи документа. "+ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

#Область ПрограммныйИнтерфейс

// Возвращает сведения о внешней обработке.
Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.2.2.1");
	
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
	ПараметрыРегистрации.Версия = "1.0";
	ПараметрыРегистрации.БезопасныйРежим = Ложь;
	
	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	НоваяКоманда.Представление = НСтр("ru = 'Загрузка доходов агентов'");
	НоваяКоманда.Идентификатор = "Загрузка доходов агентов";
	НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	НоваяКоманда.ПоказыватьОповещение = Истина;
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

#КонецОбласти
