#Область СведенияОВнешнейОбработке

Функция СведенияОВнешнейОбработке() Экспорт
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Вид", "ДополнительныйОтчет");
	ПараметрыРегистрации.Вставить("Наименование", "Отчет для 6-НДФЛ");
	ПараметрыРегистрации.Вставить("Версия", "1.0");
	ПараметрыРегистрации.Вставить("Информация", "Отчет для 6-НДФЛ");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
	
	Команды = ТаблицаКоманд();
	ДобавитьКоманду(Команды, "Отчет для 6-НДФЛ", "ОтчетДля6НДФЛ", "ОткрытиеФормы", Ложь, "");
	
	ПараметрыРегистрации.Вставить("Команды", Команды);
	
	Возврат ПараметрыРегистрации;
КонецФункции

Функция ТаблицаКоманд()
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	Возврат Команды;
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	ИтоговаяТаблица = ПолучитьИтоговуюТаблицу();
	
	ВнешнийНаборДанных = Новый Структура;
	ВнешнийНаборДанных.Вставить("ИтоговаяТаблица", ИтоговаяТаблица);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешнийНаборДанных, ДанныеРасшифровки);
	
	ДокументРезультат.Очистить();
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	//ДокументРезультат.ФиксацияСлева = 3;

КонецПроцедуры

Функция ПолучитьИтоговуюТаблицу()
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	СведенияОДоходах.ФизическоеЛицо,
	               |	СведенияОДоходах.МесяцНалоговогоПериода КАК Период
	               |ПОМЕСТИТЬ ВТФизическиеЛицаПериоды
	               |ИЗ
	               |	РегистрНакопления.СведенияОДоходахНДФЛ КАК СведенияОДоходах
	               |ГДЕ
	               |	СведенияОДоходах.Период МЕЖДУ &НачалоПериода И &КонецПериода
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ФизическиеЛицаПериоды.ФизическоеЛицо,
	               |	ФизическиеЛицаПериоды.Период,
	               |	ВЫБОР
	               |		КОГДА ФизическиеЛицаПериоды.Период < &ДатаЗакона285ФЗ
	               |				И СтатусФизическихЛицКакНалогоплательщиковНДФЛ.Статус = ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Беженцы)
	               |			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Нерезидент)
	               |		ИНАЧЕ ЕСТЬNULL(СтатусФизическихЛицКакНалогоплательщиковНДФЛ.Статус, ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент))
	               |	КОНЕЦ КАК Статус
	               |ПОМЕСТИТЬ ВТФизическиеЛицаСтатусыНДФЛ
	               |ИЗ
	               |	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |		СписокФизическихЛиц.ФизическоеЛицо КАК ФизическоеЛицо,
	               |		МАКСИМУМ(СтатусФизическихЛиц.Период) КАК ПериодСтатуса,
	               |		СписокФизическихЛиц.Период КАК Период
	               |	ИЗ
	               |		ВТФизическиеЛицаПериоды КАК СписокФизическихЛиц
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусФизическихЛицКакНалогоплательщиковНДФЛ КАК СтатусФизическихЛиц
	               |			ПО СписокФизическихЛиц.ФизическоеЛицо = СтатусФизическихЛиц.ФизическоеЛицо
	               |				И СписокФизическихЛиц.Период >= СтатусФизическихЛиц.Период
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		СписокФизическихЛиц.ФизическоеЛицо,
	               |		СписокФизическихЛиц.Период) КАК ФизическиеЛицаПериоды
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусФизическихЛицКакНалогоплательщиковНДФЛ КАК СтатусФизическихЛицКакНалогоплательщиковНДФЛ
	               |		ПО ФизическиеЛицаПериоды.ФизическоеЛицо = СтатусФизическихЛицКакНалогоплательщиковНДФЛ.ФизическоеЛицо
	               |			И ФизическиеЛицаПериоды.ПериодСтатуса = СтатусФизическихЛицКакНалогоплательщиковНДФЛ.Период
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВЫБОР
	               |		КОГДА НачисленныйУдержанныйНДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	               |			ТОГДА 2
	               |		КОГДА НачисленныйУдержанныйНДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
	               |			ТОГДА 3
	               |		КОГДА НачисленныйУдержанныйНДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ЗачетАвансовыхПлатежей)
	               |			ТОГДА 6
	               |		КОГДА НачисленныйУдержанныйНДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ВозвращеноНалоговымАгентом)
	               |			ТОГДА 7
	               |		КОГДА НачисленныйУдержанныйНДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ПереданоНаВзысканиеВНалоговыйОрган)
	               |			ТОГДА 8
	               |		ИНАЧЕ 3
	               |	КОНЕЦ КАК ВидЗаписи,
	               |	НАЧАЛОПЕРИОДА(НачисленныйУдержанныйНДФЛ.Период, МЕСЯЦ) КАК Период,
	               |	НАЧАЛОПЕРИОДА(НачисленныйУдержанныйНДФЛ.МесяцНалоговогоПериода, МЕСЯЦ) КАК МесяцНалоговогоПериода,
	               |	НачисленныйУдержанныйНДФЛ.ГоловнаяОрганизация,
	               |	НачисленныйУдержанныйНДФЛ.Организация,
	               |	НачисленныйУдержанныйНДФЛ.ФизическоеЛицо,
	               |	НачисленныйУдержанныйНДФЛ.РегистрацияВНалоговомОргане,
	               |	ВЫБОР
	               |		КОГДА НачисленныйУдержанныйНДФЛ.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка13)
	               |			ТОГДА ВЫБОР
	               |					КОГДА ЕСТЬNULL(ФизическиеЛицаСтатусыНДФЛ.Статус, ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент)) = ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Нерезидент)
	               |						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	               |					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	               |				КОНЕЦ
	               |		КОГДА НачисленныйУдержанныйНДФЛ.КодДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код1010)
	               |			ТОГДА ВЫБОР
	               |					КОГДА ЕСТЬNULL(ФизическиеЛицаСтатусыНДФЛ.Статус, ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент)) <> ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент)
	               |						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
	               |					КОГДА НАЧАЛОПЕРИОДА(НачисленныйУдержанныйНДФЛ.МесяцНалоговогоПериода, МЕСЯЦ) >= ДАТАВРЕМЯ(2015, 1, 1)
	               |						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	               |					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка09)
	               |				КОНЕЦ
	               |		КОГДА ЕСТЬNULL(ФизическиеЛицаСтатусыНДФЛ.Статус, ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент)) = ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент)
	               |			ТОГДА ВЫБОР
	               |					КОГДА НачисленныйУдержанныйНДФЛ.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка09)
	               |						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка09)
	               |					КОГДА НачисленныйУдержанныйНДФЛ.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка35)
	               |						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка35)
	               |					ИНАЧЕ """"""""
	               |				КОНЕЦ
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	               |	КОНЕЦ КАК Ставка,
	               |	СУММА(ВЫБОР
	               |			КОГДА НачисленныйУдержанныйНДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	               |					И НачисленныйУдержанныйНДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ВозвращеноНалоговымАгентом)
	               |				ТОГДА -НачисленныйУдержанныйНДФЛ.Сумма
	               |			ИНАЧЕ НачисленныйУдержанныйНДФЛ.Сумма
	               |		КОНЕЦ) КАК СуммаНалога,
	               |	НачисленныйУдержанныйНДФЛ.Регистратор КАК Документ,
	               |	НачисленныйУдержанныйНДФЛ.Регистратор.ПланируемаяДатаВыплаты КАК ДатаВыплаты
	               |ПОМЕСТИТЬ ВТНачисленныйУдержанныйНДФЛ
	               |ИЗ
	               |	РегистрНакопления.РасчетыНалогоплательщиковСБюджетомПоНДФЛ КАК НачисленныйУдержанныйНДФЛ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТФизическиеЛицаСтатусыНДФЛ КАК ФизическиеЛицаСтатусыНДФЛ
	               |		ПО НачисленныйУдержанныйНДФЛ.ФизическоеЛицо = ФизическиеЛицаСтатусыНДФЛ.ФизическоеЛицо
	               |			И (НАЧАЛОПЕРИОДА(НачисленныйУдержанныйНДФЛ.МесяцНалоговогоПериода, МЕСЯЦ) = ФизическиеЛицаСтатусыНДФЛ.Период)
	               |ГДЕ
	               |	НачисленныйУдержанныйНДФЛ.МесяцНалоговогоПериода МЕЖДУ &НачалоПериода И &КонецПериода
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	НАЧАЛОПЕРИОДА(НачисленныйУдержанныйНДФЛ.Период, МЕСЯЦ),
	               |	НачисленныйУдержанныйНДФЛ.МесяцНалоговогоПериода,
	               |	НачисленныйУдержанныйНДФЛ.ГоловнаяОрганизация,
	               |	НачисленныйУдержанныйНДФЛ.Организация,
	               |	НачисленныйУдержанныйНДФЛ.ФизическоеЛицо,
	               |	НачисленныйУдержанныйНДФЛ.РегистрацияВНалоговомОргане,
	               |	ФизическиеЛицаСтатусыНДФЛ.Статус,
	               |	НачисленныйУдержанныйНДФЛ.КодДохода,
	               |	НачисленныйУдержанныйНДФЛ.СтавкаНалогообложенияРезидента,
	               |	ВЫБОР
	               |		КОГДА НачисленныйУдержанныйНДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	               |			ТОГДА 2
	               |		КОГДА НачисленныйУдержанныйНДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
	               |			ТОГДА 3
	               |		КОГДА НачисленныйУдержанныйНДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ЗачетАвансовыхПлатежей)
	               |			ТОГДА 6
	               |		КОГДА НачисленныйУдержанныйНДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ВозвращеноНалоговымАгентом)
	               |			ТОГДА 7
	               |		КОГДА НачисленныйУдержанныйНДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ПереданоНаВзысканиеВНалоговыйОрган)
	               |			ТОГДА 8
	               |		ИНАЧЕ 3
	               |	КОНЕЦ,
	               |	НачисленныйУдержанныйНДФЛ.Регистратор.ПланируемаяДатаВыплаты,
	               |	НачисленныйУдержанныйНДФЛ.Регистратор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	2 КАК ВидЗаписи,
	               |	НАЧАЛОПЕРИОДА(СведенияОДоходах.Период, МЕСЯЦ) КАК Период,
	               |	НАЧАЛОПЕРИОДА(СведенияОДоходах.МесяцНалоговогоПериода, МЕСЯЦ) КАК МесяцНалоговогоПериода,
	               |	СведенияОДоходах.ГоловнаяОрганизация,
	               |	СведенияОДоходах.Организация,
	               |	СведенияОДоходах.ФизическоеЛицо,
	               |	СведенияОДоходах.РегистрацияВНалоговомОргане,
	               |	ВЫБОР
	               |		КОГДА СведенияОДоходах.КодДохода.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка13)
	               |			ТОГДА ВЫБОР
	               |					КОГДА ЕСТЬNULL(ФизическиеЛицаСтатусыНДФЛ.Статус, ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент)) = ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Нерезидент)
	               |						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	               |					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	               |				КОНЕЦ
	               |		КОГДА СведенияОДоходах.КодДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код1010)
	               |			ТОГДА ВЫБОР
	               |					КОГДА ЕСТЬNULL(ФизическиеЛицаСтатусыНДФЛ.Статус, ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент)) <> ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент)
	               |						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
	               |					КОГДА СведенияОДоходах.МесяцНалоговогоПериода >= ДАТАВРЕМЯ(2015, 1, 1)
	               |						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	               |					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка09)
	               |				КОНЕЦ
	               |		КОГДА ЕСТЬNULL(ФизическиеЛицаСтатусыНДФЛ.Статус, ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент)) = ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент)
	               |			ТОГДА ВЫБОР
	               |					КОГДА СведенияОДоходах.КодДохода.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка09)
	               |						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка09)
	               |					КОГДА СведенияОДоходах.КодДохода.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка35)
	               |						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка35)
	               |					ИНАЧЕ """"""""
	               |				КОНЕЦ
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	               |	КОНЕЦ КАК Ставка,
	               |	0 КАК СуммаНалога,
	               |	СУММА(СведенияОДоходах.СуммаДохода) КАК Доход,
	               |	СУММА(СведенияОДоходах.СуммаВычета) КАК Вычет,
	               |	СУММА(ВЫБОР
	               |			КОГДА СведенияОДоходах.КодДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код2760)
	               |					ИЛИ СведенияОДоходах.КодДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код2761)
	               |					ИЛИ СведенияОДоходах.КодДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код2762)
	               |				ТОГДА СведенияОДоходах.СуммаДохода
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК ДоходМатпомощь,
	               |	СУММА(ВЫБОР
	               |			КОГДА СведенияОДоходах.КодДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код2760)
	               |					ИЛИ СведенияОДоходах.КодДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код2761)
	               |					ИЛИ СведенияОДоходах.КодДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код2762)
	               |				ТОГДА СведенияОДоходах.СуммаВычета
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК ВычетМатпомощь,
	               |	0 КАК СтандартныйВычет,
	               |	0 КАК ИмущественныйВычет,
	               |	СведенияОДоходах.Регистратор КАК Документ,
	               |	NULL КАК ДатаВыплаты
	               |ПОМЕСТИТЬ ВТПолныеСведенияНДФЛ
	               |ИЗ
	               |	РегистрНакопления.СведенияОДоходахНДФЛ КАК СведенияОДоходах
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТФизическиеЛицаСтатусыНДФЛ КАК ФизическиеЛицаСтатусыНДФЛ
	               |		ПО СведенияОДоходах.ФизическоеЛицо = ФизическиеЛицаСтатусыНДФЛ.ФизическоеЛицо
	               |			И СведенияОДоходах.МесяцНалоговогоПериода = ФизическиеЛицаСтатусыНДФЛ.Период
	               |ГДЕ
	               |	СведенияОДоходах.Период МЕЖДУ &НачалоПериода И &КонецПериода
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	НАЧАЛОПЕРИОДА(СведенияОДоходах.Период, МЕСЯЦ),
	               |	НАЧАЛОПЕРИОДА(СведенияОДоходах.МесяцНалоговогоПериода, МЕСЯЦ),
	               |	СведенияОДоходах.ГоловнаяОрганизация,
	               |	СведенияОДоходах.Организация,
	               |	СведенияОДоходах.ФизическоеЛицо,
	               |	СведенияОДоходах.РегистрацияВНалоговомОргане,
	               |	СведенияОДоходах.КодДохода,
	               |	ФизическиеЛицаСтатусыНДФЛ.Статус,
	               |	ВЫБОР
	               |		КОГДА СведенияОДоходах.КодДохода.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка13)
	               |			ТОГДА ВЫБОР
	               |					КОГДА ЕСТЬNULL(ФизическиеЛицаСтатусыНДФЛ.Статус, ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент)) = ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Нерезидент)
	               |						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	               |					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	               |				КОНЕЦ
	               |		КОГДА СведенияОДоходах.КодДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код1010)
	               |			ТОГДА ВЫБОР
	               |					КОГДА ЕСТЬNULL(ФизическиеЛицаСтатусыНДФЛ.Статус, ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент)) <> ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент)
	               |						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
	               |					КОГДА СведенияОДоходах.МесяцНалоговогоПериода >= ДАТАВРЕМЯ(2015, 1, 1)
	               |						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	               |					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка09)
	               |				КОНЕЦ
	               |		КОГДА ЕСТЬNULL(ФизическиеЛицаСтатусыНДФЛ.Статус, ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент)) = ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент)
	               |			ТОГДА ВЫБОР
	               |					КОГДА СведенияОДоходах.КодДохода.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка09)
	               |						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка09)
	               |					КОГДА СведенияОДоходах.КодДохода.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка35)
	               |						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка35)
	               |					ИНАЧЕ """"""""
	               |				КОНЕЦ
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	               |	КОНЕЦ,
	               |	СведенияОДоходах.Регистратор
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	2,
	               |	НАЧАЛОПЕРИОДА(СтандартныеВычеты.Период, МЕСЯЦ),
	               |	НАЧАЛОПЕРИОДА(СтандартныеВычеты.МесяцНалоговогоПериода, МЕСЯЦ),
	               |	СтандартныеВычеты.ГоловнаяОрганизация,
	               |	СтандартныеВычеты.Организация,
	               |	СтандартныеВычеты.ФизическоеЛицо,
	               |	СтандартныеВычеты.РегистрацияВНалоговомОргане,
	               |	ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13),
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	СУММА(СтандартныеВычеты.Сумма),
	               |	0,
	               |	СтандартныеВычеты.Регистратор,
	               |	NULL
	               |ИЗ
	               |	РегистрНакопления.ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ КАК СтандартныеВычеты
	               |ГДЕ
	               |	СтандартныеВычеты.МесяцНалоговогоПериода МЕЖДУ &НачалоПериода И &КонецПериода
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	НАЧАЛОПЕРИОДА(СтандартныеВычеты.Период, МЕСЯЦ),
	               |	НАЧАЛОПЕРИОДА(СтандартныеВычеты.МесяцНалоговогоПериода, МЕСЯЦ),
	               |	СтандартныеВычеты.ГоловнаяОрганизация,
	               |	СтандартныеВычеты.Организация,
	               |	СтандартныеВычеты.ФизическоеЛицо,
	               |	СтандартныеВычеты.РегистрацияВНалоговомОргане,
	               |	СтандартныеВычеты.Регистратор
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	2,
	               |	НАЧАЛОПЕРИОДА(ИмущественныеВычеты.Период, МЕСЯЦ),
	               |	НАЧАЛОПЕРИОДА(ИмущественныеВычеты.Период, МЕСЯЦ),
	               |	ИмущественныеВычеты.ГоловнаяОрганизация,
	               |	ИмущественныеВычеты.Организация,
	               |	ИмущественныеВычеты.ФизическоеЛицо,
	               |	ИмущественныеВычеты.РегистрацияВНалоговомОргане,
	               |	ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13),
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	СУММА(ИмущественныеВычеты.Сумма),
	               |	ИмущественныеВычеты.Регистратор,
	               |	NULL
	               |ИЗ
	               |	РегистрНакопления.ИмущественныеВычетыНДФЛ КАК ИмущественныеВычеты
	               |ГДЕ
	               |	ИмущественныеВычеты.Период МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ИмущественныеВычеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	НАЧАЛОПЕРИОДА(ИмущественныеВычеты.Период, МЕСЯЦ),
	               |	ИмущественныеВычеты.ГоловнаяОрганизация,
	               |	ИмущественныеВычеты.Организация,
	               |	ИмущественныеВычеты.ФизическоеЛицо,
	               |	ИмущественныеВычеты.РегистрацияВНалоговомОргане,
	               |	ИмущественныеВычеты.Регистратор,
	               |	НАЧАЛОПЕРИОДА(ИмущественныеВычеты.Период, МЕСЯЦ)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	НачисленныйУдержанныйНДФЛ.ВидЗаписи,
	               |	НачисленныйУдержанныйНДФЛ.Период,
	               |	НАЧАЛОПЕРИОДА(НачисленныйУдержанныйНДФЛ.МесяцНалоговогоПериода, МЕСЯЦ),
	               |	НачисленныйУдержанныйНДФЛ.ГоловнаяОрганизация,
	               |	НачисленныйУдержанныйНДФЛ.Организация,
	               |	НачисленныйУдержанныйНДФЛ.ФизическоеЛицо,
	               |	НачисленныйУдержанныйНДФЛ.РегистрацияВНалоговомОргане,
	               |	НачисленныйУдержанныйНДФЛ.Ставка,
	               |	СУММА(НачисленныйУдержанныйНДФЛ.СуммаНалога),
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	НачисленныйУдержанныйНДФЛ.Документ,
	               |	НачисленныйУдержанныйНДФЛ.ДатаВыплаты
	               |ИЗ
	               |	ВТНачисленныйУдержанныйНДФЛ КАК НачисленныйУдержанныйНДФЛ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТФизическиеЛицаСтатусыНДФЛ КАК ФизическиеЛицаСтатусыНДФЛ
	               |		ПО НачисленныйУдержанныйНДФЛ.ФизическоеЛицо = ФизическиеЛицаСтатусыНДФЛ.ФизическоеЛицо
	               |			И (НАЧАЛОПЕРИОДА(НачисленныйУдержанныйНДФЛ.МесяцНалоговогоПериода, МЕСЯЦ) = ФизическиеЛицаСтатусыНДФЛ.Период)
	               |ГДЕ
	               |	НачисленныйУдержанныйНДФЛ.МесяцНалоговогоПериода МЕЖДУ &НачалоПериода И &КонецПериода
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	НачисленныйУдержанныйНДФЛ.Период,
	               |	НАЧАЛОПЕРИОДА(НачисленныйУдержанныйНДФЛ.МесяцНалоговогоПериода, МЕСЯЦ),
	               |	НачисленныйУдержанныйНДФЛ.ГоловнаяОрганизация,
	               |	НачисленныйУдержанныйНДФЛ.Организация,
	               |	НачисленныйУдержанныйНДФЛ.ФизическоеЛицо,
	               |	НачисленныйУдержанныйНДФЛ.РегистрацияВНалоговомОргане,
	               |	ФизическиеЛицаСтатусыНДФЛ.Статус,
	               |	НачисленныйУдержанныйНДФЛ.Ставка,
	               |	НачисленныйУдержанныйНДФЛ.ВидЗаписи,
	               |	НачисленныйУдержанныйНДФЛ.Документ,
	               |	НачисленныйУдержанныйНДФЛ.ДатаВыплаты
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	4,
	               |	НАЧАЛОПЕРИОДА(УплаченныйНДФЛ.Период, МЕСЯЦ),
	               |	НАЧАЛОПЕРИОДА(УплаченныйНДФЛ.МесяцНалоговогоПериода, МЕСЯЦ),
	               |	УплаченныйНДФЛ.Организация.ГоловнаяОрганизация,
	               |	УплаченныйНДФЛ.Организация,
	               |	УплаченныйНДФЛ.ФизическоеЛицо,
	               |	УплаченныйНДФЛ.РегистрацияВНалоговомОргане,
	               |	УплаченныйНДФЛ.Ставка,
	               |	СУММА(ЕСТЬNULL(ВЫБОР
	               |				КОГДА УплаченныйНДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	               |					ТОГДА УплаченныйНДФЛ.Сумма
	               |				ИНАЧЕ 0
	               |			КОНЕЦ, 0)),
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	NULL,
	               |	NULL
	               |ИЗ
	               |	РегистрНакопления.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ КАК УплаченныйНДФЛ
	               |ГДЕ
	               |	УплаченныйНДФЛ.МесяцНалоговогоПериода МЕЖДУ &НачалоПериода И &КонецПериода
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	НАЧАЛОПЕРИОДА(УплаченныйНДФЛ.Период, МЕСЯЦ),
	               |	НАЧАЛОПЕРИОДА(УплаченныйНДФЛ.МесяцНалоговогоПериода, МЕСЯЦ),
	               |	УплаченныйНДФЛ.Организация.ГоловнаяОрганизация,
	               |	УплаченныйНДФЛ.Организация,
	               |	УплаченныйНДФЛ.ФизическоеЛицо,
	               |	УплаченныйНДФЛ.РегистрацияВНалоговомОргане,
	               |	УплаченныйНДФЛ.Ставка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	1,
	               |	НАЧАЛОПЕРИОДА(УплаченныйНДФЛ.Период, МЕСЯЦ),
	               |	NULL,
	               |	УплаченныйНДФЛ.Организация.ГоловнаяОрганизация,
	               |	УплаченныйНДФЛ.Организация,
	               |	УплаченныйНДФЛ.ФизическоеЛицо,
	               |	УплаченныйНДФЛ.РегистрацияВНалоговомОргане,
	               |	NULL,
	               |	СУММА(ЕСТЬNULL(УплаченныйНДФЛ.СуммаНачальныйОстаток, 0)),
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	NULL,
	               |	NULL
	               |ИЗ
	               |	РегистрНакопления.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, МЕСЯЦ, , ) КАК УплаченныйНДФЛ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	НАЧАЛОПЕРИОДА(УплаченныйНДФЛ.Период, МЕСЯЦ),
	               |	УплаченныйНДФЛ.Организация.ГоловнаяОрганизация,
	               |	УплаченныйНДФЛ.Организация,
	               |	УплаченныйНДФЛ.ФизическоеЛицо,
	               |	УплаченныйНДФЛ.РегистрацияВНалоговомОргане
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	5,
	               |	НАЧАЛОПЕРИОДА(УплаченныйНДФЛ.Период, МЕСЯЦ),
	               |	NULL,
	               |	УплаченныйНДФЛ.Организация.ГоловнаяОрганизация,
	               |	УплаченныйНДФЛ.Организация,
	               |	УплаченныйНДФЛ.ФизическоеЛицо,
	               |	УплаченныйНДФЛ.РегистрацияВНалоговомОргане,
	               |	NULL,
	               |	СУММА(ЕСТЬNULL(УплаченныйНДФЛ.СуммаКонечныйОстаток, 0)),
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	NULL,
	               |	NULL
	               |ИЗ
	               |	РегистрНакопления.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, МЕСЯЦ, , ) КАК УплаченныйНДФЛ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	НАЧАЛОПЕРИОДА(УплаченныйНДФЛ.Период, МЕСЯЦ),
	               |	УплаченныйНДФЛ.Организация.ГоловнаяОрганизация,
	               |	УплаченныйНДФЛ.Организация,
	               |	УплаченныйНДФЛ.ФизическоеЛицо,
	               |	УплаченныйНДФЛ.РегистрацияВНалоговомОргане
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПолныеСведенияНДФЛ.ВидЗаписи КАК ВидЗаписи,
	               |	ПолныеСведенияНДФЛ.Период КАК Период,
	               |	ПолныеСведенияНДФЛ.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	               |	ПолныеСведенияНДФЛ.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	               |	ПолныеСведенияНДФЛ.Организация КАК Организация,
	               |	ПолныеСведенияНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
	               |	ПолныеСведенияНДФЛ.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	               |	ПолныеСведенияНДФЛ.Ставка КАК Ставка,
	               |	СУММА(ПолныеСведенияНДФЛ.Доход) КАК Доход,
	               |	СУММА(ПолныеСведенияНДФЛ.Вычет) КАК Вычет,
	               |	СУММА(ПолныеСведенияНДФЛ.ДоходМатпомощь) КАК ДоходМатпомощь,
	               |	СУММА(ПолныеСведенияНДФЛ.ВычетМатпомощь) КАК ВычетМатпомощь,
	               |	СУММА(ПолныеСведенияНДФЛ.ИмущественныйВычет) КАК ИмущественныйВычет,
	               |	СУММА(ПолныеСведенияНДФЛ.СтандартныйВычет) КАК СтандартныйВычет,
	               |	СУММА(ПолныеСведенияНДФЛ.СуммаНалога) КАК СуммаНалога,
	               |	ПолныеСведенияНДФЛ.Документ КАК Документ,
	               |	ПолныеСведенияНДФЛ.ДатаВыплаты КАК ДатаВыплаты,
	               |	ВедомостьНаВыплатуЗарплатыВБанкНДФЛ.ДокументОснование,
	               |	ВедомостьНаВыплатуЗарплатыВБанкНДФЛ.Ссылка.Дата КАК ВедомостьДатаВыплаты
	               |{ВЫБРАТЬ
	               |	ВидЗаписи,
	               |	Период,
	               |	МесяцНалоговогоПериода,
	               |	ГоловнаяОрганизация.*,
	               |	Организация.*,
	               |	ФизическоеЛицо.*,
	               |	РегистрацияВНалоговомОргане.*,
	               |	Ставка,
	               |	Доход,
	               |	Вычет,
	               |	ДоходМатпомощь,
	               |	ВычетМатпомощь,
	               |	ИмущественныйВычет,
	               |	СтандартныйВычет,
	               |	СуммаНалога,
	               |	Документ,
	               |	ДатаВыплаты}
	               |ИЗ
	               |	ВТПолныеСведенияНДФЛ КАК ПолныеСведенияНДФЛ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВедомостьНаВыплатуЗарплатыВБанк.НДФЛ КАК ВедомостьНаВыплатуЗарплатыВБанкНДФЛ
	               |		ПО ПолныеСведенияНДФЛ.Документ = ВедомостьНаВыплатуЗарплатыВБанкНДФЛ.Ссылка
	               |			И ПолныеСведенияНДФЛ.ФизическоеЛицо = ВедомостьНаВыплатуЗарплатыВБанкНДФЛ.ФизическоеЛицо
	               |			И ПолныеСведенияНДФЛ.СуммаНалога = ВедомостьНаВыплатуЗарплатыВБанкНДФЛ.Сумма
	               |ГДЕ
	               |	ПолныеСведенияНДФЛ.ВидЗаписи <> 1
	               |	И ПолныеСведенияНДФЛ.ВидЗаписи <> 5
	               |{ГДЕ
	               |	ПолныеСведенияНДФЛ.ВидЗаписи,
	               |	ПолныеСведенияНДФЛ.Период,
	               |	ПолныеСведенияНДФЛ.МесяцНалоговогоПериода,
	               |	ПолныеСведенияНДФЛ.ГоловнаяОрганизация.*,
	               |	ПолныеСведенияНДФЛ.Организация.*,
	               |	ПолныеСведенияНДФЛ.ФизическоеЛицо.*,
	               |	ПолныеСведенияНДФЛ.РегистрацияВНалоговомОргане.*,
	               |	ПолныеСведенияНДФЛ.Ставка,
	               |	ПолныеСведенияНДФЛ.Доход,
	               |	ПолныеСведенияНДФЛ.Вычет,
	               |	ПолныеСведенияНДФЛ.ДоходМатпомощь,
	               |	ПолныеСведенияНДФЛ.ВычетМатпомощь,
	               |	ПолныеСведенияНДФЛ.ИмущественныйВычет,
	               |	ПолныеСведенияНДФЛ.СтандартныйВычет,
	               |	ПолныеСведенияНДФЛ.СуммаНалога,
	               |	ПолныеСведенияНДФЛ.Документ,
	               |	ПолныеСведенияНДФЛ.ДатаВыплаты}
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПолныеСведенияНДФЛ.ВидЗаписи,
	               |	ПолныеСведенияНДФЛ.Период,
	               |	ПолныеСведенияНДФЛ.МесяцНалоговогоПериода,
	               |	ПолныеСведенияНДФЛ.ГоловнаяОрганизация,
	               |	ПолныеСведенияНДФЛ.Организация,
	               |	ПолныеСведенияНДФЛ.ФизическоеЛицо,
	               |	ПолныеСведенияНДФЛ.РегистрацияВНалоговомОргане,
	               |	ПолныеСведенияНДФЛ.Ставка,
	               |	ПолныеСведенияНДФЛ.Документ,
	               |	ПолныеСведенияНДФЛ.ДатаВыплаты,
	               |	ВедомостьНаВыплатуЗарплатыВБанкНДФЛ.ДокументОснование,
	               |	ВедомостьНаВыплатуЗарплатыВБанкНДФЛ.Ссылка.Дата
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ВТФизическиеЛицаПериоды
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ВТФизическиеЛицаСтатусыНДФЛ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ВТНачисленныйУдержанныйНДФЛ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ВТПолныеСведенияНДФЛ";
	
	Запрос.УстановитьПараметр("НачалоПериода",НачалоМесяца(НачалоМесяца(НачалоПериода)-1));// для зарплаты берем предыдущий месяц от даты
	Запрос.УстановитьПараметр("КонецПериода",КонецМесяца(КонецПериода));
	Запрос.УстановитьПараметр("ДатаЗакона285ФЗ",УчетНДФЛ.ДатаЗакона285ФЗ());
	Выгрузка = Запрос.Выполнить().Выгрузить();	
	
	ИтоговаяТаблица = Новый ТаблицаЗначений;
	ИтоговаяТаблица.Колонки.Добавить("ДатаВыплаты", 			Новый ОписаниеТипов("Дата"));
	ИтоговаяТаблица.Колонки.Добавить("ДатаПеречисленияНДФЛ", 	Новый ОписаниеТипов("Дата"));
	ИтоговаяТаблица.Колонки.Добавить("НБ", 						Новый ОписаниеТипов("Число"));
	ИтоговаяТаблица.Колонки.Добавить("Вычет",					Новый ОписаниеТипов("Число"));
	ИтоговаяТаблица.Колонки.Добавить("НДФЛИсчисленный",			Новый ОписаниеТипов("Число"));
	ИтоговаяТаблица.Колонки.Добавить("НДФЛУдержанный",			Новый ОписаниеТипов("Число"));
	ИтоговаяТаблица.Колонки.Добавить("СуммаНДФЛНеудержанного",	Новый ОписаниеТипов("Число"));
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.РегистрацииВНалоговомОргане"));
	ИтоговаяТаблица.Колонки.Добавить("РегистрацияВНалоговомОргане", Новый ОписаниеТипов(МассивТипов));
	ИтоговаяТаблица.Колонки.Добавить("ОКТМО");
	ИтоговаяТаблица.Колонки.Добавить("КПП");
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.ФизическиеЛица"));
	ИтоговаяТаблица.Колонки.Добавить("ФИО", 					Новый ОписаниеТипов(МассивТипов));
	ИтоговаяТаблица.Колонки.Добавить("Документ", 				Документы.ТипВсеСсылки());
	
	ТаблицаПроизводственногоКалендаря = ПолучитьПроизводственныйКалендарь();
	МассивФизЛиц = ОбщегоНазначенияКлиентСервер.СвернутьМассив(Выгрузка.ВыгрузитьКолонку("ФизическоеЛицо"));
	Для Каждого ФизЛицо из МассивФизЛиц Цикл 
		
		ПромежуточныйРезультат = ИтоговаяТаблица.Скопировать();
		ПромежуточныйРезультат.Очистить();
		
		ТаблицаОтбор = Выгрузка.Скопировать(Новый Структура("ФизическоеЛицо",ФизЛицо));		
		ТаблицаОтбор.Свернуть("ВедомостьДатаВыплаты, ВидЗаписи, ГоловнаяОрганизация, ДатаВыплаты, Документ, ДокументОснование, 
		//|МесяцНалоговогоПериода, Организация, Период, РегистрацияВНалоговомОргане, Ставка, ФизическоеЛицо",
		|Организация, Период, РегистрацияВНалоговомОргане, Ставка, ФизическоеЛицо",
		"Вычет, ВычетМатпомощь, Доход, ДоходМатПомощь, ИмущественныйВычет, СтандартныйВычет, СуммаНалога");
		
		//ТаблицаДохода = ТаблицаОтбор.Скопировать(Новый Структура("СуммаНалога",0));
		ТаблицаДохода = ТаблицаОтбор.Скопировать();
		ТаблицаДохода.Очистить();
		Для Каждого СтрокаДохода Из ТаблицаОтбор Цикл 
			Если СтрокаДохода.Доход<>0 Тогда 
				НоваяСтрока = ТаблицаДохода.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДохода);
			КонецЕсли;
		КонецЦикла;
		
		// Добавим документы, по которым нет дохода, но есть налог
		Для Каждого СтрокаДанных Из ТаблицаОтбор Цикл 
			Если СтрокаДанных.СуммаНалога <> 0 И СтрокаДанных.ВидЗаписи = 2 Тогда 
				Документ = СтрокаДанных.Документ;
				НайденныеСтроки = ТаблицаДохода.НайтиСтроки(Новый Структура("Документ",Документ));
				Если НайденныеСтроки.Количество()=0 Тогда 
					НоваяСтрока = ТаблицаДохода.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанных);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого СтрокаДохода Из ТаблицаДохода Цикл 
			НоваяСтрока = ПромежуточныйРезультат.Добавить();
			НоваяСтрока.Документ = СтрокаДохода.Документ;
			НоваяСтрока.НБ = СтрокаДохода.Доход;
			НоваяСтрока.ФИО = СтрокаДохода.ФизическоеЛицо;
			НоваяСтрока.Вычет = СтрокаДохода.ИмущественныйВычет + СтрокаДохода.СтандартныйВычет+СтрокаДохода.ВычетМатпомощь;
			НоваяСтрока.РегистрацияВНалоговомОргане = СтрокаДохода.РегистрацияВНалоговомОргане;
		КонецЦикла;		
		
		Для Каждого СтрокаДанных Из ПромежуточныйРезультат Цикл 
			Для Каждого СтрокаОтбора Из ТаблицаОтбор Цикл 
				Если СтрокаОтбора.Документ = СтрокаДанных.Документ И СтрокаОтбора.ВидЗаписи = 2 И СтрокаОтбора.СуммаНалога <> 0 Тогда 
					СтрокаДанных.НДФЛИсчисленный = СтрокаОтбора.СуммаНалога;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			//НайденныеСтроки = ТаблицаОтбор.НайтиСтроки(Новый Структура("Документ, ВидЗаписи, Доход", СтрокаДанных.Документ, 2,0));
			//Если НайденныеСтроки.Количество()>0 Тогда 
			//	СтрокаДанных.НДФЛИсчисленный = НайденныеСтроки[0].СуммаНалога;
			//КонецЕсли;
		КонецЦикла;
		
		Для Каждого СтрокаДанных Из ПромежуточныйРезультат Цикл 
			НайденныеСтроки = ТаблицаОтбор.НайтиСтроки(Новый Структура("ДокументОснование, ВидЗаписи", СтрокаДанных.Документ, 3));
			Если НайденныеСтроки.Количество()>0 Тогда 
				СтрокаДанных.НДФЛУдержанный = НайденныеСтроки[0].СуммаНалога;
				СтрокаДанных.ДатаВыплаты = НайденныеСтроки[0].ВедомостьДатаВыплаты;  
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого СтрокаДанных Из ПромежуточныйРезультат Цикл 
			СтрокаДанных.СуммаНДФЛНеудержанного = СтрокаДанных.НДФЛИсчисленный - СтрокаДанных.НДФЛУдержанный;
		КонецЦикла;
		
		// Дозаполним дату, если она не заполнена		
		Для Каждого СтрокаДанных  Из ПромежуточныйРезультат Цикл 
			Если Не ЗначениеЗаполнено(СтрокаДанных.ДатаВыплаты) И (ТипЗнч(СтрокаДанных.Документ) = Тип("ДокументСсылка.Премия") 
				ИЛИ ТипЗнч(СтрокаДанных.Документ) = Тип("ДокументСсылка.БольничныйЛист") 
				ИЛИ ТипЗнч(СтрокаДанных.Документ) = Тип("ДокументСсылка.Увольнение")
				ИЛИ ТипЗнч(СтрокаДанных.Документ) = Тип("ДокументСсылка.РазовоеНачисление")
				ИЛИ ТипЗнч(СтрокаДанных.Документ) = Тип("ДокументСсылка.ОплатаПоСреднемуЗаработку")
				ИЛИ ТипЗнч(СтрокаДанных.Документ) = Тип("ДокументСсылка.МатериальнаяПомощь")
				ИЛИ ТипЗнч(СтрокаДанных.Документ) = Тип("ДокументСсылка.Отпуск")) Тогда 
				СтрокаДанных.ДатаВыплаты = СтрокаДанных.Документ.ПланируемаяДатаВыплаты;
			ИначеЕсли Не ЗначениеЗаполнено(СтрокаДанных.ДатаВыплаты) И ТипЗнч(СтрокаДанных.Документ) = Тип("ДокументСсылка.ДоходВНатуральнойФорме") Тогда 
				СтрокаДанных.ДатаВыплаты = СтрокаДанных.Документ.ДатаПолученияДохода;
			ИначеЕсли Не ЗначениеЗаполнено(СтрокаДанных.ДатаВыплаты) И ТипЗнч(СтрокаДанных.Документ) = Тип("ДокументСсылка.НачислениеЗарплаты") Тогда 
				СтрокаДанных.ДатаВыплаты = ОпределитьДатуВыплатыНачисленияЗарплаты(СтрокаДанных.Документ.МесяцНачисления, ТаблицаПроизводственногоКалендаря, СтрокаДанных.Документ);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого СтрокаДанных Из ПромежуточныйРезультат Цикл 
			Если СтрокаДанных.ДатаВыплаты >= НачалоМесяца(НачалоПериода) Тогда 
				НоваяСтрокаИтог = ИтоговаяТаблица.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаИтог, СтрокаДанных);
				Если ЗначениеЗаполнено(СтрокаДанных.РегистрацияВНалоговомОргане) Тогда 
					НоваяСтрокаИтог.ОКТМО	= СтрокаДанных.РегистрацияВНалоговомОргане.КодПоОКТМО;
					НоваяСтрокаИтог.КПП		= СтрокаДанных.РегистрацияВНалоговомОргане.КПП;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;	
	КонецЦикла;
	
	Возврат ИтоговаяТаблица;

КонецФункции

Функция ПолучитьПроизводственныйКалендарь()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДанныеПроизводственногоКалендаря.Дата,
	               |	ДанныеПроизводственногоКалендаря.ВидДня
	               |ИЗ
	               |	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря";
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ОпределитьДатуВыплатыНачисленияЗарплаты(Месяц, ТаблицаПроизводственногоКалендаря, Документ)
	ДатаВедомости = НайтиДатуЗарплатыВВедомости(Документ);	
	Если ЗначениеЗаполнено(ДатаВедомости) Тогда 
		Возврат ДатаВедомости;
	КонецЕсли;
	
	ПланируемаяДатаВыплаты = Дата(Год(Месяц),Месяц(Месяц)+1, 5);
	Если Не РабочийДень(ПланируемаяДатаВыплаты, ТаблицаПроизводственногоКалендаря) Тогда 
		Возврат	НайтиРабочийДень(ПланируемаяДатаВыплаты, ТаблицаПроизводственногоКалендаря);
	Иначе 		
		Возврат ПланируемаяДатаВыплаты;
	КонецЕсли;
КонецФункции

Функция НайтиДатуЗарплатыВВедомости(Документ)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВедомостьНаВыплатуЗарплатыВБанкНДФЛ.Ссылка.Дата КАК Дата
	|ИЗ
	|	Документ.ВедомостьНаВыплатуЗарплатыВБанк.НДФЛ КАК ВедомостьНаВыплатуЗарплатыВБанкНДФЛ
	|ГДЕ
	|	ВедомостьНаВыплатуЗарплатыВБанкНДФЛ.ДокументОснование = &ДокументОснование";
	Запрос.УстановитьПараметр("ДокументОснование",Документ);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Дата;	
КонецФункции

Функция НайтиРабочийДень(Дата, ТаблицаПроизводственногоКалендаря)
	ПроверяемаяДата = НачалоДня(НачалоДня(Дата)-1);
	Если Не РабочийДень(ПроверяемаяДата, ТаблицаПроизводственногоКалендаря) Тогда 
		НайтиРабочийДень(ПроверяемаяДата, ТаблицаПроизводственногоКалендаря);
	КонецЕсли;
	
	Возврат ПроверяемаяДата;
КонецФункции

Функция РабочийДень(Дата, ТаблицаПроизводственногоКалендаря)
	
	НайденныеСтроки = ТаблицаПроизводственногоКалендаря.НайтиСтроки(Новый Структура("Дата",Дата));
	Если НайденныеСтроки.Количество()>0 Тогда 
		Если НайденныеСтроки[0].ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий ИЛИ 
			НайденныеСтроки[0].ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Предпраздничный Тогда 
			Возврат Истина;
		Иначе 
			Возврат Ложь;
		КонецЕсли;
	Иначе 
		Возврат Ложь;
	КонецЕсли;
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ВЫБОР
	//               |		КОГДА ДанныеПроизводственногоКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий)
	//               |				ИЛИ ДанныеПроизводственногоКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.ПРЕДПРАЗДНИЧНЫЙ)
	//               |			ТОГДА ИСТИНА
	//               |		ИНАЧЕ ЛОЖЬ
	//               |	КОНЕЦ КАК Рабочий
	//               |ИЗ
	//               |	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
	//               |ГДЕ
	//               |	ДанныеПроизводственногоКалендаря.Дата = &Дата";
	//Запрос.УстановитьПараметр("Дата",Дата);				   
	//Выборка = Запрос.Выполнить().Выбрать();
	//Если Выборка.Следующий() Тогда 
	//	Возврат Выборка.Рабочий;
	//Иначе 
	//	Возврат Ложь;
	//КонецЕсли;
КонецФункции
#КонецОбласти