////////////////////////////////////////////////////////////////
// КОМАНДЫ ФОРМЫ
////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	Объект.СоответствиеДокументовРеквизитам.Очистить();
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	Для Каждого СтрокаТЧ Из Объект.СоответствиеДокументовРеквизитам Цикл 
		СтрокаТЧ.Записывать = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	Для Каждого СтрокаТЧ Из Объект.СоответствиеДокументовРеквизитам Цикл 
		СтрокаТЧ.Записывать = Ложь;
	КонецЦикла;                   
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ППФПеречисленияНДФЛвБюджет = Истина;
КонецПроцедуры

////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
////////////////////////////////////////////////////////////////

&НаСервере
Процедура ЗаполнитьНаСервере()
		
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	|	#Документ.Ссылка,
	|	#Документ.Сумма,
	|	#Документ.РегистрацияВНалоговомОргане.КПП КАК КПП
	|ИЗ
	|	Документ.#Документ КАК #Документ
	|ГДЕ
	|	#Документ.ПометкаУдаления = ЛОЖЬ";
	
	Если ЗначениеЗаполнено(Период.ДатаНачала) И ЗначениеЗаполнено(Период.ДатаОкончания) Тогда 
		Запрос.Текст = Запрос.Текст + 	"	И #Документ.МесяцНалоговогоПериода МЕЖДУ &НачалоПериода И &КонецПериода";
		Запрос.УстановитьПараметр("НачалоПериода",НачалоМесяца(Период.ДатаНачала));
		Запрос.УстановитьПараметр("КонецПериода",КонецМесяца(Период.ДатаОкончания));
	КонецЕсли;
	
	Если ППФПеречисленияНДФЛвБюджет Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Документ", "ППФ_ПеречислениеНДФЛВБюджет");
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Документ", "ПеречислениеНДФЛВБюджет");
	КонецЕсли;
	
	РезультатДокументы = Запрос.Выполнить();
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("ПеречислениеНДФЛВБюджет");
	ТаблицаДанных.Колонки.Добавить("ДатаПлатежа");
	ТаблицаДанных.Колонки.Добавить("ПлатежноеПоручениеДата");
	ТаблицаДанных.Колонки.Добавить("ПлатежноеПоручениеНомер");
	ТаблицаДанных.Колонки.Добавить("СуммаДокумента");	
	
	Если Не РезультатДокументы.Пустой() Тогда 
		Выгрузка = РезультатДокументы.Выгрузить();
		МассивКПП 	= ОбщегоНазначенияКлиентСервер.СвернутьМассив(Выгрузка.ВыгрузитьКолонку("КПП"));
		МассивСумм	= ОбщегоНазначенияКлиентСервер.СвернутьМассив(Выгрузка.ВыгрузитьКолонку("Сумма"));
		
		БазаДанныхБух = Новый Структура;
		БазаДанныхБух.Вставить("Сервер", "RU00SP1C01");
		БазаДанныхБух.Вставить("ИмяБазаДанных", "RU10");
		БазаДанныхБух.Вставить("Пользователь", "АртамоновР");
		БазаДанныхБух.Вставить("Пароль", "Roman26061991");
		COM_Соединение = УстановитьCOMПодключениеСБазойДанных1С(БазаДанныхБух);
		МассивСуммCOM = COM_Соединение.NewObject("Массив");
		МассивКППCOM = COM_Соединение.NewObject("Массив");
		
		Для Каждого ЭлементМассива Из МассивКПП Цикл 
			МассивКППCOM.Добавить(ЭлементМассива);
		КонецЦикла;
		
		Для Каждого ЭлементМассива Из МассивСумм Цикл 
			МассивСуммCOM.Добавить(ЭлементМассива);
		КонецЦикла;        		
		
		Если COM_Соединение <> Неопределено Тогда					
			ЗапросCOM = COM_Соединение.NewObject("Запрос");
			ЗапросCOM.Текст = "ВЫБРАТЬ
			|	СписаниеСРасчетногоСчета.НомерВходящегоДокумента КАК Номер,
			|	СписаниеСРасчетногоСчета.ДатаВходящегоДокумента КАК Дата,
			|	СписаниеСРасчетногоСчета.СуммаДокумента,
			|	ВЫРАЗИТЬ(СписаниеСРасчетногоСчета.СубконтоДт2 КАК Справочник.РегистрацииВНалоговомОргане).КПП КАК КПП,
			|	СписаниеСРасчетногоСчета.Ссылка
			|ПОМЕСТИТЬ ВТ_ПРЕДВАРИТЕЛЬНАЯ
			|ИЗ
			|	Документ.СписаниеСРасчетногоСчета КАК СписаниеСРасчетногоСчета
			|ГДЕ
			|	СписаниеСРасчетногоСчета.СуммаДокумента В(&МассивСумм)
			|	И СписаниеСРасчетногоСчета.Ссылка.Проведен = ИСТИНА
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	СписаниеСРасчетногоСчета.НомерВходящегоДокумента,
			|	СписаниеСРасчетногоСчета.ДатаВходящегоДокумента,
			|	СписаниеСРасчетногоСчета.СуммаДокумента,
			|	ВЫРАЗИТЬ(СписаниеСРасчетногоСчета.СубконтоДт2 КАК Справочник.РегистрацииВНалоговомОргане).КПП,
			|	СписаниеСРасчетногоСчета.Ссылка
			|ИЗ
			|	Документ.СписаниеСРасчетногоСчета КАК СписаниеСРасчетногоСчета
			|ГДЕ
			|	ВЫРАЗИТЬ(СписаниеСРасчетногоСчета.СубконтоДт2 КАК Справочник.РегистрацииВНалоговомОргане).КПП В (&МассивКПП)
			|	И СписаниеСРасчетногоСчета.Ссылка.Проведен = ИСТИНА
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_ПРЕДВАРИТЕЛЬНАЯ.Номер,
			|	ВТ_ПРЕДВАРИТЕЛЬНАЯ.Дата,
			|	ВТ_ПРЕДВАРИТЕЛЬНАЯ.СуммаДокумента,
			|	ВТ_ПРЕДВАРИТЕЛЬНАЯ.КПП,
			|	ВТ_ПРЕДВАРИТЕЛЬНАЯ.Ссылка
			|ИЗ
			|	ВТ_ПРЕДВАРИТЕЛЬНАЯ КАК ВТ_ПРЕДВАРИТЕЛЬНАЯ
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТ_ПРЕДВАРИТЕЛЬНАЯ.Номер,
			|	ВТ_ПРЕДВАРИТЕЛЬНАЯ.Дата,
			|	ВТ_ПРЕДВАРИТЕЛЬНАЯ.КПП,
			|	ВТ_ПРЕДВАРИТЕЛЬНАЯ.Ссылка,
			|	ВТ_ПРЕДВАРИТЕЛЬНАЯ.СуммаДокумента
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ ВТ_ПРЕДВАРИТЕЛЬНАЯ";
			
			ЗапросCOM.УстановитьПараметр("МассивСумм", 	МассивСуммCOM);
			ЗапросCOM.УстановитьПараметр("МассивКПП", 	МассивКППCOM);
			РезультатCOM = ЗапросCOM.Выполнить();
			ВыборкаCOM = РезультатCOM.Выбрать();
			
			ТаблицаТипизированныхДанных = Новый ТаблицаЗначений;
			ТаблицаТипизированныхДанных.Колонки.Добавить("Номер");
			ТаблицаТипизированныхДанных.Колонки.Добавить("Дата");
			ТаблицаТипизированныхДанных.Колонки.Добавить("СуммаДокумента");
			ТаблицаТипизированныхДанных.Колонки.Добавить("КПП");
			
			Пока ВыборкаCOM.Следующий() Цикл 
				НоваяСтрока = ТаблицаТипизированныхДанных.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаCOM);
			КонецЦикла; 
			
			ВыборкаДокументы = РезультатДокументы.Выбрать();
			Пока ВыборкаДокументы.Следующий() Цикл 
				СтруктураОтбора = Новый Структура("СуммаДокумента, КПП", ВыборкаДокументы.Сумма, ВыборкаДокументы.КПП);
				ТаблицаОтбор = ТаблицаТипизированныхДанных.Скопировать(СтруктураОтбора);
				Если ТаблицаОтбор.Количество()>0 Тогда 
					Для Каждого СтрокаДанных Из ТаблицаОтбор Цикл 
						НоваяСтрокаТЧ = ТаблицаДанных.Добавить();
						НоваяСтрокаТЧ.ПеречислениеНДФЛВБюджет 	= ВыборкаДокументы.Ссылка;
						НоваяСтрокаТЧ.ДатаПлатежа 				= СтрокаДанных.Дата;
						НоваяСтрокаТЧ.ПлатежноеПоручениеДата 	= СтрокаДанных.Дата;
						НоваяСтрокаТЧ.ПлатежноеПоручениеНомер 	= СтрокаДанных.Номер;
						НоваяСтрокаТЧ.СуммаДокумента 			= СтрокаДанных.СуммаДокумента;
					КонецЦикла;
				Иначе 
					НоваяСтрокаТЧ = ТаблицаДанных.Добавить();
					НоваяСтрокаТЧ.ПеречислениеНДФЛВБюджет 	= ВыборкаДокументы.Ссылка;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;

		Объект.СоответствиеДокументовРеквизитам.Загрузить(ТаблицаДанных);

	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция УстановитьCOMПодключениеСБазойДанных1С(БазаДанных)
	COM_Соединение = Неопределено;
	Попытка
		V8 = Новый COMОбъект(Строка("V83") + ".COMConnector");
		СтрокаПодключения = "Srvr=""" 	+ БазаДанных.Сервер 			+ 
		"""; Ref=" 	+ БазаДанных.ИмяБазаДанных 	+
		"; Usr=" 	+ БазаДанных.Пользователь 	+ 
		"; Pwd=" 	+ БазаДанных.Пароль;						
		COM_Соединение = V8.Connect(СтрокаПодключения);
		Возврат COM_Соединение;
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОписаниеОшибки();
		Сообщение.Сообщить();
		Возврат Неопределено;
	КонецПопытки;
КонецФункции // УстановитьCOMПодключениеСБазойДанных1С()

&НаСервере
Процедура ЗаписатьНаСервере()
	Для Каждого СтрокаТЧ Из Объект.СоответствиеДокументовРеквизитам Цикл 
		Если ЗначениеЗаполнено(СтрокаТЧ.ПеречислениеНДФЛВБюджет) Тогда 
			Если СтрокаТЧ.Записывать Тогда 
				Если Не ЗначениеЗаполнено(СтрокаТЧ.ДатаПлатежа) И Не ЗначениеЗаполнено(СтрокаТЧ.ПлатежноеПоручениеДата) И Не ЗначениеЗаполнено(СтрокаТЧ.ПлатежноеПоручениеНомер) Тогда 
					Продолжить;
				КонецЕсли;
				
				ДокСсылка = СтрокаТЧ.ПеречислениеНДФЛВБюджет;
				ДокОбъект = ДокСсылка.ПолучитьОбъект();
				ДокОбъект.ПлатежноеПоручениеНомер = СокрЛП(СтрокаТЧ.ПлатежноеПоручениеНомер);
				ДокОбъект.ПлатежноеПоручениеДата  = СтрокаТЧ.ПлатежноеПоручениеДата;
				ДокОбъект.ДатаПлатежа  			  = СтрокаТЧ.ДатаПлатежа;
				ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

