
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	НастройкиОтчета = Отчет.КомпоновщикНастроек.ПолучитьНастройки();
	
	ОтпускПоБеременности = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ОтпускПоБеременности"));
	Если ОтпускПоБеременности<>Неопределено Тогда 
		ОтпускПоБеременности.Использование = Истина;
		ОтпускПоБеременности.Значение = ПланыВидовРасчета.Начисления.НайтиПоКоду("ОТБРР");		
	КонецЕсли;
	
	ОкладПоДням = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ОкладПоДням"));
	Если ОкладПоДням<>Неопределено Тогда 
		ОкладПоДням.Использование = Истина;
		ОкладПоДням.Значение = ПланыВидовРасчета.Начисления.НайтиПоКоду("ОКЛ");		
	КонецЕсли;	
	
	ВидРасчетаОплатаБольничныхЛистов2 = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("БольничныйРаботодатель"));
	Если ВидРасчетаОплатаБольничныхЛистов2<>Неопределено Тогда 
		ВидРасчетаОплатаБольничныхЛистов2.Использование = Истина;
		ВидРасчетаОплатаБольничныхЛистов2.Значение = ПланыВидовРасчета.Начисления.НайтиПоКоду("БЛРДТ");			
	КонецЕсли;	
	
	ОплатаПоСреднемуБЛ = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("БольничныйФСС"));
	Если ОплатаПоСреднемуБЛ<>Неопределено Тогда 
		ОплатаПоСреднемуБЛ.Использование = Истина;
		ОплатаПоСреднемуБЛ.Значение = ПланыВидовРасчета.Начисления.НайтиПоКоду("БЛН");		
	КонецЕсли;	
	
	Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиОтчета);	
	               	
КонецПроцедуры

&НаСервере
Функция ПолучитьПланВидовРасчетаОплатаБольничныхЛистовЗаСчетРаботодателя()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОсновныеНачисленияОрганизаций.Ссылка
	|ИЗ
	|	ПланВидовРасчета.Начисления КАК ОсновныеНачисленияОрганизаций
	|ГДЕ
	|	ОсновныеНачисленияОрганизаций.Код = &Код
	|	И ОсновныеНачисленияОрганизаций.ПометкаУдаления = ЛОЖЬ";	
	Запрос.УстановитьПараметр("Код", "БЛРДТ");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли; 
	Иначе
		Возврат Неопределено;
	КонецЕсли; 	
КонецФункции // ПолучитьПланВидовРасчетаОплатаБольничныхЛистовЗаСчетРаботодателя()
 
