
&НаСервере
Процедура УбратьНаСервере()
	
	ДокСсылка = НачислениеЗП;
	
	МеняемПособия = Ложь;
	МеняемНачисления = Ложь;
	
	Перерасчет = ДокСсылка.НачисленияПерерасчет.Выгрузить();
	ПерерасчетПособий = ДокСсылка.ПособияПерерасчет.Выгрузить();
	
	ДокОбъект = ДокСсылка.ПолучитьОбъект();
	
	// Начисления перерасчет
	Сотрудники = ОбщегоНазначенияКлиентСервер.СвернутьМассив(Перерасчет.ВыгрузитьКолонку("Сотрудник"));
	МассивСтрокДляУдаления = Новый Массив;
	Для Каждого Сотрудник Из Сотрудники Цикл 
		НайденныеСтроки = Перерасчет.НайтиСтроки(Новый Структура("Сотрудник", Сотрудник));
		Итог = 0;
		
		Для Каждого СтрокаДанных Из НайденныеСтроки Цикл 
			Итог = Итог + СтрокаДанных.Результат;
		КонецЦикла;
		
		Если Итог = 0 Тогда 
			Для Каждого СтрокаДанных Из НайденныеСтроки Цикл 
				МассивСтрокДляУдаления.Добавить(СтрокаДанных);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Если МассивСтрокДляУдаления.Количество() > 0 Тогда 
		Для Каждого СтрокаДанных Из МассивСтрокДляУдаления Цикл 
			Перерасчет.Удалить(СтрокаДанных);
		КонецЦикла;		
		
		НомерСтроки = 1;
		Для Каждого СтрокаДанных Из Перерасчет Цикл 
			СтрокаДанных.НомерСтроки = НомерСтроки;
			НомерСтроки = НомерСтроки + 1;
		КонецЦикла;
		
		МеняемНачисления = Истина;
		ДокОбъект.НачисленияПерерасчет.Загрузить(Перерасчет);
	КонецЕсли;
	
	// Пособия перерасчет
	Сотрудники = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ПерерасчетПособий.ВыгрузитьКолонку("Сотрудник"));
	МассивСтрокДляУдаления = Новый Массив;
	Для Каждого Сотрудник Из Сотрудники Цикл 
		НайденныеСтроки = ПерерасчетПособий.НайтиСтроки(Новый Структура("Сотрудник", Сотрудник));
		Итог = 0;
		
		Для Каждого СтрокаДанных Из НайденныеСтроки Цикл 
			Итог = Итог + СтрокаДанных.Результат;
		КонецЦикла;
		
		Если Итог = 0 Тогда 
			Для Каждого СтрокаДанных Из НайденныеСтроки Цикл 
				МассивСтрокДляУдаления.Добавить(СтрокаДанных);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Если МассивСтрокДляУдаления.Количество() > 0 Тогда 
		Для Каждого СтрокаДанных Из МассивСтрокДляУдаления Цикл 
			ПерерасчетПособий.Удалить(СтрокаДанных);
		КонецЦикла;		
		
		НомерСтроки = 1;
		Для Каждого СтрокаДанных Из ПерерасчетПособий Цикл 
			СтрокаДанных.НомерСтроки = НомерСтроки;
			НомерСтроки = НомерСтроки + 1;
		КонецЦикла;
		
		МеняемПособия = Истина;
		ДокОбъект.ПособияПерерасчет.Загрузить(ПерерасчетПособий);
	КонецЕсли;

	Если МеняемНачисления ИЛИ МеняемПособия Тогда 
		ДокОбъект.Записать();
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура Убрать(Команда)
	УбратьНаСервере();
КонецПроцедуры
