Функция СведенияОВнешнейОбработке() Экспорт
	
   РегистрационныеДанные = Новый Структура;
   РегистрационныеДанные.Вставить("Наименование", "Выгрузка данных по сотрудникам в active directory");
   РегистрационныеДанные.Вставить("БезопасныйРежим", Ложь);
   РегистрационныеДанные.Вставить("Версия", "1.0");
   РегистрационныеДанные.Вставить("Вид", "ДополнительнаяОбработка");
   РегистрационныеДанные.Вставить("Информация", "Выгрузка данных по сотрудникам в active directory");
   
   Команды = Новый ТаблицаЗначений;
   Команды.Колонки.Добавить("Идентификатор");
   Команды.Колонки.Добавить("Представление");
   Команды.Колонки.Добавить("Модификатор");
   Команды.Колонки.Добавить("ПоказыватьОповещение");
   Команды.Колонки.Добавить("Использование");
   
   Команда = Команды.Добавить();
   Команда.Идентификатор = "1";
   Команда.Представление = "Выгрузка данных по сотрудникам в active directory";
   Команда.ПоказыватьОповещение = Истина;
   Команда.Использование = "ВызовСерверногоМетода";
   
   РегистрационныеДанные.Вставить("Команды", Команды);
   
   Возврат РегистрационныеДанные;
   
КонецФункции

Процедура ВыполнитьКоманду(ИдентификаторКоманды = Неопределено, СотрудникКПриему = Неопределено) Экспорт
	
	//ИдентификаторПроцесса = НачатьПроцесс("16");
	
	//////////////////////////////////////////////////
	// Штатные сотрудники
	////////////////////////////////////////////////// 
	
	
	ЗапросСотрудники = Новый Запрос;
	ТекстЗапроса = "";
	Если СотрудникКПриему<>Неопределено Тогда 
		ТекстЗапроса = "ВЫБРАТЬ
		               |	Сотрудники.Код КАК ТабельныйНомер,
		               |	ФИОФизическихЛицСрезПоследних.Фамилия КАК Фамилия,
		               |	ФИОФизическихЛицСрезПоследних.Имя КАК Имя,
		               |	ФИОФизическихЛицСрезПоследних.Отчество КАК Отчество,
		               |	Сотрудники.ФизическоеЛицо.ДатаРождения КАК ДатаРождения,
		               |	"" "" КАК Должность,
		               |	""Временное подразделение"" КАК Подразделение,
		               |	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаУвольнения,
		               |	ВЫБОР
		               |		КОГДА Сотрудники.ПометкаУдаления
		               |			ТОГДА 1
		               |		ИНАЧЕ 0
		               |	КОНЕЦ КАК Уволен
		               |ИЗ
		               |	Справочник.Сотрудники КАК Сотрудники
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц.СрезПоследних КАК ФИОФизическихЛицСрезПоследних
		               |		ПО Сотрудники.ФизическоеЛицо = ФИОФизическихЛицСрезПоследних.ФизическоеЛицо
		               |ГДЕ
		               |	Сотрудники.Ссылка = &СотрудникКПриему";
		ЗапросСотрудники.УстановитьПараметр("СотрудникКПриему",Справочники.Сотрудники.ПолучитьСсылку(СотрудникКПриему));
	Иначе		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	КадроваяИсторияСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
		|	КадроваяИсторияСотрудниковСрезПоследних.Должность КАК Должность,
		|	КадроваяИсторияСотрудниковСрезПоследних.Подразделение КАК Подразделение
		|ПОМЕСТИТЬ ВТ_КадровыеДанные
		|ИЗ
		|	РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних КАК КадроваяИсторияСотрудниковСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Сотрудники.Код КАК ТабельныйНомер,
		|	ФИОФизическихЛицСрезПоследних.Фамилия КАК Фамилия,
		|	ФИОФизическихЛицСрезПоследних.Имя КАК Имя,
		|	ФИОФизическихЛицСрезПоследних.Отчество КАК Отчество,
		|	Сотрудники.ФизическоеЛицо.ДатаРождения КАК ДатаРождения,
		|	ВТ_КадровыеДанные.Должность КАК Должность,
		|	ВТ_КадровыеДанные.Подразделение КАК Подразделение,
		|	ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения КАК ДатаУвольнения,
		|	ВЫБОР
		|		КОГДА ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА 0
		|		ИНАЧЕ ВЫБОР
		|				КОГДА НАЧАЛОПЕРИОДА(ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения, ДЕНЬ) <= НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ)
		|					ТОГДА 1
		|				ИНАЧЕ 0
		|			КОНЕЦ
		|	КОНЕЦ КАК Уволен
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц.СрезПоследних КАК ФИОФизическихЛицСрезПоследних
		|		ПО Сотрудники.ФизическоеЛицо = ФИОФизическихЛицСрезПоследних.ФизическоеЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
		|		ПО Сотрудники.Ссылка = ТекущиеКадровыеДанныеСотрудников.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КадровыеДанные КАК ВТ_КадровыеДанные
		|		ПО Сотрудники.Ссылка = ВТ_КадровыеДанные.Сотрудник
		|ГДЕ
		|	ТекущиеКадровыеДанныеСотрудников.ДатаПриема <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|	И ТекущиеКадровыеДанныеСотрудников.ОформленПоТрудовомуДоговору
		|	И НЕ ВТ_КадровыеДанные.Подразделение.Наименование ПОДОБНО ""%Агентство%""
		|	И НЕ ВТ_КадровыеДанные.Подразделение.Наименование ПОДОБНО ""Дополнительный офис %""
		|	И НЕ ВТ_КадровыеДанные.Подразделение В
		|				(ВЫБРАТЬ
		|					ПодразделенияОрганизаций.Ссылка
		|				ИЗ
		|					Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
		|				ГДЕ
		|					ПодразделенияОрганизаций.Родитель.Наименование ПОДОБНО ""%Агентство%"")
		|	И НЕ Сотрудники.ППФ_Агент
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СоставГруппСотрудников.Сотрудник.Код,
		|	ФИОФизическихЛицСрезПоследних.Фамилия,
		|	ФИОФизическихЛицСрезПоследних.Имя,
		|	ФИОФизическихЛицСрезПоследних.Отчество,
		|	СоставГруппСотрудников.Сотрудник.ФизическоеЛицо.ДатаРождения,
		|	"" "",
		|	""Временное подразделение"",
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	ВЫБОР
		|		КОГДА СоставГруппСотрудников.Сотрудник.ПометкаУдаления
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|ИЗ
		|	РегистрСведений.СоставГруппСотрудников КАК СоставГруппСотрудников
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц.СрезПоследних КАК ФИОФизическихЛицСрезПоследних
		|		ПО СоставГруппСотрудников.Сотрудник.ФизическоеЛицо = ФИОФизическихЛицСрезПоследних.ФизическоеЛицо
		|ГДЕ
		|	СоставГруппСотрудников.ГруппаСотрудников.Наименование = ""Сотрудники к приему""";

	КонецЕсли;
	ЗапросСотрудники.Текст = ТекстЗапроса;		
	ЗапросСотрудники.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	РезультатСотрудники = ЗапросСотрудники.Выполнить();
	
	Если Не РезультатСотрудники.Пустой() Тогда
		
		ВыгрузкаСотрудники = РезультатСотрудники.Выгрузить();
		
		Если ВыгрузкаСотрудники.Количество() > 0 Тогда
			
			Файл = Новый ТекстовыйДокумент;	
			
			Для Каждого Строка Из ВыгрузкаСотрудники Цикл
				
				Файл.ДобавитьСтроку(
					СокрЛП(Строка.ТабельныйНомер) 										+ "|" + 
					СокрЛП(Строка.Фамилия) 												+ "|" +
					СокрЛП(Строка.Имя) 													+ "|" +
					СокрЛП(Строка.Отчество) 											+ "|" +
                    Строка(Формат(Строка.ДатаРождения, "ДФ=dd.MM.yyyy")) 				+ "|" +
					?(ЗначениеЗаполнено(СокрЛП(Строка.Должность)),СокрЛП(Строка.Должность), " ")		+ "|" +
					СокрЛП(?(Строка.Подразделение = "Временное подразделение","00000000-0000-0000-0000-000000000002",Строка.Подразделение.УникальныйИдентификатор()))				+ "|" +
					СокрЛП(Строка.Уволен) 
				); 	
				
			КонецЦикла;
			
			Файл.Записать("\\vault\Documents\APPS\Exchange\AD1C\users.csv", КодировкаТекста.UTF8);
			Файл.Записать("\\10.146.1.218\d$\Jobs\1CAD_new\1CAD\users.csv", КодировкаТекста.UTF8); 
			
		КонецЕсли;
		
	КонецЕсли; 
	
	Если СотрудникКПриему<>Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	//////////////////////////////////////////////////
	// Подразделения организации (Штат)
	//////////////////////////////////////////////////
	
	ЗапросПодразделения = Новый Запрос;
	ЗапросПодразделения.Текст = 
	"ВЫБРАТЬ
	|	ПодразделенияОрганизацийДополнительныеРеквизиты.Ссылка КАК Подразделение,
	|	ПодразделенияОрганизацийДополнительныеРеквизиты.Свойство.Наименование КАК СвойствоНаименование,
	|	ПодразделенияОрганизацийДополнительныеРеквизиты.Значение КАК Значение
	|ПОМЕСТИТЬ ВТ_СВОЙСТВА
	|ИЗ
	|	Справочник.ПодразделенияОрганизаций.ДополнительныеРеквизиты КАК ПодразделенияОрганизацийДополнительныеРеквизиты
	|ГДЕ
	|	(ПодразделенияОрганизацийДополнительныеРеквизиты.Свойство.Наименование = ""Руководитель (Подразделения)""
	|			ИЛИ ПодразделенияОрганизацийДополнительныеРеквизиты.Свойство.Наименование = ""Куратор (Подразделения)"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПодразделенияОрганизаций.Наименование КАК ПодразделениеНаименование,
	|	ПодразделенияОрганизаций.Ссылка КАК ПодразделениеИдентификатор,
	|	ВЫБОР
	|		КОГДА ПодразделенияОрганизаций.Расформировано = ИСТИНА
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПодразделенияОрганизаций.ДатаСоздания = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА 0
	|				ИНАЧЕ 1
	|			КОНЕЦ
	|	КОНЕЦ КАК Закрыто,
	|	ПодразделенияОрганизаций.Родитель.Наименование КАК ПодразделениеРодитель1Наименование,
	|	ПодразделенияОрганизаций.Родитель.Ссылка КАК ПодразделениеРодитель1Идентификатор,
	|	ВТ_СВОЙСТВА1.Значение.Код КАК ТабельныйНомер,
	|	ВТ_СВОЙСТВА2.Значение.Код КАК ТабельныйНомерКуратора
	|ИЗ
	|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СВОЙСТВА КАК ВТ_СВОЙСТВА1
	|		ПО ПодразделенияОрганизаций.Ссылка = ВТ_СВОЙСТВА1.Подразделение
	|			И (""Руководитель (Подразделения)"" = ВТ_СВОЙСТВА1.СвойствоНаименование)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СВОЙСТВА КАК ВТ_СВОЙСТВА2
	|		ПО ПодразделенияОрганизаций.Ссылка = ВТ_СВОЙСТВА2.Подразделение
	|			И (""Куратор (Подразделения)"" = ВТ_СВОЙСТВА2.СвойствоНаименование)
	|ГДЕ
	|	НЕ ПодразделенияОрганизаций.Наименование ПОДОБНО ""%Агентство%""
	|	И НЕ ПодразделенияОрганизаций.Наименование ПОДОБНО ""Представительство Общества с ограниченной ответственностью """"ЧЕШСКАЯ СТРАХОВАЯ КОМПАНИЯ""""%""
	|	И НЕ ПодразделенияОрганизаций.Наименование ПОДОБНО ""Представительство%""
	|	И НЕ ПодразделенияОрганизаций.Наименование ПОДОБНО ""Дополнительный офис в городе%""
	|	И НЕ ПодразделенияОрганизаций.Наименование ПОДОБНО ""Дополнительный офис %""
	|	И НЕ ПодразделенияОрганизаций.Наименование ПОДОБНО ""%ЧЕШСКАЯ СТРАХОВАЯ КОМПАНИЯ%""
	|	И НЕ ПодразделенияОрганизаций.Ссылка В
	|				(ВЫБРАТЬ
	|					ПодразделенияОрганизаций.Ссылка
	|				ИЗ
	|					Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
	|				ГДЕ
	|					ПодразделенияОрганизаций.Родитель.Наименование ПОДОБНО ""%Агентство%"")
	|	И НЕ ПодразделенияОрганизаций.Ссылка В
	|				(ВЫБРАТЬ
	|					ПодразделенияОрганизаций.Ссылка
	|				ИЗ
	|					Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
	|				ГДЕ
	|					ПодразделенияОрганизаций.Родитель.Наименование = ""Представительство г.Уфа"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_СВОЙСТВА";
	
	РезультатПодразделения = ЗапросПодразделения.Выполнить();
	
	Если Не РезультатПодразделения.Пустой() Тогда
		ВыгрузкаПодразделения = РезультатПодразделения.Выгрузить();
		
		Если ВыгрузкаПодразделения.Количество() > 0 Тогда
			
			Файл2 = Новый ТекстовыйДокумент;
			
			Для Каждого Строка Из ВыгрузкаПодразделения Цикл
				Файл2.ДобавитьСтроку(
					СокрЛП(Строка.ПодразделениеНаименование) 										+ "|" +
					СокрЛП(Строка.ПодразделениеИдентификатор.УникальныйИдентификатор()) 			+ "|" + 
					СокрЛП(Строка.Закрыто)															+ "|" +
					СокрЛП(Строка.ПодразделениеРодитель1Наименование) 								+ "|" +
					СокрЛП(?(ЗначениеЗаполнено(Строка.ПодразделениеРодитель1Идентификатор), Строка.ПодразделениеРодитель1Идентификатор.УникальныйИдентификатор(),""))	+ "|" +
					СокрЛП(Строка.ТабельныйНомер) 													+ "|" +
					СокрЛП(Строка.ТабельныйНомерКуратора)
				);	
				
			КонецЦикла;
			
			Файл2.Записать("\\vault\Documents\APPS\Exchange\AD1C\departments.csv", КодировкаТекста.UTF8);
			Файл2.Записать("\\10.146.1.218\d$\Jobs\1CAD_new\1CAD\departments.csv", КодировкаТекста.UTF8);
			
		КонецЕсли;
		
	КонецЕсли; 
	
	//////////////////////////////////////////////////
	// Агентства
	//////////////////////////////////////////////////	
	
	ЗапросПодразделения = Новый Запрос;
	ЗапросПодразделения.Текст = 
	"ВЫБРАТЬ
	|	ПодразделенияОрганизацийДополнительныеРеквизиты.Ссылка КАК Подразделение,
	|	ПодразделенияОрганизацийДополнительныеРеквизиты.Свойство.Наименование КАК СвойствоНаименование,
	|	ПодразделенияОрганизацийДополнительныеРеквизиты.Значение КАК Значение
	|ПОМЕСТИТЬ ВТ_СВОЙСТВА
	|ИЗ
	|	Справочник.ПодразделенияОрганизаций.ДополнительныеРеквизиты КАК ПодразделенияОрганизацийДополнительныеРеквизиты
	|ГДЕ
	|	(ПодразделенияОрганизацийДополнительныеРеквизиты.Свойство.Наименование = ""Руководитель (Подразделения)""
	|			ИЛИ ПодразделенияОрганизацийДополнительныеРеквизиты.Свойство.Наименование = ""Куратор (Подразделения)"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПодразделенияОрганизаций.Наименование КАК ПодразделениеНаименование,
	|	ПодразделенияОрганизаций.Ссылка КАК ПодразделениеИдентификатор,
	|	ВЫБОР
	|		КОГДА ПодразделенияОрганизаций.Расформировано = ИСТИНА
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПодразделенияОрганизаций.ДатаСоздания = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА 0
	|				ИНАЧЕ 1
	|			КОНЕЦ
	|	КОНЕЦ КАК Закрыто,
	|	ПодразделенияОрганизаций.Родитель.Наименование КАК ПодразделениеРодитель1Наименование,
	|	ПодразделенияОрганизаций.Родитель.Ссылка КАК ПодразделениеРодитель1Идентификатор,
	|	ВТ_СВОЙСТВА1.Значение.Код КАК ТабельныйНомер,
	|	ВТ_СВОЙСТВА2.Значение.Код КАК ТабельныйНомерКуратора
	|ИЗ
	|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СВОЙСТВА КАК ВТ_СВОЙСТВА1
	|		ПО ПодразделенияОрганизаций.Ссылка = ВТ_СВОЙСТВА1.Подразделение
	|			И (""Руководитель (Подразделения)"" = ВТ_СВОЙСТВА1.СвойствоНаименование)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СВОЙСТВА КАК ВТ_СВОЙСТВА2
	|		ПО ПодразделенияОрганизаций.Ссылка = ВТ_СВОЙСТВА2.Подразделение
	|			И (""Куратор (Подразделения)"" = ВТ_СВОЙСТВА2.СвойствоНаименование)
	|ГДЕ
	|	(ПодразделенияОрганизаций.Наименование ПОДОБНО ""%Агентство%""
	|			ИЛИ ПодразделенияОрганизаций.Наименование ПОДОБНО ""Представительство%""
	|			ИЛИ ПодразделенияОрганизаций.Наименование ПОДОБНО ""Дополнительный офис в городе%""
	|			ИЛИ ПодразделенияОрганизаций.Наименование ПОДОБНО ""Дополнительный офис %""
	|			ИЛИ ПодразделенияОрганизаций.Ссылка В
	|				(ВЫБРАТЬ
	|					ПодразделенияОрганизаций.Ссылка
	|				ИЗ
	|					Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
	|				ГДЕ
	|					ПодразделенияОрганизаций.Родитель.Наименование ПОДОБНО ""%Агентство%"")
	|			ИЛИ ПодразделенияОрганизаций.Ссылка В
	|				(ВЫБРАТЬ
	|					ПодразделенияОрганизаций.Ссылка
	|				ИЗ
	|					Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
	|				ГДЕ
	|					ПодразделенияОрганизаций.Родитель.Наименование = ""Представительство г.Уфа""))
	|	И НЕ ПодразделенияОрганизаций.Наименование ПОДОБНО ""Представительство Общества с ограниченной ответственностью """"ЧЕШСКАЯ СТРАХОВАЯ КОМПАНИЯ""""%""
	|	И НЕ ПодразделенияОрганизаций.Наименование ПОДОБНО ""%ЧЕШСКАЯ СТРАХОВАЯ КОМПАНИЯ%""
	|	И ПодразделенияОрганизаций.ПометкаУдаления = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_СВОЙСТВА";
	
	РезультатПодразделения = ЗапросПодразделения.Выполнить();
	
	Если Не РезультатПодразделения.Пустой() Тогда
		ВыгрузкаПодразделения = РезультатПодразделения.Выгрузить();
		
		Если ВыгрузкаПодразделения.Количество() > 0 Тогда
			
			Файл2 = Новый ТекстовыйДокумент;
			
			Для Каждого Строка Из ВыгрузкаПодразделения Цикл
				Файл2.ДобавитьСтроку(
				СокрЛП(Строка.ПодразделениеНаименование) 										+ "|" +
				СокрЛП(Строка.ПодразделениеИдентификатор.УникальныйИдентификатор()) 			+ "|" + 
				СокрЛП(Строка.Закрыто)															+ "|" +
				СокрЛП(Строка.ПодразделениеРодитель1Наименование) 								+ "|" +
				СокрЛП(?(ЗначениеЗаполнено(Строка.ПодразделениеРодитель1Идентификатор), Строка.ПодразделениеРодитель1Идентификатор.УникальныйИдентификатор(),""))	+ "|" +
				СокрЛП(Строка.ТабельныйНомер) 													+ "|" +
				СокрЛП(Строка.ТабельныйНомерКуратора)
				);	
				
			КонецЦикла;
			
			Файл2.Записать("\\vault\Documents\APPS\Exchange\AD1C\agency.csv", КодировкаТекста.UTF8);
			Файл2.Записать("\\10.146.1.218\d$\Jobs\1CAD_new\1CAD\agency.csv", КодировкаТекста.UTF8);
			
		КонецЕсли;
		
	КонецЕсли; 	
	
	//////////////////////////////////////////////////
	// Агенты
	//////////////////////////////////////////////////
	
	ЗапросАгенты = Новый Запрос;
	ЗапросАгенты.Текст =
	"ВЫБРАТЬ
	|	КадроваяИсторияСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
	|	КадроваяИсторияСотрудниковСрезПоследних.Должность КАК Должность,
	|	КадроваяИсторияСотрудниковСрезПоследних.Подразделение КАК Подразделение
	|ПОМЕСТИТЬ ВТ_КадровыеДанные
	|ИЗ
	|	РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних КАК КадроваяИсторияСотрудниковСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Сотрудники.Код КАК ТабельныйНомер,
	|	ФИОФизическихЛицСрезПоследних.Фамилия КАК Фамилия,
	|	ФИОФизическихЛицСрезПоследних.Имя КАК Имя,
	|	ФИОФизическихЛицСрезПоследних.Отчество КАК Отчество,
	|	Сотрудники.ФизическоеЛицо.ДатаРождения КАК ДатаРождения,
	|	ВТ_КадровыеДанные.Должность КАК Должность,
	|	ВТ_КадровыеДанные.Подразделение КАК Подразделение,
	|	ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения КАК ДатаУвольнения,
	|	ВЫБОР
	|		КОГДА ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НАЧАЛОПЕРИОДА(ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения, ДЕНЬ) <= НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ)
	|					ТОГДА 1
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Уволен
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц.СрезПоследних КАК ФИОФизическихЛицСрезПоследних
	|		ПО Сотрудники.ФизическоеЛицо = ФИОФизическихЛицСрезПоследних.ФизическоеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
	|		ПО Сотрудники.Ссылка = ТекущиеКадровыеДанныеСотрудников.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КадровыеДанные КАК ВТ_КадровыеДанные
	|		ПО Сотрудники.Ссылка = ВТ_КадровыеДанные.Сотрудник
	|ГДЕ
	|	ТекущиеКадровыеДанныеСотрудников.ДатаПриема <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	И ТекущиеКадровыеДанныеСотрудников.ОформленПоТрудовомуДоговору
	|	И ВТ_КадровыеДанные.Подразделение.Родитель.Наименование = ""Управление агентских продаж""
	|	И ВТ_КадровыеДанные.Подразделение.Родитель.Код = ""504""
	|	И ВТ_КадровыеДанные.Подразделение.Наименование ПОДОБНО ""%Агентств%""
	|	И НЕ Сотрудники.ППФ_Агент";
	
	ЗапросАгенты.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	РезультатАгенты = ЗапросАгенты.Выполнить();
	
	Если Не РезультатАгенты.Пустой() Тогда
		
		ВыгрузкаАгенты = РезультатАгенты.Выгрузить();
		
		Если ВыгрузкаАгенты.Количество() > 0 Тогда
			
			Файл3 = Новый ТекстовыйДокумент;	
			
			Для Каждого Строка Из ВыгрузкаАгенты Цикл
				
				Файл3.ДобавитьСтроку(
					СокрЛП(Строка.ТабельныйНомер) 										+ "|" + 
					СокрЛП(Строка.Фамилия) 												+ "|" +
					СокрЛП(Строка.Имя) 													+ "|" +
					СокрЛП(Строка.Отчество) 											+ "|" +
                    Строка(Формат(Строка.ДатаРождения, "ДФ=dd.MM.yyyy")) 				+ "|" +
					СокрЛП(Строка.Должность) 											+ "|" +
					СокрЛП(Строка.Подразделение.УникальныйИдентификатор()) 				+ "|" +
					СокрЛП(Строка.Уволен)
				); 	
				
			КонецЦикла;
			
			Файл3.Записать("\\vault\Documents\APPS\Exchange\AD1C\users_ra.csv", КодировкаТекста.UTF8);
			Файл3.Записать("\\10.146.1.218\d$\Jobs\1CAD_new\1CAD\users_ra.csv", КодировкаТекста.UTF8); 
			
		КонецЕсли;
		
	КонецЕсли;	
	
	//////////////////////////////////////////////////
	// Подразделения агентской сети
	//////////////////////////////////////////////////
	
	ЗапросПодразделенияАгентскойСети = Новый Запрос;
	ЗапросПодразделенияАгентскойСети.Текст = 
	"ВЫБРАТЬ
	|	ПодразделенияОрганизацийДополнительныеРеквизиты.Ссылка КАК Подразделение,
	|	ПодразделенияОрганизацийДополнительныеРеквизиты.Свойство.Наименование КАК СвойствоНаименование,
	|	ПодразделенияОрганизацийДополнительныеРеквизиты.Значение КАК Значение
	|ПОМЕСТИТЬ ВТ_СВОЙСТВА
	|ИЗ
	|	Справочник.ПодразделенияОрганизаций.ДополнительныеРеквизиты КАК ПодразделенияОрганизацийДополнительныеРеквизиты
	|ГДЕ
	|	(ПодразделенияОрганизацийДополнительныеРеквизиты.Свойство.Наименование = ""Руководитель (Подразделения)""
	|			ИЛИ ПодразделенияОрганизацийДополнительныеРеквизиты.Свойство.Наименование = ""Куратор (Подразделения)"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПодразделенияОрганизаций.Наименование КАК ПодразделениеНаименование,
	|	ПодразделенияОрганизаций.Ссылка КАК ПодразделениеИдентификатор,
	|	ВЫБОР
	|		КОГДА ПодразделенияОрганизаций.Расформировано = ИСТИНА
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПодразделенияОрганизаций.ДатаСоздания = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА 0
	|				ИНАЧЕ 1
	|			КОНЕЦ
	|	КОНЕЦ КАК Закрыто,
	|	ПодразделенияОрганизаций.Родитель.Наименование КАК ПодразделениеРодитель1Наименование,
	|	ПодразделенияОрганизаций.Родитель.Ссылка КАК ПодразделениеРодитель1Идентификатор,
	|	ВТ_СВОЙСТВА1.Значение.Код КАК ТабельныйНомер,
	|	ВТ_СВОЙСТВА2.Значение.Код КАК ТабельныйНомерКуратора
	|ИЗ
	|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СВОЙСТВА КАК ВТ_СВОЙСТВА1
	|		ПО ПодразделенияОрганизаций.Ссылка = ВТ_СВОЙСТВА1.Подразделение
	|			И (""Руководитель (Подразделения)"" = ВТ_СВОЙСТВА1.СвойствоНаименование)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СВОЙСТВА КАК ВТ_СВОЙСТВА2
	|		ПО ПодразделенияОрганизаций.Ссылка = ВТ_СВОЙСТВА2.Подразделение
	|			И (""Куратор (Подразделения)"" = ВТ_СВОЙСТВА2.СвойствоНаименование)
	|ГДЕ
	|	ПодразделенияОрганизаций.Родитель.Наименование = ""Управление агентских продаж""
	|	И ПодразделенияОрганизаций.Родитель.Код = ""504""
	|	И ПодразделенияОрганизаций.Наименование ПОДОБНО ""%Агентств%""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_СВОЙСТВА";
	
	РезультатПодразделенияАгентскойСети = ЗапросПодразделенияАгентскойСети.Выполнить();
	
	Если Не РезультатПодразделенияАгентскойСети.Пустой() Тогда
		ВыгрузкаПодразделенияАгентскойСети = РезультатПодразделенияАгентскойСети.Выгрузить();
		
		Если ВыгрузкаПодразделенияАгентскойСети.Количество() > 0 Тогда
			
			Файл4 = Новый ТекстовыйДокумент;
			
			Для Каждого Строка Из ВыгрузкаПодразделенияАгентскойСети Цикл
				Файл4.ДобавитьСтроку(
					СокрЛП(Строка.ПодразделениеНаименование) 										+ "|" +
					СокрЛП(Строка.ПодразделениеИдентификатор.УникальныйИдентификатор()) 			+ "|" + 
					СокрЛП(Строка.Закрыто)															+ "|" +
					СокрЛП(Строка.ПодразделениеРодитель1Наименование) 								+ "|" +
					СокрЛП(?(ЗначениеЗаполнено(Строка.ПодразделениеРодитель1Идентификатор), Строка.ПодразделениеРодитель1Идентификатор.УникальныйИдентификатор(),""))	+ "|" +
					СокрЛП(Строка.ТабельныйНомер) 													+ "|" +
					СокрЛП(Строка.ТабельныйНомерКуратора)
				);	
				
			КонецЦикла;
			
			Файл4.Записать("\\vault\Documents\APPS\Exchange\AD1C\departments_ra.csv", КодировкаТекста.UTF8);
			Файл4.Записать("\\10.146.1.218\d$\Jobs\1CAD_new\1CAD\departments_ra.csv", КодировкаТекста.UTF8);
			
		КонецЕсли;
		
	КонецЕсли;	
	
	//////////////////////////////////////////////////
	// Уволенные сотрудники агентств 
	//////////////////////////////////////////////////
	
	ЗапросУволенныеСотрудникиАгентств = Новый Запрос;
	ЗапросУволенныеСотрудникиАгентств.Текст =
	"ВЫБРАТЬ
	|	КадроваяИсторияСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
	|	КадроваяИсторияСотрудниковСрезПоследних.Должность КАК Должность,
	|	КадроваяИсторияСотрудниковСрезПоследних.Подразделение КАК Подразделение
	|ПОМЕСТИТЬ ВТ_КадровыеДанные
	|ИЗ
	|	РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних КАК КадроваяИсторияСотрудниковСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Сотрудники.ФизическоеЛицо.ИНН КАК ИНН
	|ПОМЕСТИТЬ ВТ_СОТРУДНИКИ
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
	|		ПО Сотрудники.Ссылка = ТекущиеКадровыеДанныеСотрудников.Сотрудник
	|ГДЕ
	|	ТекущиеКадровыеДанныеСотрудников.ОформленПоТрудовомуДоговору
	|	И ТекущиеКадровыеДанныеСотрудников.ДатаПриема <> ДАТАВРЕМЯ(1, 1, 1)
	|	И (ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения > &ТекущаяДата)
	|	И Сотрудники.ФизическоеЛицо.ИНН <> """"
	|	И НЕ Сотрудники.ППФ_Агент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФИОФизическихЛицСрезПоследних.Фамилия КАК Фамилия,
	|	ФИОФизическихЛицСрезПоследних.Имя КАК Имя,
	|	ФИОФизическихЛицСрезПоследних.Отчество КАК Отчество,
	|	ВТ_КадровыеДанные.Подразделение.Наименование КАК Агентство,
	|	ВТ_КадровыеДанные.Подразделение.Код КАК КодАгентства,
	|	ВТ_КадровыеДанные.Должность.Наименование КАК Должность,
	|	ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения КАК ДатаУвольнения,
	|	ТекущиеКадровыеДанныеСотрудников.Сотрудник.Код КАК ТабНомер
	|ИЗ
	|	РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц.СрезПоследних КАК ФИОФизическихЛицСрезПоследних
	|		ПО ТекущиеКадровыеДанныеСотрудников.Сотрудник.ФизическоеЛицо = ФИОФизическихЛицСрезПоследних.ФизическоеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КадровыеДанные КАК ВТ_КадровыеДанные
	|		ПО ТекущиеКадровыеДанныеСотрудников.Сотрудник = ВТ_КадровыеДанные.Сотрудник
	|ГДЕ
	|	ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения <> ДАТАВРЕМЯ(1, 1, 1)
	|	И ВТ_КадровыеДанные.Подразделение.Наименование ПОДОБНО ""%Агентство%""
	|	И (ВТ_КадровыеДанные.Должность.Наименование = ""Старший специалист по сопровождению продаж""
	|			ИЛИ ВТ_КадровыеДанные.Должность.Наименование = ""Специалист по сопровождению продаж"")
	|	И НЕ ТекущиеКадровыеДанныеСотрудников.Сотрудник.ФизическоеЛицо.ИНН В
	|				(ВЫБРАТЬ
	|					ВТ_СОТРУДНИКИ.ИНН
	|				ИЗ
	|					ВТ_СОТРУДНИКИ КАК ВТ_СОТРУДНИКИ)
	|	И НЕ ВТ_КадровыеДанные.Сотрудник.ППФ_Агент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ФИОФизическихЛицСрезПоследних.Фамилия,
	|	ФИОФизическихЛицСрезПоследних.Имя,
	|	ФИОФизическихЛицСрезПоследних.Отчество,
	|	ВТ_КадровыеДанные.Подразделение.Наименование,
	|	ВТ_КадровыеДанные.Подразделение.Код,
	|	ВТ_КадровыеДанные.Должность.Наименование,
	|	ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения,
	|	ТекущиеКадровыеДанныеСотрудников.Сотрудник.Код
	|ИЗ
	|	РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц.СрезПоследних КАК ФИОФизическихЛицСрезПоследних
	|		ПО ТекущиеКадровыеДанныеСотрудников.Сотрудник.ФизическоеЛицо = ФИОФизическихЛицСрезПоследних.ФизическоеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КадровыеДанные КАК ВТ_КадровыеДанные
	|		ПО ТекущиеКадровыеДанныеСотрудников.Сотрудник = ВТ_КадровыеДанные.Сотрудник
	|ГДЕ
	|	ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения <> ДАТАВРЕМЯ(1, 1, 1)
	|	И ТекущиеКадровыеДанныеСотрудников.ДатаПриема <> ДАТАВРЕМЯ(1, 1, 1)
	|	И НЕ ВТ_КадровыеДанные.Подразделение В ИЕРАРХИИ (&УправлениеАгентскихПродаж)
	|	И ТекущиеКадровыеДанныеСотрудников.ОсновноеРабочееМестоВОрганизации = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_СОТРУДНИКИ";
	
	ЗапросУволенныеСотрудникиАгентств.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	УправлениеАгентскихПродаж = Новый Массив;
	УправлениеАгентскихПродаж.Добавить(Справочники.ПодразделенияОрганизаций.НайтиПоКоду("504"));
	УправлениеАгентскихПродаж.Добавить(Справочники.ПодразделенияОрганизаций.НайтиПоКоду("179"));                                                     
	ЗапросУволенныеСотрудникиАгентств.УстановитьПараметр("УправлениеАгентскихПродаж", УправлениеАгентскихПродаж);
	
	РезультатУволенныеСотрудникиАгентств = ЗапросУволенныеСотрудникиАгентств.Выполнить();
	Если Не РезультатУволенныеСотрудникиАгентств.Пустой() Тогда
		
		Файл5 = Новый ТекстовыйДокумент;
		
		ВыборкаУволенныеСотрудникиАгентств = РезультатУволенныеСотрудникиАгентств.Выбрать();
		Пока ВыборкаУволенныеСотрудникиАгентств.Следующий() Цикл
			Файл5.ДобавитьСтроку(
				СокрЛП(ВыборкаУволенныеСотрудникиАгентств.ТабНомер)							+ "|" +
				СокрЛП(ВыборкаУволенныеСотрудникиАгентств.Фамилия) 							+ "|" +
				СокрЛП(ВыборкаУволенныеСотрудникиАгентств.Имя) 								+ "|" +
				СокрЛП(ВыборкаУволенныеСотрудникиАгентств.Отчество) 						+ "|" +
				Формат(ВыборкаУволенныеСотрудникиАгентств.ДатаУвольнения,"ДФ=dd.MM.yyyy") 	+ "|" +
				СокрЛП(ВыборкаУволенныеСотрудникиАгентств.КодАгентства)						+ "|" +
				СокрЛП(ВыборкаУволенныеСотрудникиАгентств.Агентство)						+ "|" +
				СокрЛП(ВыборкаУволенныеСотрудникиАгентств.Должность)
			);				
		КонецЦикла; 
		
		Файл5.Записать("\\vault\Documents\APPS\Exchange\AD1C\dismissedEmployees.csv", КодировкаТекста.UTF8);
		Файл5.Записать("\\10.146.1.218\d$\Jobs\1CAD_new\1CAD\dismissedEmployees.csv", КодировкаТекста.UTF8);
		
	КонецЕсли;
	
	//////////////////////////////////////////////////
	// Действующе сотрудники
	////////////////////////////////////////////////// 
	
	ЗапросДействующиеСотрудникиАгентств = Новый Запрос;
	ЗапросДействующиеСотрудникиАгентств.Текст =
	"ВЫБРАТЬ
	|	КадроваяИсторияСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
	|	КадроваяИсторияСотрудниковСрезПоследних.Должность КАК Должность,
	|	КадроваяИсторияСотрудниковСрезПоследних.Подразделение КАК Подразделение
	|ПОМЕСТИТЬ ВТ_КадровыеДанные
	|ИЗ
	|	РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних КАК КадроваяИсторияСотрудниковСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Сотрудники.ФизическоеЛицо.ИНН КАК ИНН
	|ПОМЕСТИТЬ ВТ_СОТРУДНИКИ
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
	|		ПО Сотрудники.Ссылка = ТекущиеКадровыеДанныеСотрудников.Сотрудник
	|ГДЕ
	|	ТекущиеКадровыеДанныеСотрудников.ОформленПоТрудовомуДоговору
	|	И ТекущиеКадровыеДанныеСотрудников.ДатаПриема <> ДАТАВРЕМЯ(1, 1, 1)
	|	И (ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения > &ТекущаяДата)
	|	И Сотрудники.ФизическоеЛицо.ИНН <> """"
	|	И НЕ Сотрудники.ППФ_Агент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФИОФизическихЛицСрезПоследних.Фамилия КАК Фамилия,
	|	ФИОФизическихЛицСрезПоследних.Имя КАК Имя,
	|	ФИОФизическихЛицСрезПоследних.Отчество КАК Отчество,
	|	ВТ_КадровыеДанные.Подразделение.Наименование КАК Агентство,
	|	ВТ_КадровыеДанные.Подразделение.Код КАК КодАгентства,
	|	ВТ_КадровыеДанные.Должность.Наименование КАК Должность,
	|	ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения КАК ДатаУвольнения,
	|	ТекущиеКадровыеДанныеСотрудников.Сотрудник.Код КАК ТабНомер
	|ИЗ
	|	РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц.СрезПоследних КАК ФИОФизическихЛицСрезПоследних
	|		ПО ТекущиеКадровыеДанныеСотрудников.Сотрудник.ФизическоеЛицо = ФИОФизическихЛицСрезПоследних.ФизическоеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КадровыеДанные КАК ВТ_КадровыеДанные
	|		ПО ТекущиеКадровыеДанныеСотрудников.Сотрудник = ВТ_КадровыеДанные.Сотрудник
	|ГДЕ
	|	(ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения > &ТекущаяДата)
	|	И ВТ_КадровыеДанные.Подразделение.Наименование ПОДОБНО ""%Агентство%""
	|	И (ВТ_КадровыеДанные.Должность.Наименование = ""Старший специалист по сопровождению продаж""
	|			ИЛИ ВТ_КадровыеДанные.Должность.Наименование = ""Специалист по сопровождению продаж"")
	|	И ТекущиеКадровыеДанныеСотрудников.Сотрудник.ФизическоеЛицо.ИНН В
	|			(ВЫБРАТЬ
	|				ВТ_СОТРУДНИКИ.ИНН
	|			ИЗ
	|				ВТ_СОТРУДНИКИ КАК ВТ_СОТРУДНИКИ)
	|	И НЕ ВТ_КадровыеДанные.Сотрудник.ППФ_Агент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_СОТРУДНИКИ";
	
	ЗапросДействующиеСотрудникиАгентств.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	РезультатДействующиеСотрудникиАгентств = ЗапросДействующиеСотрудникиАгентств.Выполнить();
	Если Не РезультатДействующиеСотрудникиАгентств.Пустой() Тогда
		
		Файл6 = Новый ТекстовыйДокумент;
		
		ВыборкаДействующиеСотрудникиАгентств = РезультатДействующиеСотрудникиАгентств.Выбрать();
		Пока ВыборкаДействующиеСотрудникиАгентств.Следующий() Цикл
			Файл6.ДобавитьСтроку(
				СокрЛП(ВыборкаДействующиеСотрудникиАгентств.ТабНомер)							+ "|" +
				СокрЛП(ВыборкаДействующиеСотрудникиАгентств.Фамилия) 							+ "|" +
				СокрЛП(ВыборкаДействующиеСотрудникиАгентств.Имя) 								+ "|" +
				СокрЛП(ВыборкаДействующиеСотрудникиАгентств.Отчество) 							+ "|" +
				Формат(ВыборкаДействующиеСотрудникиАгентств.ДатаУвольнения,"ДФ=dd.MM.yyyy") 	+ "|" +
				СокрЛП(ВыборкаДействующиеСотрудникиАгентств.КодАгентства)						+ "|" +
				СокрЛП(ВыборкаДействующиеСотрудникиАгентств.Агентство)						+ "|" +
				СокрЛП(ВыборкаДействующиеСотрудникиАгентств.Должность)
			);				
		КонецЦикла; 
		
		Файл6.Записать("\\vault\Documents\APPS\Exchange\AD1C\activeOfficeManagers.csv", КодировкаТекста.UTF8);
		Файл6.Записать("\\10.146.1.218\d$\Jobs\1CAD_new\1CAD\activeOfficeManagers.csv", КодировкаТекста.UTF8);
		
	КонецЕсли;
	
	//////////////////////////////////////////////////
	// Отпуска сотрудников
	////////////////////////////////////////////////// 
	ЗапросПоОтпускам = Новый Запрос;
	ЗапросПоОтпускам.Текст = "ВЫБРАТЬ
	                         |	СостоянияСотрудников.Период КАК ДатаНачала,
	                         |	СостоянияСотрудников.ДействуетДо КАК ДатаОкончания,
	                         |	СостоянияСотрудников.Сотрудник.Код КАК ТабНомер,
	                         |	ЕСТЬNULL(ФИОФизическихЛицСрезПоследних.Фамилия, """") + "" "" + ЕСТЬNULL(ФИОФизическихЛицСрезПоследних.Имя, """") + "" "" + ЕСТЬNULL(ФИОФизическихЛицСрезПоследних.Отчество, """") КАК ФИО
	                         |ИЗ
	                         |	РегистрСведений.СостоянияСотрудников КАК СостоянияСотрудников
	                         |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц.СрезПоследних КАК ФИОФизическихЛицСрезПоследних
	                         |		ПО СостоянияСотрудников.Сотрудник.ФизическоеЛицо = ФИОФизическихЛицСрезПоследних.ФизическоеЛицо
	                         |ГДЕ
	                         |	(СостоянияСотрудников.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	                         |			ИЛИ СостоянияСотрудников.ДействуетДо МЕЖДУ &ДатаНачала И &ДатаОкончания)
	                         |	И (СостоянияСотрудников.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСотрудника.ОтпускОсновной)
	                         |			ИЛИ СостоянияСотрудников.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСотрудника.ОтпускНеоплачиваемыйПоЗаконодательству)
	                         |			ИЛИ СостоянияСотрудников.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСотрудника.ОтпускПоУходуЗаРебенком)
	                         |			ИЛИ СостоянияСотрудников.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСотрудника.ДополнительныйОтпуск)
	                         |			ИЛИ СостоянияСотрудников.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСотрудника.ОтпускУчебныйОплачиваемый)
	                         |			ИЛИ СостоянияСотрудников.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСотрудника.ОтпускПоБеременностиИРодам)
	                         |			ИЛИ СостоянияСотрудников.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСотрудника.ОтпускНеоплачиваемыйПоРазрешениюРаботодателя)
	                         |			ИЛИ СостоянияСотрудников.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСотрудника.ОтсутствиеПоНевыясненнымПричинам)
	                         |			ИЛИ СостоянияСотрудников.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСотрудника.ОтсутствиеССохранениемОплаты))
	                         |	И НЕ СостоянияСотрудников.Сотрудник.ППФ_Агент";
	ЗапросПоОтпускам.УстановитьПараметр("ДатаНачала", ТекущаяДата());
	ЗапросПоОтпускам.УстановитьПараметр("ДатаОкончания", ДобавитьМесяц(ТекущаяДата(),3));
	
	РезультатПоОтпускам = ЗапросПоОтпускам.Выполнить();
	Если Не РезультатПоОтпускам.Пустой() Тогда
		
		Файл7 = Новый ТекстовыйДокумент;
		
		ВыборкаПоОтпускам = РезультатПоОтпускам.Выбрать();
		Пока ВыборкаПоОтпускам.Следующий() Цикл
			Файл7.ДобавитьСтроку(
			СокрЛП(ВыборкаПоОтпускам.ТабНомер)						+ "|" +
			СокрЛП(ВыборкаПоОтпускам.ФИО) 							+ "|" +
			Формат(ВыборкаПоОтпускам.ДатаНачала,"ДФ=dd.MM.yyyy") 	+ "|" +
			Формат(ВыборкаПоОтпускам.ДатаОкончания,"ДФ=dd.MM.yyyy"));				
		КонецЦикла; 
		
		Файл7.Записать("\\vault\Documents\APPS\Exchange\AD1C\vacations.csv", КодировкаТекста.UTF8);
		Файл7.Записать("\\10.146.1.218\d$\Jobs\1CAD_new\1CAD\vacations.csv", КодировкаТекста.UTF8);
		
	КонецЕсли;
	
	//ЗавершитьПроцесс(ИдентификаторПроцесса, Ложь);
		
КонецПроцедуры // ВыгрузитьДанныеПоСотрудникамВActiveDirectory()

Функция НачатьПроцесс(КодСервиса)
	
	Попытка
	
		Соединение = Новый HTTPСоединение("bg:8889/");	
		
		ИмяВыходногоФайла = ПолучитьимяВременногоФайла("txt");
		
		HTTPЗапрос = Новый HTTPЗапрос("/start/" + СокрЛП(КодСервиса));
		
		Соединение.Получить(HTTPЗапрос, ИмяВыходногоФайла);
		
		ЧтениеТекста = Новый ЧтениеТекста(имяВыходногоФайла);
		
		ИдентификаторПроцесса = ЧтениеТекста.Прочитать();
		
		ЧтениеТекста.Закрыть();	
		
		УдалитьФайлы(ИмяВыходногоФайла);
		
		Возврат ИдентификаторПроцесса;
	
	Исключение
		
		Возврат Неопределено;
		
	КонецПопытки;

КонецФункции // НачатьПроцесс()
   
Функция ЗавершитьПроцесс(ИдентификаторПроцесса, Отказ, ТекстСообщения = "")
	
	Если ИдентификаторПроцесса = Неопределено Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	Попытка
	
		Соединение = Новый HTTPСоединение("bg:8889/");
		
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("txt");
		
		ЗаписьТекста = Новый ЗаписьТекста(ИмяВременногоФайла, "CESU-8");
		ЗаписьТекста.Записать(ТекстСообщения);
		ЗаписьТекста.Закрыть();
		
		ИмяВыходногоФайла = ПолучитьимяВременногоФайла("txt");
		
		ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайла);
		
		УдалитьФайлы(ИмяВременногоФайла);
		
		Строка = СтрЗаменить(СтрЗаменить(СтрЗаменить(Base64Строка(ДвоичныеДанные), "+", "PPF1PPF"), Символы.ПС, ""), " ", "");
		КоличествоСтрок = СтрЧислоСтрок(Строка);
		
		НоваяСтрока = "";
		
		Для Сч = 1 По КоличествоСтрок Цикл
			
			НоваяСтрока = НоваяСтрока + СтрПолучитьСтроку(Строка, Сч);	
		
		КонецЦикла;  
		
		HTTPЗапрос = Новый HTTPЗапрос("/end/" + СокрЛП(ИдентификаторПроцесса) + "/" + ?(Отказ = Истина, "3", "2") + "/" + НоваяСтрока);
		Соединение.Получить(HTTPЗапрос, имяВыходногоФайла);
		
		ЧтениеТекста = Новый ЧтениеТекста(имяВыходногоФайла);	
		Результат = ЧтениеТекста.Прочитать();
		ЧтениеТекста.Закрыть();	
		
		УдалитьФайлы(ИмяВыходногоФайла);
		
		Возврат Результат;
		
	Исключение
		
		Возврат Неопределено;
		
	КонецПопытки;
	
КонецФункции // ЗавершитьПроцесс()

