
&НаКлиенте
Процедура ПечатьДокумента(Команда)
	ПечатьДокумента_Сервер();
КонецПроцедуры

&НаСервере
Процедура ПечатьДокумента_Сервер()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(Объект.СсылкаНаОбъект);
	ОбъектыПечати =Новый СписокЗначений;
	ОбъектыПечати.ЗагрузитьЗначения(МассивОбъектов);
	КоллекцияПечатныхФорм = УправлениеПечатью.ПодготовитьКоллекциюПечатныхФорм("ПФ_MXL_Т11");
	ОбработкаОбъект.Печать(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, Неопределено);
КонецПроцедуры
