
&НаСервере
Процедура ПолучитьШаблонНаСервере(ТабличныйДокумент)
	// Получим период
	НастройкиОтчета = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;
	Если НастройкиОтчета.Количество()>0 Тогда 
		ДатаНачала 		= НастройкиОтчета[0].Значение.ДатаНачала;
		ДатаОкончания 	= НастройкиОтчета[0].Значение.ДатаОкончания;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.РегистрацияВНалоговомОргане,
		               |	СУММА(ВЫБОР
		               |			КОГДА РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		               |				ТОГДА ЕСТЬNULL(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Сумма, 0)
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК Исчислено,
		               |	СУММА(ВЫБОР
		               |			КОГДА РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		               |				ТОГДА ЕСТЬNULL(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Сумма, 0)
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК Удержано,
		               |	СУММА(0) КАК Перечислено,
		               |	ВЫБОР
		               |		КОГДА РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Регистратор ССЫЛКА Документ.БольничныйЛист
		               |			ТОГДА ИСТИНА
		               |		ИНАЧЕ ВЫБОР
		               |				КОГДА РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Регистратор ССЫЛКА Документ.Отпуск
		               |					ТОГДА ИСТИНА
		               |				ИНАЧЕ ВЫБОР
		               |						КОГДА РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Регистратор ССЫЛКА Документ.ВедомостьНаВыплатуЗарплатыВБанк
		               |							ТОГДА ВЫБОР
		               |									КОГДА ВЫРАЗИТЬ(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Регистратор КАК Документ.ВедомостьНаВыплатуЗарплатыВБанк).СпособВыплаты.Наименование = ""Отпуска""
		               |											ИЛИ ВЫРАЗИТЬ(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Регистратор КАК Документ.ВедомостьНаВыплатуЗарплатыВБанк).СпособВыплаты.Наименование = ""Больничные листы""
		               |										ТОГДА ИСТИНА
		               |									ИНАЧЕ ЛОЖЬ
		               |								КОНЕЦ
		               |						ИНАЧЕ ЛОЖЬ
		               |					КОНЕЦ
		               |			КОНЕЦ
		               |	КОНЕЦ КАК ОтпускБольничный
		               |ПОМЕСТИТЬ ВТ_ДоГруппировки
		               |ИЗ
		               |	РегистрНакопления.РасчетыНалогоплательщиковСБюджетомПоНДФЛ КАК РасчетыНалогоплательщиковСБюджетомПоНДФЛ
		               |ГДЕ
		               |	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.МесяцНалоговогоПериода МЕЖДУ НАЧАЛОПЕРИОДА(&МесяцНалоговогоПериода, МЕСЯЦ) И КОНЕЦПЕРИОДА(&МесяцНалоговогоПериода, МЕСЯЦ)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.РегистрацияВНалоговомОргане,
		               |	ВЫБОР
		               |		КОГДА РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Регистратор ССЫЛКА Документ.БольничныйЛист
		               |			ТОГДА ИСТИНА
		               |		ИНАЧЕ ВЫБОР
		               |				КОГДА РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Регистратор ССЫЛКА Документ.Отпуск
		               |					ТОГДА ИСТИНА
		               |				ИНАЧЕ ВЫБОР
		               |						КОГДА РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Регистратор ССЫЛКА Документ.ВедомостьНаВыплатуЗарплатыВБанк
		               |							ТОГДА ВЫБОР
		               |									КОГДА ВЫРАЗИТЬ(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Регистратор КАК Документ.ВедомостьНаВыплатуЗарплатыВБанк).СпособВыплаты.Наименование = ""Отпуска""
		               |											ИЛИ ВЫРАЗИТЬ(РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Регистратор КАК Документ.ВедомостьНаВыплатуЗарплатыВБанк).СпособВыплаты.Наименование = ""Больничные листы""
		               |										ТОГДА ИСТИНА
		               |									ИНАЧЕ ЛОЖЬ
		               |								КОНЕЦ
		               |						ИНАЧЕ ЛОЖЬ
		               |					КОНЕЦ
		               |			КОНЕЦ
		               |	КОНЕЦ
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.РегистрацияВНалоговомОргане,
		               |	СУММА(0),
		               |	СУММА(0),
		               |	СУММА(ВЫБОР
		               |			КОГДА РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		               |				ТОГДА ЕСТЬNULL(РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Сумма, 0)
		               |			ИНАЧЕ 0
		               |		КОНЕЦ),
		               |	ВЫБОР
		               |		КОГДА РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Регистратор ССЫЛКА Документ.ППФ_ПеречислениеНДФЛВБюджет
		               |			ТОГДА ВЫБОР
		               |					КОГДА ВЫРАЗИТЬ(РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Регистратор КАК Документ.ППФ_ПеречислениеНДФЛВБюджет).ОтпускаБольничные
		               |						ТОГДА ИСТИНА
		               |					ИНАЧЕ ЛОЖЬ
		               |				КОНЕЦ
		               |		ИНАЧЕ ВЫБОР
		               |				КОГДА РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Регистратор ССЫЛКА Документ.ВедомостьНаВыплатуЗарплатыВБанк
		               |					ТОГДА ВЫБОР
		               |							КОГДА ВЫРАЗИТЬ(РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Регистратор КАК Документ.ВедомостьНаВыплатуЗарплатыВБанк).СпособВыплаты.Наименование = ""Отпуска""
		               |									ИЛИ ВЫРАЗИТЬ(РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Регистратор КАК Документ.ВедомостьНаВыплатуЗарплатыВБанк).СпособВыплаты.Наименование = ""Больничные листы""
		               |								ТОГДА ИСТИНА
		               |							ИНАЧЕ ЛОЖЬ
		               |						КОНЕЦ
		               |				ИНАЧЕ ЛОЖЬ
		               |			КОНЕЦ
		               |	КОНЕЦ
		               |ИЗ
		               |	РегистрНакопления.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ КАК РасчетыНалоговыхАгентовСБюджетомПоНДФЛ
		               |ГДЕ
		               |	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.МесяцНалоговогоПериода МЕЖДУ НАЧАЛОПЕРИОДА(&МесяцНалоговогоПериода, МЕСЯЦ) И КОНЕЦПЕРИОДА(&МесяцНалоговогоПериода, МЕСЯЦ)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.РегистрацияВНалоговомОргане,
		               |	ВЫБОР
		               |		КОГДА РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Регистратор ССЫЛКА Документ.ППФ_ПеречислениеНДФЛВБюджет
		               |			ТОГДА ВЫБОР
		               |					КОГДА ВЫРАЗИТЬ(РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Регистратор КАК Документ.ППФ_ПеречислениеНДФЛВБюджет).ОтпускаБольничные
		               |						ТОГДА ИСТИНА
		               |					ИНАЧЕ ЛОЖЬ
		               |				КОНЕЦ
		               |		ИНАЧЕ ВЫБОР
		               |				КОГДА РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Регистратор ССЫЛКА Документ.ВедомостьНаВыплатуЗарплатыВБанк
		               |					ТОГДА ВЫБОР
		               |							КОГДА ВЫРАЗИТЬ(РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Регистратор КАК Документ.ВедомостьНаВыплатуЗарплатыВБанк).СпособВыплаты.Наименование = ""Отпуска""
		               |									ИЛИ ВЫРАЗИТЬ(РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Регистратор КАК Документ.ВедомостьНаВыплатуЗарплатыВБанк).СпособВыплаты.Наименование = ""Больничные листы""
		               |								ТОГДА ИСТИНА
		               |							ИНАЧЕ ЛОЖЬ
		               |						КОНЕЦ
		               |				ИНАЧЕ ЛОЖЬ
		               |			КОНЕЦ
		               |	КОНЕЦ
		               |
		               |ИМЕЮЩИЕ
		               |	СУММА(ВЫБОР
		               |			КОГДА РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		               |				ТОГДА ЕСТЬNULL(РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Сумма, 0)
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) > 0
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_ДоГруппировки.РегистрацияВНалоговомОргане,
		               |	СУММА(ВТ_ДоГруппировки.Исчислено) КАК Исчислено,
		               |	СУММА(ВТ_ДоГруппировки.Удержано) КАК Удержано,
		               |	СУММА(ВТ_ДоГруппировки.Перечислено) КАК Перечислено,
		               |	ВТ_ДоГруппировки.ОтпускБольничный,
		               |	ППФ_СоответствиеНалоговогоОрганаШаблону.Шаблон,
		               |	ВТ_ДоГруппировки.РегистрацияВНалоговомОргане.КПП КАК КПП
		               |ИЗ
		               |	ВТ_ДоГруппировки КАК ВТ_ДоГруппировки
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ППФ_СоответствиеНалоговогоОрганаШаблону КАК ППФ_СоответствиеНалоговогоОрганаШаблону
		               |		ПО ВТ_ДоГруппировки.РегистрацияВНалоговомОргане = ППФ_СоответствиеНалоговогоОрганаШаблону.РегистрацииВНалоговомОргане
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВТ_ДоГруппировки.РегистрацияВНалоговомОргане,
		               |	ВТ_ДоГруппировки.ОтпускБольничный,
		               |	ППФ_СоответствиеНалоговогоОрганаШаблону.Шаблон,
		               |	ВТ_ДоГруппировки.РегистрацияВНалоговомОргане.КПП";
		Запрос.УстановитьПараметр("Приход",ВидДвиженияНакопления.Приход);
		Запрос.УстановитьПараметр("Расход",ВидДвиженияНакопления.Расход);
		Запрос.УстановитьПараметр("МесяцНалоговогоПериода",ДатаОкончания);
		РезультатЗапроса = Запрос.Выполнить();
		Если не РезультатЗапроса.Пустой() Тогда 
			
			Таблица = РезультатЗапроса.Выгрузить();
			

			Если НастройкиОтчета.Количество() = 2 И НастройкиОтчета[1].Использование Тогда 
				Таблица = Таблица.Скопировать(Новый Структура("ОтпускБольничный",  НастройкиОтчета[1].ПравоеЗначение));
			ИначеЕсли НастройкиОтчета.Количество()=1 ИЛИ (НастройкиОтчета.Количество() = 2 И Не НастройкиОтчета[1].Использование) Тогда 
				Таблица.Колонки.Удалить("ОтпускБольничный");
				Таблица.Свернуть("РегистрацияВНалоговомОргане,Шаблон, КПП","Исчислено,Удержано,Перечислено"); 				
			КонецЕсли;
			
			Если Таблица.Количество()>0 Тогда 
				
				Макет = РеквизитФормыВЗначение("Отчет").ПолучитьМакет("Макет");
				Шапка = Макет.ПолучитьОбласть("Шапка");
				СтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
				
				ТабличныйДокумент.Вывести(Шапка);
				Для Каждого СтрокаДанных Из Таблица Цикл 
					ЗаполнитьЗначенияСвойств(СтрокаТаблицы.Параметры, СтрокаДанных);
					СтрокаТаблицы.Параметры.ОсталосьПеречислить = СтрокаДанных.Удержано - СтрокаДанных.Перечислено;
					ТабличныйДокумент.Вывести(СтрокаТаблицы);
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьШаблон(Команда)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ПолучитьШаблонНаСервере(ТабличныйДокумент);
	ТабличныйДокумент.Показать();
	
КонецПроцедуры
