/////////////////////////////////////////////////////////////////////////
///////СЕРВИСНЫЕ ПРОЦЕДУРЫ И ФУКНЦИИ

Функция ПолучитьДанныеПечати(МассивОбъектов) Экспорт
	
	Если ТипЗнч(МассивОбъектов)<>Тип("Массив") Тогда 
		Возврат Неопределено;
	КонецЕсли;	
	Если МассивОбъектов.Количество()=0 Тогда 
		Возврат Неопределено;
	КонецЕсли;		
	
	МассивСоответствий = Новый Массив;
	
	ЗапросПоСотруднику = КадровыйУчетБазовый.СформироватьЗапросДляТ5(МассивОбъектов); 
	ДанныеПоСотруднику = ЗапросПоСотруднику.Выгрузить();
	Для Каждого СтрокаДанных Из ДанныеПоСотруднику Цикл 
		
		Сотрудник = СтрокаДанных.Сотрудник;
		// ФИО сотрудника 
		ЗапросФИО = Новый Запрос;
		ЗапросФИО.Текст  ="ВЫБРАТЬ
		|	ФИОФизическихЛицСрезПоследних.Фамилия,
		| ФИОФизическихЛицСрезПоследних.Имя,
		| ФИОФизическихЛицСрезПоследних.Отчество
		|ИЗ
		|	РегистрСведений.ФИОФизическихЛиц.СрезПоследних(&ТекущаяДата, ФизическоеЛицо = &ФизическоеЛицо) КАК ФИОФизическихЛицСрезПоследних";
		ЗапросФИО.УстановитьПараметр("ТекущаяДата",ТекущаяДата());					  
		ЗапросФИО.УстановитьПараметр("ФизическоеЛицо",СтрокаДанных.ФизическоеЛицо);
		ВыбокраФИО = ЗапросФИО.Выполнить().Выбрать();
		ВыбокраФИО.Следующий();
		ФИО = ВыбокраФИО.Фамилия+" "+ВыбокраФИО.Имя+" "+ ВыбокраФИО.Отчество;
		
		// Получим дату приема на работу
		ЗапросПоПриему = Новый Запрос();
		ТекстЗапросаПриема = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	ТекущиеКадровыеДанныеСотрудников.ДатаПриема КАК ДатаПриема
		|ИЗ
		|	РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
		|ГДЕ
		|	ТекущиеКадровыеДанныеСотрудников.Сотрудник = &Сотрудник
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаПриема УБЫВ";
		ЗапросПоПриему.Текст = ТекстЗапросаПриема;
		ЗапросПоПриему.УстановитьПараметр("Сотрудник",Сотрудник);
		ВыборкаПоДате = ЗапросПоПриему.Выполнить().Выбрать();
		Если ВыборкаПоДате.Следующий() Тогда 
			ДатаПриема = ВыборкаПоДате.ДатаПриема;
		Иначе 
			ДатаПриема = "";
		КонецЕсли;
		
		Если ДанныеПоСотруднику.Количество() = 0 Тогда
			Возврат Неопределено;
		КонецЕсли;
		Надбавки = "";
		ДатаДоговора = СтрокаДанных.ДатаДок;
		ДатаНачРаботы = ДатаПриема;	
		ТаблицаПрошлоеПодразделение = ОпределитьПодразделение(СтрокаДанных.Подразделение);
		ТаблицаПрошлаяДолжность 	= ОпределитьДолжность(СтрокаДанных.Должность);
		ТаблицаНовоеПодразделение 	= ОпределитьПодразделение(СтрокаДанных.НовоеПодразделение);
		ТаблицаНоваяДолжность 		= ОпределитьДолжность(СтрокаДанных.НоваяДолжность);
		
		// Параметр ДолжностьПодразделение
		ДолжностьПрошлая = "";
		Для Каждого СтрокаДолжности Из ТаблицаПрошлаяДолжность Цикл 
			Если СтрокаДолжности.Свойство.Заголовок = "Родительный падеж" Тогда 
				ДолжностьПрошлая = СокрЛП(СтрокаДолжности.Значение);
			КонецЕсли;
		КонецЦикла;
		ПодразделниеПрошлое = "";
		Для Каждого СтрокаПодразделения Из ТаблицаПрошлоеПодразделение Цикл 
			Если СтрокаПодразделения.Свойство.Заголовок = "Родительный падеж" Тогда 
				ПодразделниеПрошлое = ПодразделниеПрошлое + СокрЛП(СтрокаПодразделения.Значение) + " ";
			КонецЕсли;
		КонецЦикла;
		ДолжностьПодразделение = СокрЛП(ДолжностьПрошлая + " " + ПодразделниеПрошлое);
		// Параметр Должность		
		Должность = "";
		Для Каждого СтрокаДолжности Из ТаблицаНоваяДолжность Цикл 
			Если СтрокаДолжности.Свойство.Заголовок = "Родительный падеж" Тогда 
				Должность=СокрЛП(СтрокаДолжности.Значение);
			КонецЕсли;
		КонецЦикла;
		// Параметр Подразделение
		Подразделение = "";
		Для Каждого СтрокаПодразделения Из ТаблицаНовоеПодразделение Цикл 
			Если СтрокаПодразделения.УровеньВложенности = "1" Тогда 
				Если СтрокаПодразделения.Свойство.Заголовок = "Винительный падеж" Тогда 
					Подразделение=Подразделение + СокрЛП(СтрокаПодразделения.Значение) + " ";
				КонецЕсли;
			Иначе 
				Если СтрокаПодразделения.Свойство.Заголовок = "Родительный падеж" Тогда 
					Подразделение=Подразделение + СокрЛП(СтрокаПодразделения.Значение) + " ";
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		ЗапросПоИОФ = Новый Запрос();
		ЗапросПоИОФ.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПОДСТРОКА(ФИОФизическихЛиц.Имя, 1, 1) + "". "" + ПОДСТРОКА(ФИОФизическихЛиц.Отчество, 1, 1) + "". "" + ФИОФизическихЛиц.Фамилия КАК ИОФ
		|ИЗ
		|	РегистрСведений.ФИОФизическихЛиц КАК ФИОФизическихЛиц
		|ГДЕ
		|	ФИОФизическихЛиц.ФизическоеЛицо = &ФизическоеЛицо
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФИОФизическихЛиц.Период УБЫВ";
		
		ЗапросПоИОФ.УстановитьПараметр("ФизическоеЛицо",Сотрудник.ФизическоеЛицо);					
		ВыборкаПоИОФ = ЗапросПоИОФ.Выполнить().Выбрать();
		
		СоответствиеПараметров = Новый Структура;
		Если ВыборкаПоИОФ.Следующий() Тогда 
			ДобавитьПараметр(СоответствиеПараметров, "ИОФ", ВыборкаПоИОФ.ИОФ);
		КонецЕсли;
		ДобавитьПараметр(СоответствиеПараметров, "ДатаТД", 					Формат(ДатаНачРаботы, "ДЛФ=ДД"));
		ДобавитьПараметр(СоответствиеПараметров, "НомерТД", 				СтрокаДанных.НомерДок);
		ДобавитьПараметр(СоответствиеПараметров, "ФИО", 					ПросклонятьФИО(СокрЛП(ФИО), 2, СтрокаДанных.НовыйПол));		
		ДобавитьПараметр(СоответствиеПараметров, "ДолжностьПодразделение",	ДолжностьПодразделение);
		ДобавитьПараметр(СоответствиеПараметров, "Подразделение", 			Подразделение);			
		ДобавитьПараметр(СоответствиеПараметров, "Должность", 				Должность);	
		ДобавитьПараметр(СоответствиеПараметров, "Сумма", 					СтрокаДанных.ТарифнаяСтавка);
		ДобавитьПараметр(СоответствиеПараметров, "ДатаСДопСогл", 			Формат(СтрокаДанных.ДатаНачала, "ДЛФ=ДД"));
		ДобавитьПараметр(СоответствиеПараметров, "ДатаДопСогл", 			Формат(СтрокаДанных.ДатаДок, "ДЛФ=ДД"));	
		
		МассивСоответствий.Добавить(СоответствиеПараметров);
		
	КонецЦикла;
	Возврат МассивСоответствий;
	
	
КонецФункции

Функция ПросклонятьФИО(Знач ИсходнаяСтрока,Падеж,Пол) 
	
	Результат = "";
	ИсходнаяСтрока = СокрЛП(ИсходнаяСтрока);
	Если СтрДлина(ИсходнаяСтрока) = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	СловоВПадеже = "";
	ФизическиеЛицаЗарплатаКадры.Просклонять(ИсходнаяСтрока,Падеж, СловоВПадеже,Пол);	
	Результат = СокрЛП(Результат + СловоВПадеже);
	
	Возврат Результат;
	
КонецФункции // ПросклонятьФразуПоСловам()

Функция ПолучитьСвойства(Объект, Родитель)
	
	ОписаниеСвойств = Новый ТаблицаЗначений;
	
	Свойства_НаборыДополнительныхРеквизитовОбъекта = Новый СписокЗначений;
	КлючНазначения = Неопределено;
	НаборыСвойствОбъекта = УправлениеСвойствамиСлужебный.ПолучитьНаборыСвойствОбъекта(
	Объект, КлючНазначения);
	
	Для каждого Строка Из НаборыСвойствОбъекта Цикл
		Если УправлениеСвойствамиСлужебный.ВидыСвойствНабора(Строка.Набор).ДополнительныеРеквизиты Тогда
			
			Свойства_НаборыДополнительныхРеквизитовОбъекта.Добавить(
			Строка.Набор, Строка.Заголовок);
		КонецЕсли;
	КонецЦикла;
	
	ОписаниеСвойств = УправлениеСвойствамиСлужебный.ПолучитьТаблицуЗначенийСвойств(
	Объект.ДополнительныеРеквизиты.Выгрузить(),
	Свойства_НаборыДополнительныхРеквизитовОбъекта,
	Ложь);
	
	Возврат ОписаниеСвойств;
	
КонецФункции

Функция ОпределитьПодразделение(Подразделение)
	
	ЗапросПоПодразделениям = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	|	ДополнительныеСведения.Объект КАК Объект,
	|	ДополнительныеСведения.Свойство КАК Свойство,
	|	ДополнительныеСведения.Значение КАК Значение,
	|	""1"" КАК УровеньВложенности
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|ГДЕ
	|	ДополнительныеСведения.Объект = &Ссылка
	|ОБЪЕДИНИТЬ ВСЕ                             	
	|ВЫБРАТЬ
	|	ДополнительныеСведения.Объект,
	|	ДополнительныеСведения.Свойство,
	|	ДополнительныеСведения.Значение,
	|	""2""
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|ГДЕ
	|	ДополнительныеСведения.Объект = &СсылкаРодитель
	
	|ОБЪЕДИНИТЬ ВСЕ
	
	|ВЫБРАТЬ
	|	ДополнительныеСведения.Объект,
	|	ДополнительныеСведения.Свойство,
	|	ДополнительныеСведения.Значение,
	|	""3""
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|ГДЕ
	|	ДополнительныеСведения.Объект = &СсылкаРодительРодитель";
	ЗапросПоПодразделениям.Текст = ТекстЗапроса;
	ЗапросПоПодразделениям.УстановитьПараметр("Ссылка",Подразделение);
	ЗапросПоПодразделениям.УстановитьПараметр("СсылкаРодитель",Подразделение.Родитель);
	ЗапросПоПодразделениям.УстановитьПараметр("СсылкаРодительРодитель",Подразделение.Родитель.Родитель);
	
	ВыгрузкаПодразделений = ЗапросПоПодразделениям.Выполнить().Выгрузить();
			
	Возврат ВыгрузкаПодразделений;
	
КонецФункции

Функция ОпределитьДолжность(Должность)
	
	ЗапросПоДолжностям = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ДополнительныеСведения.Объект,
	               |	ДополнительныеСведения.Свойство КАК Свойство,
	               |	ДополнительныеСведения.Значение КАК Значение
	               |ИЗ
	               |	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	               |ГДЕ
	               |	ДополнительныеСведения.Объект = &Объект";
	ЗапросПоДолжностям.Текст = ТекстЗапроса;
	ЗапросПоДолжностям.УстановитьПараметр("Объект", Должность);
	
	ВыгрузкаДолжностей = ЗапросПоДолжностям.Выполнить().Выгрузить();
		
	Возврат ВыгрузкаДолжностей;	

	
КонецФункции

Процедура ДобавитьПараметр(Структура, ИсходнаяСтрока, СтрокаЗамены)
	 Структура.Вставить(ИсходнаяСтрока,СтрокаЗамены);
КонецПроцедуры

/////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

#Область ПрограммныйИнтерфейс

// Возвращает сведения о внешней обработке.
Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.2.2.1");
	
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиПечатнаяФорма();
	ПараметрыРегистрации.Назначение.Добавить("Документ.КадровыйПереводСписком");
	ПараметрыРегистрации.Версия = "1.3";
	ПараметрыРегистрации.БезопасныйРежим = Ложь;
	
	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	НоваяКоманда.Представление = НСтр("ru = 'ППФ Заявление на перевод к Т5 списком'");
	НоваяКоманда.Идентификатор = "ЗаявлениеНаПереводК_Т5";
	НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовКлиентскогоМетода();
	НоваяКоманда.ПоказыватьОповещение = Истина;
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

#КонецОбласти
