
&НаСервере
Процедура СформироватьНаСервере()
	
	Если ЭтаФорма.ФлажокКомпания Тогда
		Режим = "1";                // Вся организация
	ИначеЕсли ЭтаФорма.ФлажокАгентства Тогда
		Режим = "2";	            // Агентства
	ИначеЕсли ЭтаФорма.ФлажокМосква Тогда
		Режим = "3";                // Москва
	ИначеЕсли ЭтаФорма.ФлажокПодразделение Тогда
		Режим = "4";                // Подразделение
	КонецЕсли;
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	
	//+	
	ВидДняНачало = "";
	ОтчетОбъект.РегламентированныйКалендарНачало(ВидДняНачало);
	
	Если ВидДняНачало = Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий Тогда
		РабочийДеньНачало	= НачалоМесяца(Отчет.МесяцПериод);	
	ИначеЕсли ВидДняНачало = Перечисления.ВидыДнейПроизводственногоКалендаря.Предпраздничный Тогда
		РабочийДеньНачало	= НачалоМесяца(Отчет.МесяцПериод);
	Иначе
		//месяц с праздника или выходного
		РабочийДень	= "";
		ДатаС			= НачалоМесяца(Отчет.МесяцПериод);
		ДатаПо			= НачалоМесяца(Отчет.МесяцПериод);
		ОтчетОбъект.РабочийПередВыходнымНачало(РабочийДень, ДатаС, ДатаПо);
		Если РабочийДень = "" Тогда
			ДатаС		= НачалоМесяца(НачалоМесяца(Отчет.МесяцПериод)-1);	
			ОтчетОбъект.РабочийПередВыходнымНачало(РабочийДень, ДатаС, ДатаПо);
		КонецЕсли;	
		РабочийДеньНачало	= РабочийДень;
	КонецЕсли;
	
	СЗПодразделенияАгентства	= Новый СписокЗначений;
	
	Если Режим = "1" Тогда
		
	ИначеЕсли Режим = "2" Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗначенияСвойствОбъектов.Ссылка,
		|	ЗначенияСвойствОбъектов.Наименование
		|ИЗ
		|	Справочник.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|ГДЕ
		|	ЗначенияСвойствОбъектов.Наименование = &Наименование
		|	И ЗначенияСвойствОбъектов.Владелец = &Владелец";
		Запрос.УстановитьПараметр("Наименование", Отчет.Подразделение.Наименование);
		Запрос.УстановитьПараметр("Владелец",ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Местонахождение (Подразделения)"));
		Результат	= Запрос.Выполнить();
		Выборка		= Результат.Выбрать();
		Пока Выборка.Следующий() Цикл	
			СпрЗначСвОбъекта = Выборка.Ссылка;
		КонецЦикла;
		
		//Узнаем свойство местонахождения у текущего подразделения
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДополнительныеСведения.Объект,
		|	ДополнительныеСведения.Свойство,
		|	ДополнительныеСведения.Значение
		|ИЗ
		|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|ГДЕ
		|	ДополнительныеСведения.Свойство = &Свойство
		|	И ДополнительныеСведения.Значение = &Значение";
		Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Местонахождение"));
		Запрос.УстановитьПараметр("Значение", СпрЗначСвОбъекта);
		Результат	= Запрос.Выполнить();
		Выборка		= Результат.Выбрать();
		ДопПодр = новый СписокЗначений;	
		Пока Выборка.Следующий() Цикл	
			ДопПодр.Добавить(Выборка.Объект);	
		КонецЦикла;
				
	ИначеЕсли Режим = "3" Тогда
		
		ОтчетОбъект.ПодразделенияАгентства(СЗПодразделенияАгентства); // г. Москва	
		
		ДопПодразделения	= Новый СписокЗначений;
		ДопПодразделения	= СЗПодразделенияАгентства;
		
	ИначеЕсли Режим = "4" Тогда	
	КонецЕсли;	
	
	Если Режим = "2" Тогда
		Лог = Лог + "Подразделения: " + ДопПодр + Символы.ВК;
		//Сообщить("Подразделения: " + ДопПодр);
	ИначеЕсли Режим = "3" Тогда
		Лог = Лог + "Подразделения: " + ДопПодразделения + Символы.ВК;
		//Сообщить("Подразделения: " + ДопПодразделения);
	ИначеЕсли Режим = "4" Тогда
		Лог = Лог + "Подразделения: " + Отчет.Подразделение + Символы.ВК;
		//Сообщить("Подразделения: " + Отчет.Подразделение);
	ИначеЕсли Режим = "1" Тогда
		Лог = Лог + "Вся организация" + Символы.ВК;
		//Сообщить("Вся организация");
	КонецЕсли;			
		
	СчДней1 	= 0;
	СчДней2 	= 0;
	СчДней3 	= 0;
	СчДней4 	= 0;
	СчДней5 	= 0;	
	СчДней6 	= 0;	
	СчДней7 	= 0;	
	СчДней8 	= 0;	
	СчДней9 	= 0;
	СчДней10 	= 0;	
	СчДней11 	= 0;	
	СчДней12 	= 0;	
	СчДней13 	= 0;	
	СчДней14 	= 0;	
	СчДней15 	= 0;	
	СчДней16 	= 0;	
	СчДней17 	= 0;	
	СчДней18 	= 0;	
	СчДней19 	= 0;	
	СчДней20 	= 0;
	СчДней21 	= 0;
	СчДней22 	= 0;
	СчДней23 	= 0;
	СчДней24 	= 0;
	СчДней25 	= 0;	
	СчДней26 	= 0;	
	СчДней27 	= 0;	
	СчДней28 	= 0;	
	СчДней29 	= 0;
	СчДней30 	= 0;	
	СчДней31 	= 0;
	
	ДекретИтог	= 0;
	
	Декрет1		= 0;	
	Декрет2		= 0;
	Декрет3		= 0;
	Декрет4		= 0;
	Декрет5		= 0;
	Декрет6		= 0;
	Декрет7		= 0;
	Декрет8		= 0;
	Декрет9		= 0;
	Декрет10	= 0;
	Декрет11	= 0;
	Декрет12	= 0;
	Декрет13	= 0;
	Декрет14	= 0;
	Декрет15	= 0;
	Декрет16	= 0;
	Декрет17	= 0;
	Декрет18	= 0;
	Декрет19	= 0;
	Декрет20	= 0;
	Декрет21	= 0;
	Декрет22	= 0;
	Декрет23	= 0;
	Декрет24	= 0;
	Декрет25	= 0;
	Декрет26	= 0;
	Декрет27	= 0;
	Декрет28	= 0;
	Декрет29	= 0;
	Декрет30	= 0;
	Декрет31	= 0;
	
	Совм1		= 0;
	Совм2		= 0;	
	Совм3		= 0;
	Совм4		= 0;
	Совм5		= 0;
	Совм6		= 0;
	Совм7		= 0;
	Совм8		= 0;
	Совм9		= 0;
	Совм10		= 0;
	Совм11		= 0;
	Совм12		= 0;
	Совм13		= 0;
	Совм14		= 0;
	Совм15		= 0;
	Совм16		= 0;
	Совм17		= 0;
	Совм18		= 0;
	Совм19		= 0;
	Совм20		= 0;
	Совм21		= 0;
	Совм22		= 0;
	Совм23		= 0;
	Совм24		= 0;
	Совм25		= 0;
	Совм26		= 0;
	Совм27		= 0;
	Совм28		= 0;
	Совм29		= 0;
	Совм30		= 0;
	Совм31		= 0;
	
	СовмИтог	= 0;
	
	ГПХ1		= 0;
	ГПХ2		= 0;	
	ГПХ3		= 0;
	ГПХ4		= 0;
	ГПХ5		= 0;
	ГПХ6		= 0;
	ГПХ7		= 0;
	ГПХ8		= 0;
	ГПХ9		= 0;
	ГПХ10		= 0;
	ГПХ11		= 0;
	ГПХ12		= 0;
	ГПХ13		= 0;
	ГПХ14		= 0;
	ГПХ15		= 0;
	ГПХ16		= 0;
	ГПХ17		= 0;
	ГПХ18		= 0;
	ГПХ19		= 0;
	ГПХ20		= 0;
	ГПХ21		= 0;
	ГПХ22		= 0;
	ГПХ23		= 0;
	ГПХ24		= 0;
	ГПХ25		= 0;
	ГПХ26		= 0;
	ГПХ27		= 0;
	ГПХ28		= 0;
	ГПХ29		= 0;
	ГПХ30		= 0;
	ГПХ31		= 0;
	
	ГПХИтог		= 0;
	
	// определяем дни месяца
	ТЗДниМесяца = новый ТаблицаЗначений;
	ТЗДниМесяца.Колонки.Добавить("ДатаКалендаря");
	ТЗДниМесяца.Колонки.Добавить("ВидДня");
	ТЗДниМесяца.Колонки.Добавить("ДеньНедели");
	ОтчетОбъект.СписокДнейВМесяце(ТЗДниМесяца);
	
	ГПХ_ДВОУ = Новый СписокЗначений;
	ОтчетОбъект.СотрудникикГПХ(ГПХ_ДВОУ);
	
	ТабДок	= ЭтаФорма.ПолеТабличногоДокумента;
	
	Макет	= ОтчетОбъект.ПолучитьМакет("Макет");
	
	ОбластьШапка	= Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока	= Макет.ПолучитьОбласть("Строка");
	ОбластьПодвал	= Макет.ПолучитьОбласть("Подвал");
	
	ТабДок.Очистить();
	Если Отчет.Подразделение = Справочники.ПодразделенияОрганизаций.ПустаяСсылка() Тогда
		ОбластьШапка.Параметры.Шапка			= "Расчет среднесписочной численности работников за период с " + Формат(НачалоМесяца(Отчет.МесяцПериод), "ДФ=""dd.MM.yyyy""") + " по " + Формат(КонецМесяца(Отчет.МесяцПериод), "ДФ=""dd.MM.yyyy""");
		ОбластьШапка.Параметры.Подразделение	= "";
	Иначе
		ОбластьШапка.Параметры.Шапка			= "Расчет среднесписочной численности работников за период с " + Формат(НачалоМесяца(Отчет.МесяцПериод), "ДФ=""dd.MM.yyyy""") + " по " + Формат(КонецМесяца(Отчет.МесяцПериод), "ДФ=""dd.MM.yyyy""");
		ОбластьШапка.Параметры.Подразделение	= Отчет.Подразделение;	
	КонецЕсли;
	ТабДок.Вывести(ОбластьШапка);
	
	Элементы.ПолеТабличногоДокумента1.ОтображениеСостояния.Видимость = Ложь;
	Элементы.ПолеТабличногоДокумента1.ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.НеИспользовать;
	
	А=7;
	СчПП		= 0;
	СчИтогОбщий = 0;
	
	списокСотр = новый СписокЗначений;
	
	Для Каждого День ИЗ ТЗДниМесяца Цикл 	
		
		ДатаКалендаря	= День.ДатаКалендаря;
		ДеньНедели		= День.ДеньНедели;
		ОтчетОбъект.НовыйРасчетРаботников(Режим, ДатаКалендаря, ДеньНедели, ДопПодразделения, СЗПодразделенияАгентства, СчДней1, СчДней2, СчДней3, СчДней4, СчДней5, СчДней6, СчДней7, СчДней8, СчДней9, СчДней10,
		СчДней11, СчДней12, СчДней13, СчДней14, СчДней15, СчДней16, СчДней17, СчДней18, СчДней19, СчДней20, СчДней21, СчДней22, СчДней23, СчДней24, СчДней25, СчДней26,
		СчДней27, СчДней28, СчДней29, СчДней30, СчДней31, ВидДняНачало, РабочийДеньНачало, ДопПодр, ЭтаФорма);
	
		ОтчетОбъект.НовыйРасчетСовместители(Режим, ДатаКалендаря, ДеньНедели, ДопПодразделения, СЗПодразделенияАгентства, Совм1, Совм2, Совм3, Совм4, Совм5, Совм6, Совм7, Совм8, Совм9, Совм10,
		Совм11, Совм12, Совм13, Совм14, Совм15, Совм16, Совм17, Совм18, Совм19, Совм20, Совм21, Совм22, Совм23, Совм24, Совм25, Совм26,
		Совм27, Совм28, Совм29, Совм30, Совм31, ВидДняНачало, РабочийДеньНачало, ДопПодр, ЭтаФорма);
		
		ОтчетОбъект.Декрет(Режим, ДатаКалендаря, ДеньНедели, ДопПодразделения, СЗПодразделенияАгентства, Декрет1, Декрет2, Декрет3, Декрет4, Декрет5, Декрет6, Декрет7, Декрет8, Декрет9, Декрет10,
		Декрет11, Декрет12, Декрет13, Декрет14, Декрет15, Декрет16, Декрет17, Декрет18, Декрет19, Декрет20, Декрет21, Декрет22, Декрет23, Декрет24, Декрет25, Декрет26,
		Декрет27, Декрет28, Декрет29, Декрет30, Декрет31, ВидДняНачало, РабочийДеньНачало, ДопПодр);
		
		ОтчетОбъект.ГПХ(Режим, ДатаКалендаря, ДеньНедели, ДопПодразделения, СЗПодразделенияАгентства, ГПХ_ДВОУ, ГПХ1, ГПХ2, ГПХ3, ГПХ4, ГПХ5, ГПХ6, ГПХ7, ГПХ8, ГПХ9, ГПХ10,
		ГПХ11, ГПХ12, ГПХ13, ГПХ14, ГПХ15, ГПХ16, ГПХ17, ГПХ18, ГПХ19, ГПХ20, ГПХ21, ГПХ22, ГПХ23, ГПХ24, ГПХ25, ГПХ26,
		ГПХ27, ГПХ28, ГПХ29, ГПХ30, ГПХ31, ВидДняНачало, РабочийДеньНачало, ДопПодр);
		
		СчПП		= СчПП + 1;
		
		//+ БИТ Пестов А.С. 22.07.2014 +		
		//Дни недели
		Если ДеньНедели(День.ДатаКалендаря) = 1 Тогда		
			ОбластьСтрока.Параметры.Дата	= Строка(Формат(День.ДатаКалендаря, "ДФ=""dd.MM.yyyy""")) + " (понедельник)";
		ИначеЕсли ДеньНедели(День.ДатаКалендаря) = 2 Тогда
			ОбластьСтрока.Параметры.Дата	= Строка(Формат(День.ДатаКалендаря, "ДФ=""dd.MM.yyyy""")) + " (вторник)";
		ИначеЕсли ДеньНедели(День.ДатаКалендаря) = 3 Тогда
			ОбластьСтрока.Параметры.Дата	= Строка(Формат(День.ДатаКалендаря, "ДФ=""dd.MM.yyyy""")) + " (среда)";
		ИначеЕсли ДеньНедели(День.ДатаКалендаря) = 4 Тогда
			ОбластьСтрока.Параметры.Дата	= Строка(Формат(День.ДатаКалендаря, "ДФ=""dd.MM.yyyy""")) + " (четверг)";
		ИначеЕсли ДеньНедели(День.ДатаКалендаря) = 5 Тогда
			ОбластьСтрока.Параметры.Дата	= Строка(Формат(День.ДатаКалендаря, "ДФ=""dd.MM.yyyy""")) + " (пятница)";
		ИначеЕсли ДеньНедели(День.ДатаКалендаря) = 6 Тогда
			ОбластьСтрока.Параметры.Дата	= Строка(Формат(День.ДатаКалендаря, "ДФ=""dd.MM.yyyy""")) + " (суббота)";
		ИначеЕсли ДеньНедели(День.ДатаКалендаря) = 7 Тогда
			ОбластьСтрока.Параметры.Дата	= Строка(Формат(День.ДатаКалендаря, "ДФ=""dd.MM.yyyy""")) + " (воскресенье)";			
		КонецЕсли;	
		//- БИТ Пестов А.С. 22.07.2014 -	
		
		X = День(День.ДатаКалендаря);
		
		Если X = 1 Тогда
			ОбластьСтрока.Параметры.СчДней	= СчДней1;		 
			ОбластьСтрока.Параметры.Декрет	= Декрет1; 			
			ОбластьСтрока.Параметры.Средняя	= СчДней1 - Декрет1; 			
			ОбластьСтрока.Параметры.ВнешСовм	= Совм1; 			
			ОбластьСтрока.Параметры.ГПХ		= ГПХ1; 			
			СчИтогОбщий	= СчИтогОбщий + СчДней1;	
		ИначеЕсли X = 2 Тогда	       
			ОбластьСтрока.Параметры.СчДней	= СчДней2;
			ОбластьСтрока.Параметры.Декрет	= Декрет2; 			
			ОбластьСтрока.Параметры.Средняя	= СчДней2 - Декрет2; 			
			ОбластьСтрока.Параметры.ВнешСовм	= Совм2; 			
			ОбластьСтрока.Параметры.ГПХ		= ГПХ2; 			
			СчИтогОбщий	= СчИтогОбщий + СчДней2;	
		ИначеЕсли X = 3 Тогда	
			ОбластьСтрока.Параметры.СчДней	= СчДней3;
			ОбластьСтрока.Параметры.Декрет	= Декрет3; 			
			ОбластьСтрока.Параметры.Средняя	= СчДней3 - Декрет3; 			
			ОбластьСтрока.Параметры.ВнешСовм	= Совм3; 			
			ОбластьСтрока.Параметры.ГПХ		= ГПХ3; 			
			СчИтогОбщий	= СчИтогОбщий + СчДней3;	
		ИначеЕсли X = 4 Тогда	
			ОбластьСтрока.Параметры.СчДней	= СчДней4;
			ОбластьСтрока.Параметры.Декрет	= Декрет4; 			
			ОбластьСтрока.Параметры.Средняя	= СчДней4 - Декрет4; 			
			ОбластьСтрока.Параметры.ВнешСовм	= Совм4; 			
			ОбластьСтрока.Параметры.ГПХ		= ГПХ4; 			
			СчИтогОбщий	= СчИтогОбщий + СчДней4;	
		ИначеЕсли X = 5 Тогда	
			ОбластьСтрока.Параметры.СчДней	= СчДней5;
			ОбластьСтрока.Параметры.Декрет	= Декрет5; 			
			ОбластьСтрока.Параметры.Средняя	= СчДней5 - Декрет5; 			
			ОбластьСтрока.Параметры.ВнешСовм	= Совм5; 			
			ОбластьСтрока.Параметры.ГПХ		= ГПХ5; 			
			СчИтогОбщий	= СчИтогОбщий + СчДней5;	
		ИначеЕсли X = 6 Тогда	
			ОбластьСтрока.Параметры.СчДней	= СчДней6;
			ОбластьСтрока.Параметры.Декрет	= Декрет6; 			
			ОбластьСтрока.Параметры.Средняя	= СчДней6 - Декрет6; 			
			ОбластьСтрока.Параметры.ВнешСовм	= Совм6; 			
			ОбластьСтрока.Параметры.ГПХ		= ГПХ6; 			
			СчИтогОбщий	= СчИтогОбщий + СчДней6;	
		ИначеЕсли X = 7 Тогда	
			ОбластьСтрока.Параметры.СчДней	= СчДней7;
			ОбластьСтрока.Параметры.Декрет	= Декрет7; 			
			ОбластьСтрока.Параметры.Средняя	= СчДней7 - Декрет7; 			
			ОбластьСтрока.Параметры.ВнешСовм	= Совм7; 			
			ОбластьСтрока.Параметры.ГПХ		= ГПХ7; 			
			СчИтогОбщий	= СчИтогОбщий + СчДней7;	
		ИначеЕсли X = 8 Тогда	
			ОбластьСтрока.Параметры.СчДней	= СчДней8;
			ОбластьСтрока.Параметры.Декрет	= Декрет8; 			
			ОбластьСтрока.Параметры.Средняя	= СчДней8 - Декрет8; 			
			ОбластьСтрока.Параметры.ВнешСовм	= Совм8; 			
			ОбластьСтрока.Параметры.ГПХ		= ГПХ8; 			
			СчИтогОбщий	= СчИтогОбщий + СчДней8;	
		ИначеЕсли X = 9 Тогда	                    
			ОбластьСтрока.Параметры.СчДней	= СчДней9;
			ОбластьСтрока.Параметры.Декрет	= Декрет9; 			
			ОбластьСтрока.Параметры.Средняя	= СчДней9 - Декрет9; 			
			ОбластьСтрока.Параметры.ВнешСовм	= Совм9; 			
			ОбластьСтрока.Параметры.ГПХ		= ГПХ9; 			
			СчИтогОбщий	= СчИтогОбщий + СчДней9;	
		ИначеЕсли X = 10 Тогда	
			ОбластьСтрока.Параметры.СчДней	= СчДней10;
			ОбластьСтрока.Параметры.Декрет	= Декрет10; 			
			ОбластьСтрока.Параметры.Средняя	= СчДней10 - Декрет10; 			
			ОбластьСтрока.Параметры.ВнешСовм	= Совм10; 			
			ОбластьСтрока.Параметры.ГПХ		= ГПХ10; 			
			СчИтогОбщий	= СчИтогОбщий + СчДней10;	
		ИначеЕсли X = 11 Тогда	
			ОбластьСтрока.Параметры.СчДней	= СчДней11;
			ОбластьСтрока.Параметры.Декрет	= Декрет11; 			
			ОбластьСтрока.Параметры.Средняя	= СчДней11 - Декрет11; 			
			ОбластьСтрока.Параметры.ВнешСовм	= Совм11; 			
			ОбластьСтрока.Параметры.ГПХ		= ГПХ11; 			
			СчИтогОбщий	= СчИтогОбщий + СчДней11;	
		ИначеЕсли X = 12 Тогда	
			ОбластьСтрока.Параметры.СчДней	= СчДней12; 
			ОбластьСтрока.Параметры.Декрет	= Декрет12; 			
			ОбластьСтрока.Параметры.Средняя	= СчДней12 - Декрет12; 			
			ОбластьСтрока.Параметры.ВнешСовм	= Совм12; 			
			ОбластьСтрока.Параметры.ГПХ		= ГПХ12; 			
			СчИтогОбщий	= СчИтогОбщий + СчДней12;	
		ИначеЕсли X = 13 Тогда	
			ОбластьСтрока.Параметры.СчДней	= СчДней13; 
			ОбластьСтрока.Параметры.Декрет	= Декрет13; 			
			ОбластьСтрока.Параметры.Средняя	= СчДней13 - Декрет13; 			
			ОбластьСтрока.Параметры.ВнешСовм	= Совм13; 			
			ОбластьСтрока.Параметры.ГПХ		= ГПХ13; 			
			СчИтогОбщий	= СчИтогОбщий + СчДней13;	
		ИначеЕсли X = 14 Тогда	
			ОбластьСтрока.Параметры.СчДней	= СчДней14; 
			ОбластьСтрока.Параметры.Декрет	= Декрет14; 			
			ОбластьСтрока.Параметры.Средняя	= СчДней14 - Декрет14; 			
			ОбластьСтрока.Параметры.ВнешСовм	= Совм14; 			
			ОбластьСтрока.Параметры.ГПХ		= ГПХ14; 			
			СчИтогОбщий	= СчИтогОбщий + СчДней14;	
		ИначеЕсли X = 15 Тогда	
			ОбластьСтрока.Параметры.СчДней	= СчДней15; 
			ОбластьСтрока.Параметры.Декрет	= Декрет15; 			
			ОбластьСтрока.Параметры.Средняя	= СчДней15 - Декрет15; 			
			ОбластьСтрока.Параметры.ВнешСовм	= Совм15; 			
			ОбластьСтрока.Параметры.ГПХ		= ГПХ15; 			
			СчИтогОбщий	= СчИтогОбщий + СчДней15;	
		ИначеЕсли X = 16 Тогда	
			ОбластьСтрока.Параметры.СчДней	= СчДней16; 
			ОбластьСтрока.Параметры.Декрет	= Декрет16; 			
			ОбластьСтрока.Параметры.Средняя	= СчДней16 - Декрет16; 			
			ОбластьСтрока.Параметры.ВнешСовм	= Совм16; 			
			ОбластьСтрока.Параметры.ГПХ		= ГПХ15; 			
			СчИтогОбщий	= СчИтогОбщий + СчДней16;	
		ИначеЕсли X = 17 Тогда	
			ОбластьСтрока.Параметры.СчДней	= СчДней17; 
			ОбластьСтрока.Параметры.Декрет	= Декрет17; 			
			ОбластьСтрока.Параметры.Средняя	= СчДней17 - Декрет17; 			
			ОбластьСтрока.Параметры.ВнешСовм	= Совм17; 			
			ОбластьСтрока.Параметры.ГПХ		= ГПХ16; 			
			СчИтогОбщий	= СчИтогОбщий + СчДней17;	
		ИначеЕсли X = 18 Тогда	
			ОбластьСтрока.Параметры.СчДней	= СчДней18; 
			ОбластьСтрока.Параметры.Декрет	= Декрет18; 			
			ОбластьСтрока.Параметры.Средняя	= СчДней18 - Декрет18; 			
			ОбластьСтрока.Параметры.ВнешСовм	= Совм18; 			
			ОбластьСтрока.Параметры.ГПХ		= ГПХ18; 			
			СчИтогОбщий	= СчИтогОбщий + СчДней18;	
		ИначеЕсли X = 19 Тогда	
			ОбластьСтрока.Параметры.СчДней	= СчДней19; 
			ОбластьСтрока.Параметры.Декрет	= Декрет19; 			
			ОбластьСтрока.Параметры.Средняя	= СчДней19 - Декрет19; 			
			ОбластьСтрока.Параметры.ВнешСовм	= Совм19; 			
			ОбластьСтрока.Параметры.ГПХ		= ГПХ19; 			
			СчИтогОбщий	= СчИтогОбщий + СчДней19;	
		ИначеЕсли X = 20 Тогда	
			ОбластьСтрока.Параметры.СчДней	= СчДней20; 
			ОбластьСтрока.Параметры.Декрет	= Декрет20; 			
			ОбластьСтрока.Параметры.Средняя	= СчДней20 - Декрет20; 			
			ОбластьСтрока.Параметры.ВнешСовм	= Совм20; 			
			ОбластьСтрока.Параметры.ГПХ		= ГПХ20; 			
			СчИтогОбщий	= СчИтогОбщий + СчДней20;	
		ИначеЕсли X = 21 Тогда	
			ОбластьСтрока.Параметры.СчДней	= СчДней21; 
			ОбластьСтрока.Параметры.Декрет	= Декрет21; 			
			ОбластьСтрока.Параметры.Средняя	= СчДней21 - Декрет21; 			
			ОбластьСтрока.Параметры.ВнешСовм	= Совм21; 			
			ОбластьСтрока.Параметры.ГПХ		= ГПХ21; 			
			СчИтогОбщий	= СчИтогОбщий + СчДней21;	
		ИначеЕсли X = 22 Тогда	
			ОбластьСтрока.Параметры.СчДней	= СчДней22; 
			ОбластьСтрока.Параметры.Декрет	= Декрет22; 			
			ОбластьСтрока.Параметры.Средняя	= СчДней22 - Декрет22; 			
			ОбластьСтрока.Параметры.ВнешСовм	= Совм22; 			
			ОбластьСтрока.Параметры.ГПХ		= ГПХ22; 			
			СчИтогОбщий	= СчИтогОбщий + СчДней22;	
		ИначеЕсли X = 23 Тогда	
			ОбластьСтрока.Параметры.СчДней	= СчДней23; 
			ОбластьСтрока.Параметры.Декрет	= Декрет23; 			
			ОбластьСтрока.Параметры.Средняя	= СчДней23 - Декрет23; 			
			ОбластьСтрока.Параметры.ВнешСовм	= Совм23; 			
			ОбластьСтрока.Параметры.ГПХ		= ГПХ23; 			
			СчИтогОбщий	= СчИтогОбщий + СчДней23;	
		ИначеЕсли X = 24 Тогда	
			ОбластьСтрока.Параметры.СчДней	= СчДней24; 
			ОбластьСтрока.Параметры.Декрет	= Декрет24; 			
			ОбластьСтрока.Параметры.Средняя	= СчДней24 - Декрет24; 			
			ОбластьСтрока.Параметры.ВнешСовм	= Совм24; 			
			ОбластьСтрока.Параметры.ГПХ		= ГПХ24; 			
			СчИтогОбщий	= СчИтогОбщий + СчДней24;	
		ИначеЕсли X = 25 Тогда	
			ОбластьСтрока.Параметры.СчДней	= СчДней25; 
			ОбластьСтрока.Параметры.Декрет	= Декрет25; 			
			ОбластьСтрока.Параметры.Средняя	= СчДней25 - Декрет25; 			
			ОбластьСтрока.Параметры.ВнешСовм	= Совм25; 			
			ОбластьСтрока.Параметры.ГПХ		= ГПХ25; 			
			СчИтогОбщий	= СчИтогОбщий + СчДней25;	
		ИначеЕсли X = 26 Тогда	
			ОбластьСтрока.Параметры.СчДней	= СчДней26; 
			ОбластьСтрока.Параметры.Декрет	= Декрет26; 			
			ОбластьСтрока.Параметры.Средняя	= СчДней26 - Декрет26; 			
			ОбластьСтрока.Параметры.ВнешСовм	= Совм26; 			
			ОбластьСтрока.Параметры.ГПХ		= ГПХ26; 			
			СчИтогОбщий	= СчИтогОбщий + СчДней26;	
		ИначеЕсли X = 27 Тогда	
			ОбластьСтрока.Параметры.СчДней	= СчДней27; 
			ОбластьСтрока.Параметры.Декрет	= Декрет27; 			
			ОбластьСтрока.Параметры.Средняя	= СчДней27 - Декрет27; 			
			ОбластьСтрока.Параметры.ВнешСовм	= Совм27; 			
			ОбластьСтрока.Параметры.ГПХ		= ГПХ27; 			
			СчИтогОбщий	= СчИтогОбщий + СчДней27;	
		ИначеЕсли X = 28 Тогда	
			ОбластьСтрока.Параметры.СчДней	= СчДней28; 
			ОбластьСтрока.Параметры.Декрет	= Декрет28; 			
			ОбластьСтрока.Параметры.Средняя	= СчДней28 - Декрет28; 			
			ОбластьСтрока.Параметры.ВнешСовм	= Совм28; 			
			ОбластьСтрока.Параметры.ГПХ		= ГПХ28; 			
			СчИтогОбщий	= СчИтогОбщий + СчДней28;	
		ИначеЕсли X = 29 Тогда	
			ОбластьСтрока.Параметры.СчДней	= СчДней29; 
			ОбластьСтрока.Параметры.Декрет	= Декрет29; 			
			ОбластьСтрока.Параметры.Средняя	= СчДней29 - Декрет29; 			
			ОбластьСтрока.Параметры.ВнешСовм	= Совм29; 			
			ОбластьСтрока.Параметры.ГПХ		= ГПХ29; 			
			СчИтогОбщий	= СчИтогОбщий + СчДней29;	
		ИначеЕсли X = 30 Тогда	
			ОбластьСтрока.Параметры.СчДней	= СчДней30; 
			ОбластьСтрока.Параметры.Декрет	= Декрет30; 			
			ОбластьСтрока.Параметры.Средняя	= СчДней30 - Декрет30; 			
			ОбластьСтрока.Параметры.ВнешСовм	= Совм30; 			
			ОбластьСтрока.Параметры.ГПХ		= ГПХ30; 			
			СчИтогОбщий	= СчИтогОбщий + СчДней30;	
		ИначеЕсли X = 31 Тогда	
			ОбластьСтрока.Параметры.СчДней	= СчДней31; 
			ОбластьСтрока.Параметры.Декрет	= Декрет31; 			
			ОбластьСтрока.Параметры.Средняя	= СчДней31 - Декрет31; 			
			ОбластьСтрока.Параметры.ВнешСовм	= Совм31; 			
			ОбластьСтрока.Параметры.ГПХ		= ГПХ31; 			
			СчИтогОбщий	= СчИтогОбщий + СчДней31;	
		КонецЕсли;
		
		ТабДок.Вывести(ОбластьСтрока);
		
	КонецЦикла;
	
	ДекретИтог	=  Декрет1+ Декрет2+ Декрет3+ Декрет4+ Декрет5+ Декрет6+ Декрет7+ Декрет8+ Декрет9+ Декрет10+ Декрет11+ Декрет12+ Декрет13+ Декрет14+
	Декрет15 + Декрет16 + Декрет17 + Декрет18+ Декрет19+ Декрет20+ Декрет21+ Декрет22+ Декрет23+ Декрет24+ Декрет25+ Декрет26+ Декрет27+ Декрет28+ Декрет29+ Декрет30+ Декрет31;
	
	СовмИтог	=  Совм1+ Совм2+ Совм3+ Совм4+ Совм5+ Совм6+ Совм7+ Совм8+ Совм9+ Совм10+ Совм11+ Совм12+ Совм13+ Совм14+
	Совм15+ Совм16+ Совм17+ Совм18+ Совм19+ Совм20+ Совм21+ Совм22+ Совм23+ Совм24+ Совм25+ Совм26+ Совм27+ Совм28+ Совм29+ Совм30+ Совм31;
	
	ГПХИтог	=  ГПХ1+ ГПХ2+ ГПХ3+ ГПХ4+ ГПХ5+ ГПХ6+ ГПХ7+ ГПХ8+ ГПХ9+ ГПХ10+ ГПХ11+ ГПХ12+ ГПХ13+ ГПХ14+
	ГПХ15+ ГПХ16+ ГПХ17+ ГПХ18+ ГПХ19+ ГПХ20+ ГПХ21+ ГПХ22+ ГПХ23+ ГПХ24+ ГПХ25+ ГПХ26+ ГПХ27+ ГПХ28+ ГПХ29+ ГПХ30+ ГПХ31;
	
	ОбластьПодвал.Параметры.СредняяИтог	= (СчИтогОбщий - ДекретИтог) / СчПП; 			
	ОбластьПодвал.Параметры.ВнешСовмИтог= СовмИтог / СчПП;
	ОбластьПодвал.Параметры.ГПХИтог		= ГПХИтог / СчПП;
	ТабДок.Вывести(ОбластьПодвал);
	
	Лог = Лог + Символы.ВК + ОтчетОбъект.Лог; 
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	Отчет.Лог = "";
	Лог = "";
	СформироватьНаСервере();
КонецПроцедуры

// ВНЕШНИЙ ВИД +

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭтаФорма.ФлажокАгентства = Истина;
	ЭтаФорма.Элементы.Подразделение.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцПериодПриИзменении(Элемент)
	
	Отчет.МесяцПериод = КонецМесяца(Отчет.МесяцПериод);
	
КонецПроцедуры

&НаКлиенте
Процедура ФлажокКомпанияПриИзменении(Элемент)
	
	Если ЭтаФорма.ФлажокКомпания Тогда
		ЭтаФорма.ФлажокМосква						= Ложь;
		ЭтаФорма.Элементы.Подразделение.Видимость	= Ложь;
		ЭтаФорма.ФлажокПодразделение				= Ложь;
		ЭтаФорма.ФлажокАгентства					= Ложь;
	КонецЕсли;
	
	Если ЭтаФорма.ФлажокМосква	= Ложь И ЭтаФорма.ФлажокАгентства = Ложь 
		И ЭтаФорма.ФлажокКомпания = Ложь И ЭтаФорма.ФлажокПодразделение	= Ложь Тогда
		ЭтаФорма.ФлажокМосква						= Ложь;
		ЭтаФорма.ФлажокАгентства					= Ложь;
		ЭтаФорма.Элементы.Подразделение.Видимость	= Ложь;
		ЭтаФорма.ФлажокКомпания						= Истина;
		ЭтаФорма.ФлажокПодразделение				= Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФлажокМоскваПриИзменении(Элемент)
	
	Если ЭтаФорма.ФлажокМосква Тогда
		ЭтаФорма.ФлажокАгентства					= Ложь;
		ЭтаФорма.Элементы.Подразделение.Видимость	= Ложь;
		ЭтаФорма.ФлажокКомпания						= Ложь;
		ЭтаФорма.ФлажокПодразделение				= Ложь;
	КонецЕсли;
	Если ЭтаФорма.ФлажокМосква = Ложь И ЭтаФорма.ФлажокАгентства	= Ложь 
		И ЭтаФорма.ФлажокКомпания = Ложь И ЭтаФорма.ФлажокПодразделение = Ложь Тогда
		ЭтаФорма.ФлажокМосква						= Истина;
		ЭтаФорма.ФлажокАгентства					= Ложь;
		ЭтаФорма.Элементы.Подразделение.Видимость	= Ложь;	
		ЭтаФорма.ФлажокКомпания						= Ложь;
		ЭтаФорма.ФлажокПодразделение				= Ложь;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ФлажокАгенстваПриИзменении(Элемент)
	
	Если ЭтаФорма.ФлажокАгентства	= Истина Тогда
		ЭтаФорма.ФлажокМосква						= Ложь;
		ЭтаФорма.Элементы.Подразделение.Видимость	= Истина;
		ЭтаФорма.ФлажокКомпания						= Ложь;
		ЭтаФорма.ФлажокПодразделение				= Ложь;
	КонецЕсли;
	Если ЭтаФорма.ФлажокМосква	= Ложь И ЭтаФорма.ФлажокАгентства = Ложь 
		И ЭтаФорма.ФлажокКомпания = Ложь И ЭтаФорма.ФлажокПодразделение	= Ложь Тогда
		ЭтаФорма.ФлажокМосква						= Ложь;
		ЭтаФорма.ФлажокАгентства					= Истина;
		ЭтаФорма.Элементы.Подразделение.Видимость	= Истина;
		ЭтаФорма.ФлажокКомпания						= Ложь;
		ЭтаФорма.ФлажокПодразделение				= Ложь;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ФлажокПодразделениеПриИзменении(Элемент)
	
	Если ЭтаФорма.ФлажокПодразделение = Истина Тогда
		ЭтаФорма.ФлажокМосква						= Ложь;
		ЭтаФорма.Элементы.Подразделение.Видимость	= Истина;
		ЭтаФорма.ФлажокКомпания						= Ложь;
		ЭтаФорма.ФлажокАгентства					= Ложь;
	КонецЕсли;
	Если ЭтаФорма.ФлажокМосква	= Ложь И ЭтаФорма.ФлажокАгентства = Ложь 
		И ЭтаФорма.ФлажокКомпания = Ложь И ЭтаФорма.ФлажокПодразделение	= Ложь Тогда
		ЭтаФорма.ФлажокМосква						= Ложь;
		ЭтаФорма.ФлажокАгентства					= Ложь;
		ЭтаФорма.Элементы.Подразделение.Видимость	= Истина;
		ЭтаФорма.ФлажокКомпания						= Ложь;
		ЭтаФорма.ФлажокПодразделение				= Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Отчет.Подразделение) Тогда 
		ЭтаФорма.ФлажокПодразделение = Истина;
		ЭтаФорма.ФлажокМосква						= Ложь;
		ЭтаФорма.Элементы.Подразделение.Видимость	= Истина;
		ЭтаФорма.ФлажокКомпания						= Ложь;
		ЭтаФорма.ФлажокАгентства					= Ложь;
	КонецЕсли;
КонецПроцедуры

// ВНЕШНИЦ ВИД -