#Область Команды

&НаКлиенте
Процедура ПроизводственныйКалендарь(Команда)
	ПроизводственныйКалендарьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПроизводственныйКалендарьНаСервере()
	ОбработкаОбъект = ОбъектОбработки();	
	ОбработкаОбъект.ВыгрузитьПроизводственныйКалендарь();
КонецПроцедуры

&НаКлиенте
Процедура Агенты(Команда)
	АгентыНаСервере();
КонецПроцедуры

&НаСервере
Процедура АгентыНаСервере()
	ОбработкаОбъект = ОбъектОбработки();	
	ОбработкаОбъект.ВыгрузитьАгентов();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьКалендарь = Истина;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции
&НаСервере
Функция ОбъектОбработки()
	Возврат РеквизитФормыВЗначение("Объект");
КонецФункции // ОбъектОбработки()

#КонецОбласти




