&НаКлиенте
Перем ВСообщение;
&НаКлиенте
Перем Лог;
&НаКлиенте
Перем Всплывающее;
&НаКлиенте
Перем КаталогИмпорта;


&НаКлиенте
Процедура Загрузить(Команда)
	
	МассивДокументов = Новый Массив;
	Загрузить_СерверНов(МассивДокументов);
	Для Каждого Документ Из МассивДокументов Цикл 
		ФормаДокумента = ПолучитьФорму("Документ.Премия.ФормаОбъекта", новый Структура("Ключ",Документ));
		ФормаДокумента.ПерезаполнитьДанныеФормыНаСервере(ПолучитьМассивСотрудников(Документ),Ложь);
		//ФормаДокумента.Записать();
		ФормаДокумента.Открыть();
	КонецЦикла;  
	
	//ВывестиСообщение(Лог+ВСообщение,"Импорт завершен в "+ТекущаяДата());
	//ВывестиСообщение(Всплывающее,"Импорт завершен.");

КонецПроцедуры

&НаСервере
Функция ПолучитьМассивСотрудников(Документ)
	Возврат Документ.Начисления.ВыгрузитьКолонку("Сотрудник");
КонецФункции

&НаКлиенте
Процедура ВывестиСообщение (СпособВывода,Сообщение)
	Выводить=СпособВывода;
	Если Выводить>=8 Тогда
		Выводить=Выводить-8;
	КонецЕсли;
	Если Выводить>=4 Тогда
		//ВСообщение
		Выводить=Выводить-4;
		Сообщить(Сообщение);
	КонецЕсли;
	Если Выводить>=2 Тогда
		//Статус
		Выводить=Выводить-2;
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = Строка(Сообщение);
		Сообщение.УстановитьДанные(ЭтотОбъект.ЭтаФорма);
		Сообщение.Сообщить();
	КонецЕсли;
	Если Выводить>=1 Тогда
		//Всплывающее
		Выводить=Выводить-1;
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = Строка(Сообщение);
		Сообщение.УстановитьДанные(ЭтотОбъект.ЭтаФорма);
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура Загрузить_Сервер(МассивДокументов);
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("ДатаНачала");
	ТаблицаДанных.Колонки.Добавить("ДатаОкончания");
	ТаблицаДанных.Колонки.Добавить("Сотрудник");
	ТаблицаДанных.Колонки.Добавить("Подразделение");
	ТаблицаДанных.Колонки.Добавить("Результат");
		
	//обработка файла
	//Загружаем = ПрочитатьТабличныйДокументИзExcel(Объект.ФайлЗагрузки, 1);
	Для Каждого Стр Из Объект.Excel Цикл
		
		ФИО=Стр.ФИО;
		ТабНомер=Стр.ТабНомер;
		Попытка
			Сумма=Число(Стр.Сумма);
		Исключение
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Неверный формат суммы в строке "+Стр.НомерСтроки+": "+Стр.Сумма+". Импорт отменен.";
			Сообщение.УстановитьДанные(ЭтотОбъект.ЭтаФорма);
			Сообщение.Сообщить();
			Возврат;
		КонецПопытки;
		
		Сотр=Справочники.Сотрудники.НайтиПоКоду(ТабНомер);
		Если Сотр.Пустая() Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст =  "Сотрудник с табельным номером "+ТабНомер+" не найден. Импорт отменен.";
			Сообщение.УстановитьДанные(ЭтотОбъект.ЭтаФорма);
			Сообщение.Сообщить();
			Возврат;
		ИначеЕсли СокрЛП(ФИО)<>СокрЛП(Сотр.Наименование) Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "ФИО сотрудника в файле в строке "+Стр.НомерСтроки+": "+ФИО+"."+Символы.ВК+Символы.ПС+
			"ФИО сотрудника в базе: "+Сотр.Наименование+";"+Символы.ВК+Символы.ПС+
			"Несовпадение ФИО. Импорт отменен";
			Сообщение.УстановитьДанные(ЭтотОбъект.ЭтаФорма);
			Сообщение.Сообщить();
			Возврат;
		КонецЕсли;			
		НоваяСтрока = ТаблицаДанных.Добавить();
		НоваяСтрока.Сотрудник 	= Сотр;
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	КадроваяИсторияСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
		               |	КадроваяИсторияСотрудниковСрезПоследних.Подразделение КАК ТекущееПодразделение
		               |ИЗ
		               |	РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(&ДатаНачисления, Сотрудник = &Сотрудник) КАК КадроваяИсторияСотрудниковСрезПоследних";
		
		Запрос.УстановитьПараметр("Сотрудник", Сотр);
		Запрос.УстановитьПараметр("ДатаНачисления", Объект.ДатаНачисления);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			НоваяСтрока.Подразделение=Выборка.ТекущееПодразделение;	
			
		КонецЦикла;

		НоваяСтрока.Результат	= Сумма;
		НоваяСтрока.ДатаНачала   = ИзвлечьДату(Стр.ДатаНачала);
		НоваяСтрока.ДатаОкончания   = ИзвлечьДату(Стр.ДатаОкончания);
		
	КонецЦикла;
	
	ТаблицаДат = Новый ТаблицаЗначений;
	ТаблицаДат.Колонки.Добавить("ДатаНачала");
	ТаблицаДат.Колонки.Добавить("ДатаОкончания");
	ТаблицаДат.Колонки.Добавить("Подразделение");
	
	Для Каждого СтрокаДанных из ТаблицаДанных Цикл 
		НоваяСтрока = ТаблицаДат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанных);
	КонецЦикла;
	
	ТаблицаДат.Свернуть("ДатаНачала, ДатаОкончания");
	
	Для Каждого Даты из ТаблицаДат Цикл 
		
		Отбор = Новый Структура("ДатаНачала, ДатаОкончания", Даты.ДатаНачала, Даты.ДатаОкончания);
		ТаблицаСОтбором = ТаблицаДанных.Скопировать(Отбор);
		
		ДокументСоздан = Ложь;
		
		Для Каждого СтрокаДанных Из ТаблицаСОтбором Цикл 
			
			Если Не ДокументСоздан Тогда 
				
				ДокНЗ=Документы.Премия.СоздатьДокумент();
				ДокНЗ.Дата 							= Объект.ДатаНачисления;
				ДокНЗ.Организация					= Объект.Организация;
				ДокНЗ.Ответственный					= ПараметрыСеанса.ТекущийПользователь;
				ДокНЗ.ВидПремии		 				= Объект.Начисление;
				Если Объект.Начисление.ПериодРасчетаБазовыхНачислений = Перечисления.ПериодыРасчетаБазовыхНачислений.ПредыдущийКвартал Тогда 
					ДокНЗ.ДатаНачалаБазовогоПериода = НачалоКвартала(НачалоМесяца(Объект.ДатаНачисления)-1);
					ДокНЗ.ДатаОкончанияБазовогоПериода = КонецКвартала(НачалоМесяца(Объект.ДатаНачисления)-1);
				Иначе 
					ДокНЗ.ДатаНачалаБазовогоПериода 	= НачалоМесяца(Объект.ДатаНачисления);
					ДокНЗ.ДатаОкончанияБазовогоПериода 	= КонецМесяца(Объект.ДатаНачисления);
				КонецЕсли;
				ДокНЗ.ПериодРегистрации				= НачалоМесяца(Объект.ДатаНачисления);
				ДокНЗ.ПланируемаяДатаВыплаты		= ПланируемаяДатаВыплаты;
				ДокНЗ.ПорядокВыплаты				= ХарактерВыплаты;
				Если ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.Межрасчет Тогда 
					ДокНЗ.РассчитыватьУдержания = Истина;
				КонецЕсли;
				ДокНЗ.ДокументРассчитан				= Истина;
				
				ДокументСоздан = Истина;
				
			КонецЕсли;
						
			СтрокаНачислений = ДокНЗ.Начисления.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаНачислений, СтрокаДанных);
			СтрокаНачислений.ПериодДействия = ДокНЗ.ПериодРегистрации;
			СтрокаНачислений.ФиксРасчет = Истина;
			СтрокаНачислений.ДатаНачала 	=  НачалоМесяца(Объект.ДатаНачисления); 
			СтрокаНачислений.ДатаОкончания 	=  КонецМесяца(Объект.ДатаНачисления);
			
		КонецЦикла;
		
		Если ДокументСоздан Тогда 
			ДокНЗ.Записать(РежимЗаписиДокумента.Запись);
			МассивДокументов.Добавить(ДокНЗ.Ссылка);
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Создан документ "+Строка(ДокНЗ);
			Сообщение.УстановитьДанные(ЭтотОбъект.ЭтаФорма);
			Сообщение.Сообщить();
		КонецЕсли;
		
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура Загрузить_СерверНов(МассивДокументов);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДанных.ДатаНачала КАК ДатаНачала,
	|	ТаблицаДанных.ДатаОкончания КАК ДатаОкончания,
	|	ТаблицаДанных.Сумма КАК Сумма,
	|	ТаблицаДанных.ФИО КАК ФИО,
	|	ТаблицаДанных.ТабНомер КАК ТабНомер
	|ПОМЕСТИТЬ ВТТаблицаДанных
	|ИЗ
	|	&ТаблицаДанных КАК ТаблицаДанных
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Сотрудники.Ссылка КАК Сотрудник,
	|	ВТТаблицаДанных.ФИО = Сотрудники.ФизическоеЛицо.ФИО КАК СовподениеФИО,
	|	ВТТаблицаДанных.Сумма КАК Результат,
	|	ВТТаблицаДанных.ДатаНачала КАК ДатаНачала,
	|	ВТТаблицаДанных.ДатаОкончания КАК ДатаОкончания,
	|	ВТТаблицаДанных.ФИО КАК ФИОФайла,
	|	КадроваяИсторияСотрудниковСрезПоследних.Подразделение КАК Подразделение
	|ИЗ
	|	ВТТаблицаДанных КАК ВТТаблицаДанных
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(&ДатаДокумента, ) КАК КадроваяИсторияСотрудниковСрезПоследних
	|			ПО Сотрудники.Ссылка = КадроваяИсторияСотрудниковСрезПоследних.Сотрудник
	|		ПО ВТТаблицаДанных.ТабНомер = Сотрудники.Код
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудники.ФизическоеЛицо.ФИО";
	
	Запрос.УстановитьПараметр("ТаблицаДанных",Объект.Excel.Выгрузить());
	Запрос.УстановитьПараметр("ДатаДокумента",Объект.ДатаНачисления);
	
	РезултьтатЗапроса = Запрос.Выполнить();
	
	Если РезултьтатЗапроса.Пустой() Тогда
		//ВывестиСообщение(Всплывающее,"Импорт завершен.");
		Возврат;
	КонецЕсли;
	
	ДокНЗ=Документы.Премия.СоздатьДокумент();
	ДокНЗ.Дата 							= Объект.ДатаНачисления;
	ДокНЗ.Организация					= Объект.Организация;
	ДокНЗ.Ответственный					= ПараметрыСеанса.ТекущийПользователь;
	ДокНЗ.ВидПремии		 				= Объект.Начисление;
	Если Объект.Начисление.ПериодРасчетаБазовыхНачислений = Перечисления.ПериодыРасчетаБазовыхНачислений.ПредыдущийКвартал Тогда 
		ДокНЗ.ДатаНачалаБазовогоПериода = НачалоКвартала(НачалоМесяца(Объект.ДатаНачисления)-1);
		ДокНЗ.ДатаОкончанияБазовогоПериода = КонецКвартала(НачалоМесяца(Объект.ДатаНачисления)-1);
	Иначе 
		ДокНЗ.ДатаНачалаБазовогоПериода 	= НачалоМесяца(Объект.ДатаНачисления);
		ДокНЗ.ДатаОкончанияБазовогоПериода 	= КонецМесяца(Объект.ДатаНачисления);
	КонецЕсли;
	ДокНЗ.ПериодРегистрации				= НачалоМесяца(Объект.ДатаНачисления);
	ДокНЗ.ПланируемаяДатаВыплаты		= ПланируемаяДатаВыплаты;
	ДокНЗ.ПорядокВыплаты				= ХарактерВыплаты;
	Если ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.Межрасчет Тогда 
		ДокНЗ.РассчитыватьУдержания = Истина;
	КонецЕсли;
	ДокНЗ.ДокументРассчитан				= Истина;
	
	Выборка = РезултьтатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтрокаНачислений = ДокНЗ.Начисления.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНачислений, Выборка);
		СтрокаНачислений.ПериодДействия = ДокНЗ.ПериодРегистрации;
		СтрокаНачислений.ФиксРасчет = Истина;
		СтрокаНачислений.ДатаНачала 	=  НачалоМесяца(Объект.ДатаНачисления); 
		СтрокаНачислений.ДатаОкончания 	=  КонецМесяца(Объект.ДатаНачисления);
		
	КонецЦикла;
	
	ДокНЗ.Записать(РежимЗаписиДокумента.Запись);
	МассивДокументов.Добавить(ДокНЗ.Ссылка);
	//МассивДокументов.Добавить(ДокНЗ.ПолучитьСсылкуНового());
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = "Создан документ "+Строка(ДокНЗ);
	Сообщение.УстановитьДанные(ЭтотОбъект.ЭтаФорма);
	Сообщение.Сообщить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьТабличныйДокументИзExcel(ИмяФайла, НомерЛистаExcel) 
	
	Сообщить("Читается файл "+ИмяФайла+"...");
	
	xlLastCell = 11;
	
	ВыбФайл = Новый Файл(ИмяФайла);
	Если НЕ ВыбФайл.Существует() Тогда
		Сообщить("Файл не существует!");
		Возврат;
	КонецЕсли;                               
	
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(ИмяФайла);
		//Состояние("Обработка файла Microsoft Excel...");
		ExcelЛист = Excel.Sheets(НомерЛистаExcel);
	Исключение
		Сообщить("Ошибка. Возможно неверно указан номер листа книги Excel.");
		Возврат;
		
	КонецПопытки;
	
	//ТабЗнач=Новый ТаблицаЗначений;
	
	ActiveCell = Excel.ActiveCell.SpecialCells(xlLastCell);
	RowCount = ActiveCell.Row;
	ColumnCount = ActiveCell.Column;
	КоличествоКолонок = 0;
	Для Column = 1 По ColumnCount Цикл
		ИмяКолонки=СокрЛП(ExcelЛист.Cells(1,Column).Text);
		ИмяКолонки=СтрЗаменить(ИмяКолонки," ","");
		Если ИмяКолонки="" Тогда
			Прервать
		Иначе
			КоличествоКолонок = КоличествоКолонок + 1;
		КонецЕсли;
	КонецЦикла;
	Для Row = 2 По RowCount Цикл
		ТабСтр=Объект.Excel.Добавить();
		ВсеПустые=Истина;
		Для Column = 1 По КоличествоКолонок Цикл
			Значение=СокрЛП(ExcelЛист.Cells(Row,Column).Text);
			Если Column=1 И Лев(Значение,1)="(" И Найти(ВРЕГ(ИмяФайла),"EMPLOYEEMOVE")>0 Тогда
				Прервать
			КонецЕсли;
			ИмяКолонки=СокрЛП(ExcelЛист.Cells(1,Column).Text);
			ИмяКолонки=СтрЗаменить(ИмяКолонки," ","");
			//ТабСтр[ИмяКолонки]=?(Значение="NULL",Неопределено,Значение);
			//Если ТабСтр[ИмяКолонки]<>"" И ТабСтр[ИмяКолонки]<>Неопределено Тогда
			//	ВсеПустые=Ложь
			//КонецЕсли;
			Если Значение = "" Тогда
			ИначеЕсли ИмяКолонки = "Сумма" Тогда
				Попытка
					ТабСтр.Сумма=Число(Значение);
					СуммаИтого = СуммаИтого + ТабСтр.Сумма;
				Исключение
					Сообщение = Новый СообщениеПользователю();
					Сообщение.Текст = "Неверный формат суммы в строке "+Row+": "+Значение+". Импорт отменен.";
					Сообщение.УстановитьДанные(ЭтотОбъект.ЭтаФорма);
					Сообщение.Сообщить();
					Возврат;
				КонецПопытки;
			ИначеЕсли ИмяКолонки = "ДатаНачала" ИЛИ ИмяКолонки = "ДатаОкончания" Тогда
				ТабСтр[ИмяКолонки]=?(Значение="NULL",Неопределено,ИзвлечьДату(Значение));
			Иначе
				ТабСтр[ИмяКолонки]=?(Значение="NULL",Неопределено,Значение);
			КонецЕсли;
			Если ТабСтр[ИмяКолонки]<>"" И ТабСтр[ИмяКолонки]<>Неопределено И НЕ Значение="" Тогда
				ВсеПустые=Ложь;
			КонецЕсли;
		КонецЦикла;
		Если ВсеПустые Тогда
			Объект.Excel.Удалить(Объект.Excel.Количество()-1);
			Прервать
		КонецЕсли;
	КонецЦикла;
	
	Excel.WorkBooks.Close();
	Excel = 0;
	
КонецПроцедуры 

&НаСервере
Функция ИзвлечьДату (Исходное)
	Возврат Дата(Число(Сред(Исходное,7,4)),Число(Сред(Исходное,4,2)),Число(Сред(Исходное,1,2)));
КонецФункции

&НаКлиенте
Процедура ФайлЗагрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВыборФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ВыборФайла.Заголовок = "Выберите файл с информацией о продавцах";
	ВыборФайла.ПроверятьСуществованиеФайла = Истина;
	ВыборФайла.Каталог = КаталогИмпорта;
	ВыборФайла.Фильтр = "Файлы XLS (*.xls,*.xlsx)|*.xls?";
	
	Если Не ВыборФайла.Выбрать() Тогда
		Возврат;
	Иначе
		Объект.ФайлЗагрузки = ВыборФайла.ПолноеИмяФайла
	КонецЕсли;
	
	КаталогИмпорта = ВыборФайла.Каталог;
	//ИмяРеестра = РаботаСФайлами.ПолучитьИмяФайлаИзПолногоПути(ВыборФайла.ПолноеИмяФайла);

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
	Объект.ДатаНачисления = ТекущаяДата();
	ПланируемаяДатаВыплаты = Объект.ДатаНачисления;
	ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.Зарплата;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	
	СписокКолонок = Новый СписокЗначений;  	
	СписокКолонок.Добавить("ФИО");
	СписокКолонок.Добавить("ТабНомер");
	СписокКолонок.Добавить("Сумма");
	СписокКолонок.Добавить("ДатаНачала");
	СписокКолонок.Добавить("ДатаОкончания");
		
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СписокКолонок", СписокКолонок);
	
	ОткрытьФорму("Обработка.ППФ_ОБЩ_ЗагрузкаИзТабличногоДокумента.Форма.ЗагрузкаИзТабличногоДокумента", ПараметрыФормы, ЭтаФорма);	

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ПолучениеЗагруженнойТаблицыЗначений" Тогда
		
		ПолучениеДанныхИзЗагруженнойТаблицыЗначений(Параметр);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПолучениеДанныхИзЗагруженнойТаблицыЗначений(АдресВХранилищеЗначений)
	
	Объект.Excel.Очистить();
	СуммаИтого = 0;
	
	ТабЗнч = ПолучитьИзВременногоХранилища(АдресВХранилищеЗначений);
	
	Для Каждого Стр Из ТабЗнч Цикл
		НовСтр = Объект.Excel.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,Стр);
		НовСтр.ДатаНачала = ИзвлечьДату(Стр.ДатаНачала);
		НовСтр.ДатаОкончания = ИзвлечьДату(Стр.ДатаОкончания);
		СуммаИтого = СуммаИтого + НовСтр.Сумма;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзФайла(Команда)
	
	ФайлЗагрузкиНачалоВыбора("","","");
	
	Объект.Excel.Очистить();
	СуммаИтого = 0;
	
	ВывестиСообщение(ВСообщение,"-------------------------");
	ВывестиСообщение(Лог+ВСообщение,"Начало загрузки премий");
	ВывестиСообщение(Лог+ВСообщение,"-------------------------");
	Отменить=Ложь;
	Если СокрЛП(Объект.ФайлЗагрузки)="" Тогда
		ВывестиСообщение(ВСообщение,"Файл для импорта не выбран.");
		Отменить=Истина;
	КонецЕсли;
	ФС=Новый Файл(Объект.ФайлЗагрузки);
	Если НЕ ФС.Существует() Тогда
		ВывестиСообщение(Лог+ВСообщение,"Файл для импорта не существует.");
		Отменить=Истина;
	КонецЕсли;
	Если Объект.Организация.Пустая() Тогда
		ВывестиСообщение(Лог+ВСообщение,"Организация не выбрана.");
		Отменить=Истина;
	КонецЕсли;
	Если Объект.Начисление.Пустая() Тогда
		ВывестиСообщение(Лог+ВСообщение,"Основное начисление не выбрано.");
		Отменить=Истина;
	КонецЕсли;
	Если не ЗначениеЗаполнено(Объект.ДатаНачисления) Тогда
		ВывестиСообщение(Лог+ВСообщение,"Дата начисления не выбрана.");
		Отменить=Истина;
	КонецЕсли;
	
	Если Отменить Тогда
		ВывестиСообщение(?(СокрЛП(Объект.ФайлЗагрузки)="",0,Лог)+ВСообщение+Всплывающее,"Импорт отменен.");
		Возврат;
	КонецЕсли;
	
	ПрочитатьТабличныйДокументИзExcel(Объект.ФайлЗагрузки, 1);
	
КонецПроцедуры

ВСообщение=4;
Лог=8;
Всплывающее=1;
КаталогИмпорта="";