
&НаКлиенте
Процедура Сформировать(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		
		ВывестиОбходнойЛист();		
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиОбходнойЛист()
	
	Документ = Новый ТабличныйДокумент;
	
	ПолучитьДокументСервер(Документ);
	
	Если Документ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторПечатнойФормы = "ОбходнойЛист";
	НазваниеПечатнойФормы = НСтр("ru = 'Обходной лист'");
	
	Если Не ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.Печать") Тогда
		Документ.Показать(НазваниеПечатнойФормы);
		ДокументыПечатались = Истина;
		Возврат;
	КонецЕсли;
	
	МодульУправлениеПечатьюКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеПечатьюКлиент");
	
	КоллекцияПечатныхФорм = МодульУправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(ИдентификаторПечатнойФормы);
	ПечатнаяФорма = МодульУправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, ИдентификаторПечатнойФормы);
	ПечатнаяФорма.СинонимМакета = НазваниеПечатнойФормы;
	ПечатнаяФорма.ТабличныйДокумент = Документ;
	ПечатнаяФорма.ИмяФайлаПечатнойФормы = НазваниеПечатнойФормы;
	
	ОбластиОбъектов = Новый СписокЗначений;
	МодульУправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, ОбластиОбъектов);
		
КонецПроцедуры // ВывестиОбходнойЛист()

&НаСервере
Функция ОбъектОбработки()
	Возврат РеквизитФормыВЗначение("Объект");
КонецФункции // ОбъектОбработки()

&НаСервере
Процедура ПолучитьДокументСервер(Документ)
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(Объект.Увольнение);
	Документ = ОбъектОбработки().ПолучитьДокумент(ОбъектОбработки().ПолучитьМакет("ОбходнойЛист"),МассивОбъектов);
КонецПроцедуры // ПолучитьДокументСервер()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Вариант = "Офис";
	
	ЗаполнитьСписокПодписантов();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокПодписантов()
	
	Объект.Подписанты.Очистить();
	
	Если Вариант = "Офис" Тогда
		
		ДобавитьПодписантаПоТабальномуНомеру("1332"); 	// А.В. Грицевская
		ДобавитьПодписантаПоТабальномуНомеру("1478"); 	// В.И. Буздин
		ДобавитьПодписантаПоТабальномуНомеру("1461");	// Е.П. Фадеева
		ДобавитьПодписантаПоТабальномуНомеру("1398"); 	// С.Г. Овчаренко
		ДобавитьПодписантаПоТабальномуНомеру("2733");	// Ильина А.В.
		ДобавитьПодписантаПоТабальномуНомеру("1103");	// А.В. Закирова
		ДобавитьПодписантаПоТабальномуНомеру("32");		// А.A. Токарев
		ДобавитьПодписантаПоТабальномуНомеру("1945");   // А.Г. Савина
		
	КонецЕсли;

КонецПроцедуры // ЗаполнитьСписокПодписантов()

&НаСервере
Процедура ДобавитьПодписантаПоТабальномуНомеру(Номер)
	НоваяСтрока = Объект.Подписанты.Добавить();
	НоваяСтрока.Сотрудник = Справочники.Сотрудники.НайтиПоКоду(Номер); // С.Г. Овчаренко
КонецПроцедуры // ДобавитьПодписантаПоТабальномуНомеру()

&НаКлиенте
Процедура ВариантПриИзменении(Элемент)
	ЗаполнитьСписокПодписантов();		
КонецПроцедуры
 
 
 

 
