// Разработчик Артамонов Роман Олегович

////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМЫ
////////////////////////////////////////////////////
&НаКлиенте
Процедура ПроверитьФизиков(Команда)
	Объект.ПФРФизическихЛиц.Очистить();	
	ПроверитьФизиков_Сервер();
КонецПроцедуры

////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
////////////////////////////////////////////////////
&НаСервере
Процедура ПроверитьФизиков_Сервер()
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ФизическиеЛица.Ссылка,
	               |	ФизическиеЛица.СтраховойНомерПФР
	               |ИЗ
	               |	Справочник.ФизическиеЛица КАК ФизическиеЛица
	               |ГДЕ
	               |	ФизическиеЛица.ПометкаУдаления = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ФизическиеЛица.Наименование";
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл 
		Сообщение = "";
		СтраховойНомерПФР = Выборка.СтраховойНомерПФР;
		СНИЛСУказанПравильно = РегламентированныеДанныеКлиентСервер.СтраховойНомерПФРСоответствуетТребованиям(СтраховойНомерПФР, Сообщение);	
		Если Не СНИЛСУказанПравильно Тогда 
			НоваяСтрока = Объект.ПФРФизическихЛиц.Добавить();
			НоваяСтрока.ФизическоеЛицо 		= Выборка.Ссылка;
			НоваяСтрока.СтраховойНомерПФР 	= СтраховойНомерПФР;
			НоваяСтрока.Причина				= Сообщение;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьФизическихЛицРаботающихСотрудников(Команда)
	Объект.ПФРФизическихЛиц.Очистить();	
	ПроверитьФизическихЛицРаботающихСотрудниковНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПроверитьФизическихЛицРаботающихСотрудниковНаСервере()
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТекущиеКадровыеДанныеСотрудников.ФизическоеЛицо.Ссылка КАК Ссылка,
	               |	ТекущиеКадровыеДанныеСотрудников.ФизическоеЛицо.СтраховойНомерПФР КАК СтраховойНомерПФР
	               |ИЗ
	               |	РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
	               |ГДЕ
	               |	ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1)
	               |	И ТекущиеКадровыеДанныеСотрудников.ДатаПриема <> ДАТАВРЕМЯ(1, 1, 1)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ТекущиеКадровыеДанныеСотрудников.ФизическоеЛицо.Наименование";
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();
	
	ВывестиРезультат(Выборка);
КонецПроцедуры

&НаСервере
Процедура ВывестиРезультат(Выборка)
	Пока Выборка.Следующий() Цикл 
		Сообщение = "";
		СтраховойНомерПФР = Выборка.СтраховойНомерПФР;
		СНИЛСУказанПравильно = РегламентированныеДанныеКлиентСервер.СтраховойНомерПФРСоответствуетТребованиям(СтраховойНомерПФР, Сообщение);	
		Если Не СНИЛСУказанПравильно Тогда 
			НоваяСтрока = Объект.ПФРФизическихЛиц.Добавить();
			НоваяСтрока.ФизическоеЛицо 		= Выборка.Ссылка;
			НоваяСтрока.СтраховойНомерПФР 	= СтраховойНомерПФР;
			НоваяСтрока.Причина				= Сообщение;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ТолькоДляНеЗакрытыхДоговоровДГПХНаСервере()
	Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорРаботыУслуги.ФизическоеЛицо
		|ПОМЕСТИТЬ ВТ_ДГПХ
		|ИЗ
		|	Документ.ДоговорРаботыУслуги КАК ДоговорРаботыУслуги
		|ГДЕ
		|	ДоговорРаботыУслуги.ДатаОкончания = ДАТАВРЕМЯ(3099, 12, 31)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ФизическиеЛица.Ссылка КАК Ссылка,
		|	ФизическиеЛица.СтраховойНомерПФР КАК СтраховойНомерПФР
		|ИЗ
		|	Справочник.ФизическиеЛица КАК ФизическиеЛица
		|ГДЕ
		|	ФизическиеЛица.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТ_ДГПХ.ФизическоеЛицо
		|			ИЗ
		|				ВТ_ДГПХ КАК ВТ_ДГПХ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_ДГПХ";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	ВывестиРезультат(Выборка);
КонецПроцедуры

&НаКлиенте
Процедура ТолькоДляНеЗакрытыхДоговоровДГПХ(Команда)
	Объект.ПФРФизическихЛиц.Очистить();	
	ТолькоДляНеЗакрытыхДоговоровДГПХНаСервере();
КонецПроцедуры
