
&НаСервере
Процедура ИсправитьНаСервере()
	
	ДокументОбъект = Документ.ПолучитьОбъект();
	ТЧСотрудники = ДокументОбъект.Сотрудники;
	
	Для Каждого СтрокаДанных Из ТЧСотрудники Цикл 
		СтрокаДанных.УдержаноПоСтавке13 	= СтрокаДанных.ИсчисленоПоСтавке13;
		СтрокаДанных.ПеречисленоПоСтавке13 	= СтрокаДанных.ИсчисленоПоСтавке13;
	КонецЦикла;
	
	Попытка
		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		Сообщить("Документ "+ Документ + " исправлен.");
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура Исправить(Команда)
	ИсправитьНаСервере();
КонецПроцедуры
