
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("КлючВарианта",ЭтаФорма.КлючТекущегоВарианта);
	
	Период.ДатаНачала = НачалоМесяца(ТекущаяДата());
	Период.ДатаОкончания = КонецМесяца(ТекущаяДата());
	
	УстановитьПериод();
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	УстановитьПериод();
КонецПроцедуры

&НаСервере
Процедура УстановитьПериод()
	Отчет.НачалоПериода = Период.ДатаНачала;
	Отчет.КонецПериода = Период.ДатаОкончания;	
КонецПроцедуры // УстановитьПериод()

&НаСервере
Процедура ПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("КлючВарианта",ЭтаФорма.КлючТекущегоВарианта);
КонецПроцедуры
 
 
