
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	//НастройкиОтчета = Отчет.КомпоновщикНастроек.ПолучитьНастройки();
	//
	//ВидКИ = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВидКИ"));
	//Если ВидКИ<>Неопределено Тогда 
	//	ВидКИ.Использование = Истина;
	//	ВидКИ.Значение = Справочники.ВидыКонтактнойИнформации.EMailФизическиеЛица;		
	//КонецЕсли;
	//	
	//Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиОтчета);	
	               	
КонецПроцедуры

