&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ФлажокКомпания	= Истина;
	ФлажокМосква	= Истина;
	ФлажокАгенства	= Истина;
КонецПроцедуры


&НаСервере
Процедура СформироватьНаСервере(Отладка)
	
	ВидДняРабочий = Новый СписокЗначений;
	ВидДняРабочий.Добавить(Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий);
	ВидДняРабочий.Добавить(Перечисления.ВидыДнейПроизводственногоКалендаря.Предпраздничный);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала",						ПериодОтчета.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",					ПериодОтчета.ДатаОкончания);
	Запрос.УстановитьПараметр("ПроизводственныйКалендарь",		Справочники.ПроизводственныеКалендари.НайтиПоКоду("РФ"));
	Запрос.УстановитьПараметр("ВидДняРабочий",					ВидДняРабочий);
	Запрос.УстановитьПараметр("Дата3999",						Дата(3999,12,31,23,59,59));
	Запрос.УстановитьПараметр("ПустаяСсылкаПодразделение",		Справочники.ПодразделенияОрганизаций.ПустаяСсылка());
	Запрос.УстановитьПараметр("Подразделение",					ПоПодразделению);
	Запрос.УстановитьПараметр("ФлажокКомпания",					ФлажокКомпания);
	Запрос.УстановитьПараметр("ФлажокМосква",					ФлажокМосква);
	Запрос.УстановитьПараметр("ФлажокАгенства",					ФлажокАгенства);
	
	
	Запрос.Текст = ТекстыЗапросов(Отладка);
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	
	Если НЕ Отладка Тогда
		ВыборкаПодразделение = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Макет = ОтчетОбъект.ПолучитьМакет("Макет");
		//ТабДок = Новый ТабличныйДокумент;
		ТабДок.Очистить();
		
		Пока ВыборкаПодразделение.Следующий() Цикл
			
			ОбластьШапка	= Макет.ПолучитьОбласть("Шапка");
			ОбластьСтрока	= Макет.ПолучитьОбласть("Строка");
			ОбластьПодвал	= Макет.ПолучитьОбласть("Подвал");
			
			ОбластьШапка.Параметры.Шапка = "Расчет среднесписочной численности работников за период с " + Формат(ПериодОтчета.ДатаНачала, "ДФ=""dd.MM.yyyy""") + " по " + Формат(ПериодОтчета.ДатаОкончания, "ДФ=""dd.MM.yyyy""");
			
			ОбластьШапка.Параметры.Подразделение = ВыборкаПодразделение.Подразделение;
			ТабДок.Вывести(ОбластьШапка);
			
			Выборка = ВыборкаПодразделение.Выбрать();
			Пока Выборка.Следующий() Цикл
				ОбластьСтрока.Параметры.Заполнить(Выборка);
				ТабДок.Вывести(ОбластьСтрока);
			КонецЦикла;
			
			ОбластьПодвал.Параметры.СредняяИтог = ВыборкаПодразделение.ПодлежитВключению;
			ОбластьПодвал.Параметры.ВнешСовмИтог = ВыборкаПодразделение.ВнешнееСовместительство;
			ТабДок.Вывести(ОбластьПодвал);
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			
		КонецЦикла;
	Иначе
		
		РазностьДат = Окр((ПериодОтчета.ДатаОкончания - ПериодОтчета.ДатаНачала) / (24*60*60));
		
		РезДерево = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
		Для Каждого СтрПодразделение Из РезДерево.Строки Цикл
			
			СуммаПодлежитВключению = 0; СуммаВнешнееСовместительство = 0;
			Для Каждого СтрДата Из СтрПодразделение.Строки Цикл
				СуммаПодлежитВключению			= СуммаПодлежитВключению		+ СтрДата.ПодлежитВключению;
				СуммаВнешнееСовместительство	= СуммаВнешнееСовместительство	+ СтрДата.ВнешнееСовместительство;
			КонецЦикла;
			
			СтрПодразделение.СписочнаяЧисленность		= 0;
			СтрПодразделение.НеПодлежитВключению        = 0;
			СтрПодразделение.ПодлежитВключению          = СуммаПодлежитВключению / РазностьДат;
			СтрПодразделение.ВнешнееСовместительство	= СуммаВнешнееСовместительство / РазностьДат;
			СтрПодразделение.НеПодлежитВключению        = 0;
			СтрПодразделение.ДоговорГПХ					= 0;
		КонецЦикла;
		
		ЗначениеВРеквизитФормы(РезДерево,"Дерево");
		Элементы.Дерево.Обновить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	//Элементы.Дерево.Видимость = Ложь;
	//Элементы.ТабДок.Видимость = Истина;
	
	СформироватьНаСервере(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура Отладка(Команда)
	//Элементы.Дерево.Видимость = Истина;
	//Элементы.ТабДок.Видимость = Ложь;
	
	СформироватьНаСервере(Истина);
КонецПроцедуры

Функция ТекстыЗапросов(Отладка)
	Если НЕ Отладка Тогда
		Возврат "
		|ВЫБРАТЬ
		|	ПодразделенияОрганизаций.Ссылка КАК ПодразделениеСсылка,
		|	ДополнительныеСведения.Значение КАК Местоположение
		|ПОМЕСТИТЬ ВТ_01_ОбособленныеПодразделения
		|ИЗ
		|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|		ПО ПодразделенияОрганизаций.Ссылка = ДополнительныеСведения.Объект
		|			И (ДополнительныеСведения.Свойство.Наименование = ""Местонахождение (Подразделения)"")
		|ГДЕ
		|	ПодразделенияОрганизаций.Сформировано
		|	И ПодразделенияОрганизаций.ДатаСоздания < &ДатаОкончания
		|	И (НЕ ПодразделенияОрганизаций.Расформировано
		|			ИЛИ ПодразделенияОрганизаций.ДатаРасформирования > &ДатаНачала)
		|	И (ПодразделенияОрганизаций.Ссылка = &Подразделение
		|			ИЛИ &Подразделение = &ПустаяСсылкаПодразделение)
		|	И (&ФлажокКомпания
		|			ИЛИ &ФлажокМосква
		|				И ДополнительныеСведения.Значение.Наименование = ""г.Москва""
		|			ИЛИ &ФлажокАгенства
		|				И НЕ ДополнительныеСведения.Значение.Наименование = ""г.Москва"")
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеПроизводственногоКалендаря.Дата КАК Дата,
		|	ДанныеПроизводственногоКалендаря.ВидДня КАК ВидДня,
		|	ВТ_01_ОбособленныеПодразделения.ПодразделениеСсылка КАК ПодразделениеСсылка,
		|	ВТ_01_ОбособленныеПодразделения.Местоположение КАК Местоположение
		|ПОМЕСТИТЬ ВТ_02_ДанныеКалендаря
		|ИЗ
		|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря,
		|	ВТ_01_ОбособленныеПодразделения КАК ВТ_01_ОбособленныеПодразделения
		|ГДЕ
		|	ДанныеПроизводственногоКалендаря.Дата МЕЖДУ ДОБАВИТЬКДАТЕ(&ДатаНачала, ДЕНЬ, -14) И ДОБАВИТЬКДАТЕ(&ДатаОкончания, ДЕНЬ, 14)
		|	И ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = &ПроизводственныйКалендарь
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТекущиеКадровыеДанныеСотрудников.Сотрудник КАК Сотрудник,
		|	ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения КАК ДатаУвольнения,
		|	МИНИМУМ(КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(ВТ_02_ДанныеКалендаря.Дата, ДЕНЬ, -1), ДЕНЬ)) КАК ДатаИсключенияИзОтчета
		|ПОМЕСТИТЬ ВТ_03_ДатыИсключенияИзОтчета
		|ИЗ
		|	РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_02_ДанныеКалендаря КАК ВТ_02_ДанныеКалендаря
		|		ПО ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения < ВТ_02_ДанныеКалендаря.Дата
		|			И (ВТ_02_ДанныеКалендаря.ВидДня В (&ВидДняРабочий))
		|ГДЕ
		|	ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения > ДОБАВИТЬКДАТЕ(&ДатаНачала, ДЕНЬ, -14)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения,
		|	ТекущиеКадровыеДанныеСотрудников.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СостоянияСотрудников.Сотрудник КАК Сотрудник,
		|	СостоянияСотрудников.Период КАК Период,
		|	ВЫБОР
		|		КОГДА СостоянияСотрудников.ДействуетДо = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА &Дата3999
		|		ИНАЧЕ КОНЕЦПЕРИОДА(СостоянияСотрудников.ДействуетДо, ДЕНЬ)
		|	КОНЕЦ КАК ДействуетДо
		|ПОМЕСТИТЬ ВТ_04_Состояния
		|ИЗ
		|	РегистрСведений.СостоянияСотрудников КАК СостоянияСотрудников
		|ГДЕ
		|	СостоянияСотрудников.Состояние В (ЗНАЧЕНИЕ(Перечисление.СостоянияСотрудника.ОтпускПоБеременностиИРодам), ЗНАЧЕНИЕ(Перечисление.СостоянияСотрудника.ОтпускПоУходуЗаРебенком))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КадроваяИсторияСотрудниковИнтервальный.Сотрудник КАК Сотрудник,
		|	НАЧАЛОПЕРИОДА(КадроваяИсторияСотрудниковИнтервальный.ДатаНачала, ДЕНЬ) КАК ДатаНачала,
		|	ВЫБОР
		|		КОГДА КадроваяИсторияСотрудниковИнтервальный.ДатаОкончания = &Дата3999
		|			ТОГДА КадроваяИсторияСотрудниковИнтервальный.ДатаОкончания
		|		КОГДА ЕСТЬNULL(ВТ_03_ДатыИсключенияИзОтчета.ДатаУвольнения, &Дата3999) = НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(КадроваяИсторияСотрудниковИнтервальный.ДатаОкончания, ДЕНЬ, -1), ДЕНЬ)
		|			ТОГДА ВТ_03_ДатыИсключенияИзОтчета.ДатаИсключенияИзОтчета
		|		ИНАЧЕ КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(КадроваяИсторияСотрудниковИнтервальный.ДатаОкончания, ДЕНЬ, -1), ДЕНЬ)
		|	КОНЕЦ КАК ДатаОкончания,
		|	ЕСТЬNULL(ВТ_01_ОбособленныеПодразделения.ПодразделениеСсылка, КадроваяИсторияСотрудниковИнтервальный.Подразделение) КАК Подразделение,
		|	ВЫБОР
		|		КОГДА ВидыЗанятостиСотрудниковСрезПоследних.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.Совместительство)
		|			ТОГДА ВидыЗанятостиСотрудниковСрезПоследних.Сотрудник
		|		ИНАЧЕ NULL
		|	КОНЕЦ КАК ВнешнееСовместительство,
		|	КадроваяИсторияСотрудниковИнтервальный.ГоловнаяОрганизация КАК Организация
		|ПОМЕСТИТЬ ВТ_05_КадроваяИсторияСотрудников
		|ИЗ
		|	РегистрСведений.КадроваяИсторияСотрудниковИнтервальный КАК КадроваяИсторияСотрудниковИнтервальный
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_03_ДатыИсключенияИзОтчета КАК ВТ_03_ДатыИсключенияИзОтчета
		|		ПО КадроваяИсторияСотрудниковИнтервальный.Сотрудник = ВТ_03_ДатыИсключенияИзОтчета.Сотрудник
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_01_ОбособленныеПодразделения КАК ВТ_01_ОбособленныеПодразделения
		|		ПО КадроваяИсторияСотрудниковИнтервальный.Подразделение = ВТ_01_ОбособленныеПодразделения.ПодразделениеСсылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ВидыЗанятостиСотрудников.СрезПоследних(&ДатаОкончания, НЕ ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.ВнутреннееСовместительство)) КАК ВидыЗанятостиСотрудниковСрезПоследних
		|		ПО КадроваяИсторияСотрудниковИнтервальный.Сотрудник = ВидыЗанятостиСотрудниковСрезПоследних.Сотрудник
		|ГДЕ
		|	КадроваяИсторияСотрудниковИнтервальный.ДатаНачала <= &ДатаОкончания
		|	И ДОБАВИТЬКДАТЕ(КадроваяИсторияСотрудниковИнтервальный.ДатаОкончания, ДЕНЬ, 14) >= &ДатаНачала
		|	И НЕ КадроваяИсторияСотрудниковИнтервальный.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_02_ДанныеКалендаря.Дата КАК Дата,
		|	ВТ_02_ДанныеКалендаря.Местоположение КАК Подразделение,
		|	ВТ_05_КадроваяИсторияСотрудников.Сотрудник КАК Сотрудник,
		|	ВТ_05_КадроваяИсторияСотрудников.ВнешнееСовместительство КАК ВнешнееСовместительство,
		|	ВТ_05_КадроваяИсторияСотрудников.Организация КАК Организация
		|ПОМЕСТИТЬ ВТ_06_Врем
		|ИЗ
		|	ВТ_02_ДанныеКалендаря КАК ВТ_02_ДанныеКалендаря
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_05_КадроваяИсторияСотрудников КАК ВТ_05_КадроваяИсторияСотрудников
		|		ПО ВТ_02_ДанныеКалендаря.Дата >= ВТ_05_КадроваяИсторияСотрудников.ДатаНачала
		|			И ВТ_02_ДанныеКалендаря.Дата < ВТ_05_КадроваяИсторияСотрудников.ДатаОкончания
		|			И ВТ_02_ДанныеКалендаря.ПодразделениеСсылка = ВТ_05_КадроваяИсторияСотрудников.Подразделение
		|ГДЕ
		|	ВТ_02_ДанныеКалендаря.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_06_Врем.Дата КАК Дата,
		|	ВТ_06_Врем.Подразделение КАК Подразделение,
		|	ВТ_06_Врем.Сотрудник КАК Сотрудник,
		|	ВТ_06_Врем.ВнешнееСовместительство КАК ВнешнееСовместительство,
		|	ВТ_04_Состояния.Сотрудник КАК СотрудникНеПодлежитВключению,
		|	ВТ_06_Врем.Организация КАК Организация
		|ПОМЕСТИТЬ ВТ_07_Итог
		|ИЗ
		|	ВТ_06_Врем КАК ВТ_06_Врем
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_04_Состояния КАК ВТ_04_Состояния
		|		ПО ВТ_06_Врем.Сотрудник = ВТ_04_Состояния.Сотрудник
		|			И ВТ_06_Врем.Дата >= ВТ_04_Состояния.Период
		|			И ВТ_06_Врем.Дата < ВТ_04_Состояния.ДействуетДо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_07_Итог.Дата КАК Дата,
		|	"" ППФ Страхование жизни ООО"" КАК Подразделение,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_07_Итог.Сотрудник) - КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_07_Итог.ВнешнееСовместительство) КАК СписочнаяЧисленность,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_07_Итог.СотрудникНеПодлежитВключению) КАК НеПодлежитВключению,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_07_Итог.Сотрудник) - КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_07_Итог.ВнешнееСовместительство) - КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_07_Итог.СотрудникНеПодлежитВключению) КАК ПодлежитВключению,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_07_Итог.ВнешнееСовместительство) КАК ВнешнееСовместительство,
		|	0 КАК ДоговорГПХ,
		|	1 КАК Порядок
		|ИЗ
		|	ВТ_07_Итог КАК ВТ_07_Итог
		|ГДЕ
		|	&ФлажокКомпания
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_07_Итог.Дата
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_07_Итог.Дата,
		|	ВТ_07_Итог.Подразделение,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_07_Итог.Сотрудник) - КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_07_Итог.ВнешнееСовместительство),
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_07_Итог.СотрудникНеПодлежитВключению),
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_07_Итог.Сотрудник) - КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_07_Итог.ВнешнееСовместительство) - КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_07_Итог.СотрудникНеПодлежитВключению),
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_07_Итог.ВнешнееСовместительство),
		|	0,
		|	ВЫБОР
		|		КОГДА ВТ_07_Итог.Подразделение.Наименование = ""г.Москва""
		|			ТОГДА 2
		|		ИНАЧЕ ВТ_07_Итог.Подразделение.Наименование
		|	КОНЕЦ
		|ИЗ
		|	ВТ_07_Итог КАК ВТ_07_Итог
		|ГДЕ
		|	(ВТ_07_Итог.Подразделение.Наименование = ""г.Москва""
		|				И &ФлажокМосква
		|			ИЛИ НЕ ВТ_07_Итог.Подразделение.Наименование = ""г.Москва""
		|				И &ФлажокАгенства)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_07_Итог.Дата,
		|	ВТ_07_Итог.Подразделение,
		|	ВЫБОР
		|		КОГДА ВТ_07_Итог.Подразделение.Наименование = ""г.Москва""
		|			ТОГДА 2
		|		ИНАЧЕ ВТ_07_Итог.Подразделение.Наименование
		|	КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок,
		|	Дата
		|ИТОГИ
		|	СРЕДНЕЕ(ПодлежитВключению),
		|	СРЕДНЕЕ(ВнешнееСовместительство)
		|ПО
		|	Подразделение
		|";
		
		
		
	Иначе // отладка
		Возврат "
		|ВЫБРАТЬ
		|	ПодразделенияОрганизаций.Ссылка КАК ПодразделениеСсылка,
		|	ДополнительныеСведения.Значение КАК Местоположение
		|ПОМЕСТИТЬ ВТ_ОбособленныеПодразделения
		|ИЗ
		|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|		ПО ПодразделенияОрганизаций.Ссылка = ДополнительныеСведения.Объект
		|			И (ДополнительныеСведения.Свойство.Наименование = ""Местонахождение (Подразделения)"")
		|ГДЕ
		|	ПодразделенияОрганизаций.Сформировано
		|	И ПодразделенияОрганизаций.ДатаСоздания < &ДатаОкончания
		|	И (НЕ ПодразделенияОрганизаций.Расформировано
		|			ИЛИ ПодразделенияОрганизаций.ДатаРасформирования > &ДатаНачала)
		|	И (ПодразделенияОрганизаций.Ссылка = &Подразделение
		|			ИЛИ &Подразделение = &ПустаяСсылкаПодразделение)
		|	И (&ФлажокКомпания
		|			ИЛИ &ФлажокМосква
		|				И ДополнительныеСведения.Значение.Наименование = ""г.Москва""
		|			ИЛИ &ФлажокАгенства
		|				И НЕ ДополнительныеСведения.Значение.Наименование = ""г.Москва"")
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеПроизводственногоКалендаря.Дата КАК Дата,
		|	ДанныеПроизводственногоКалендаря.ВидДня КАК ВидДня,
		|	ВТ_ОбособленныеПодразделения.ПодразделениеСсылка КАК ПодразделениеСсылка,
		|	ВТ_ОбособленныеПодразделения.Местоположение КАК Местоположение
		|ПОМЕСТИТЬ ВТ_ДанныеКалендаря
		|ИЗ
		|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря,
		|	ВТ_ОбособленныеПодразделения КАК ВТ_ОбособленныеПодразделения
		|ГДЕ
		|	ДанныеПроизводственногоКалендаря.Дата МЕЖДУ ДОБАВИТЬКДАТЕ(&ДатаНачала, ДЕНЬ, -14) И ДОБАВИТЬКДАТЕ(&ДатаОкончания, ДЕНЬ, 14)
		|	И ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = &ПроизводственныйКалендарь
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТекущиеКадровыеДанныеСотрудников.Сотрудник КАК Сотрудник,
		|	ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения КАК ДатаУвольнения,
		|	МИНИМУМ(КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(ВТ_ДанныеКалендаря.Дата, ДЕНЬ, -1), ДЕНЬ)) КАК ДатаИсключенияИзОтчета
		|ПОМЕСТИТЬ ВТ_ДатыИсключенияИзОтчета
		|ИЗ
		|	РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДанныеКалендаря КАК ВТ_ДанныеКалендаря
		|		ПО ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения < ВТ_ДанныеКалендаря.Дата
		|			И (ВТ_ДанныеКалендаря.ВидДня В (&ВидДняРабочий))
		|ГДЕ
		|	ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения > ДОБАВИТЬКДАТЕ(&ДатаНачала, ДЕНЬ, -14)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения,
		|	ТекущиеКадровыеДанныеСотрудников.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СостоянияСотрудников.Сотрудник КАК Сотрудник,
		|	СостоянияСотрудников.Период КАК Период,
		|	ВЫБОР
		|		КОГДА СостоянияСотрудников.ДействуетДо = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА &Дата3999
		|		ИНАЧЕ КОНЕЦПЕРИОДА(СостоянияСотрудников.ДействуетДо, ДЕНЬ)
		|	КОНЕЦ КАК ДействуетДо
		|ПОМЕСТИТЬ ВТ_Состояния
		|ИЗ
		|	РегистрСведений.СостоянияСотрудников КАК СостоянияСотрудников
		|ГДЕ
		|	СостоянияСотрудников.Состояние В (ЗНАЧЕНИЕ(Перечисление.СостоянияСотрудника.ОтпускПоБеременностиИРодам), ЗНАЧЕНИЕ(Перечисление.СостоянияСотрудника.ОтпускПоУходуЗаРебенком))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КадроваяИсторияСотрудниковИнтервальный.Сотрудник КАК Сотрудник,
		|	НАЧАЛОПЕРИОДА(КадроваяИсторияСотрудниковИнтервальный.ДатаНачала, ДЕНЬ) КАК ДатаНачала,
		|	ВЫБОР
		|		КОГДА КадроваяИсторияСотрудниковИнтервальный.ДатаОкончания = &Дата3999
		|			ТОГДА КадроваяИсторияСотрудниковИнтервальный.ДатаОкончания
		|		КОГДА ЕСТЬNULL(ВТ_ДатыИсключенияИзОтчета.ДатаУвольнения, &Дата3999) = НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(КадроваяИсторияСотрудниковИнтервальный.ДатаОкончания, ДЕНЬ, -1), ДЕНЬ)
		|			ТОГДА ВТ_ДатыИсключенияИзОтчета.ДатаИсключенияИзОтчета
		|		ИНАЧЕ КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(КадроваяИсторияСотрудниковИнтервальный.ДатаОкончания, ДЕНЬ, -1), ДЕНЬ)
		|	КОНЕЦ КАК ДатаОкончания,
		|	ЕСТЬNULL(ВТ_ОбособленныеПодразделения.ПодразделениеСсылка, КадроваяИсторияСотрудниковИнтервальный.Подразделение) КАК Подразделение,
		|	ВЫБОР
		|		КОГДА ВидыЗанятостиСотрудниковСрезПоследних.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.Совместительство)
		|			ТОГДА ВидыЗанятостиСотрудниковСрезПоследних.Сотрудник
		|		ИНАЧЕ NULL
		|	КОНЕЦ КАК ВнешнееСовместительство,
		|	КадроваяИсторияСотрудниковИнтервальный.ГоловнаяОрганизация КАК Организация
		|ПОМЕСТИТЬ ВТ_КадроваяИсторияСотрудников
		|ИЗ
		|	РегистрСведений.КадроваяИсторияСотрудниковИнтервальный КАК КадроваяИсторияСотрудниковИнтервальный
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДатыИсключенияИзОтчета КАК ВТ_ДатыИсключенияИзОтчета
		|		ПО КадроваяИсторияСотрудниковИнтервальный.Сотрудник = ВТ_ДатыИсключенияИзОтчета.Сотрудник
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ОбособленныеПодразделения КАК ВТ_ОбособленныеПодразделения
		|		ПО КадроваяИсторияСотрудниковИнтервальный.Подразделение = ВТ_ОбособленныеПодразделения.ПодразделениеСсылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ВидыЗанятостиСотрудников.СрезПоследних(&ДатаОкончания, НЕ ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.ВнутреннееСовместительство)) КАК ВидыЗанятостиСотрудниковСрезПоследних
		|		ПО КадроваяИсторияСотрудниковИнтервальный.Сотрудник = ВидыЗанятостиСотрудниковСрезПоследних.Сотрудник
		|ГДЕ
		|	КадроваяИсторияСотрудниковИнтервальный.ДатаНачала <= &ДатаОкончания
		|	И ДОБАВИТЬКДАТЕ(КадроваяИсторияСотрудниковИнтервальный.ДатаОкончания, ДЕНЬ, 14) >= &ДатаНачала
		|	И НЕ КадроваяИсторияСотрудниковИнтервальный.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ДанныеКалендаря.Дата КАК Дата,
		|	ВТ_ДанныеКалендаря.Местоположение КАК Подразделение,
		|	ВТ_КадроваяИсторияСотрудников.Сотрудник КАК Сотрудник,
		|	ВТ_КадроваяИсторияСотрудников.ВнешнееСовместительство КАК ВнешнееСовместительство,
		|	ВТ_КадроваяИсторияСотрудников.Организация КАК Организация,
		|	ВТ_ДанныеКалендаря.ПодразделениеСсылка КАК ПодразделениеСсылка
		|ПОМЕСТИТЬ ВТ_Врем
		|ИЗ
		|	ВТ_ДанныеКалендаря КАК ВТ_ДанныеКалендаря
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КадроваяИсторияСотрудников КАК ВТ_КадроваяИсторияСотрудников
		|		ПО ВТ_ДанныеКалендаря.Дата >= ВТ_КадроваяИсторияСотрудников.ДатаНачала
		|			И ВТ_ДанныеКалендаря.Дата < ВТ_КадроваяИсторияСотрудников.ДатаОкончания
		|			И ВТ_ДанныеКалендаря.ПодразделениеСсылка = ВТ_КадроваяИсторияСотрудников.Подразделение
		|ГДЕ
		|	ВТ_ДанныеКалендаря.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Врем.Дата КАК Дата,
		|	ВТ_Врем.Подразделение КАК Подразделение,
		|	ВТ_Врем.Сотрудник КАК Сотрудник,
		|	ВТ_Врем.ВнешнееСовместительство КАК ВнешнееСовместительство,
		|	ВТ_Состояния.Сотрудник КАК СотрудникНеПодлежитВключению,
		|	ВТ_Врем.Организация КАК Организация,
		|	ВТ_Врем.ПодразделениеСсылка КАК ПодразделениеСсылка
		|ПОМЕСТИТЬ ВТ_Итог
		|ИЗ
		|	ВТ_Врем КАК ВТ_Врем
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Состояния КАК ВТ_Состояния
		|		ПО ВТ_Врем.Сотрудник = ВТ_Состояния.Сотрудник
		|			И ВТ_Врем.Дата >= ВТ_Состояния.Период
		|			И ВТ_Врем.Дата < ВТ_Состояния.ДействуетДо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Итог.Дата КАК Дата,
		|	"" ППФ Страхование жизни ООО"" КАК Подразделение,
		|	ВЫБОР
		|		КОГДА ВТ_Итог.Сотрудник = ВТ_Итог.ВнешнееСовместительство
		|			ТОГДА NULL
		|		ИНАЧЕ ВТ_Итог.Сотрудник
		|	КОНЕЦ КАК СписочнаяЧисленность,
		|	ВЫБОР
		|		КОГДА ВТ_Итог.Сотрудник = ВТ_Итог.СотрудникНеПодлежитВключению
		|			ТОГДА ВТ_Итог.Сотрудник
		|		ИНАЧЕ NULL
		|	КОНЕЦ КАК НеПодлежитВключению,
		|	ВЫБОР
		|		КОГДА ВТ_Итог.Сотрудник = ВТ_Итог.ВнешнееСовместительство
		|				ИЛИ ВТ_Итог.Сотрудник = ВТ_Итог.СотрудникНеПодлежитВключению
		|			ТОГДА NULL
		|		ИНАЧЕ ВТ_Итог.Сотрудник
		|	КОНЕЦ КАК ПодлежитВключению,
		|	ВЫБОР
		|		КОГДА ВТ_Итог.Сотрудник = ВТ_Итог.ВнешнееСовместительство
		|			ТОГДА ВТ_Итог.Сотрудник
		|		ИНАЧЕ NULL
		|	КОНЕЦ КАК ВнешнееСовместительство,
		|	0 КАК ДоговорГПХ,
		|	ЕСТЬNULL(ВТ_Итог.Сотрудник.ФизическоеЛицо.ФИО, ""яяя"") КАК СотрудникФизическоеЛицоФИО,
		|	1 КАК Порядок,
		|	ВТ_Итог.ПодразделениеСсылка КАК ПодразделениеСсылка
		|ИЗ
		|	ВТ_Итог КАК ВТ_Итог
		|ГДЕ
		|	&ФлажокКомпания
		|	И НЕ ВТ_Итог.Сотрудник ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_Итог.Дата,
		|	ВТ_Итог.Подразделение,
		|	ВЫБОР
		|		КОГДА ВТ_Итог.Сотрудник = ВТ_Итог.ВнешнееСовместительство
		|			ТОГДА NULL
		|		ИНАЧЕ ВТ_Итог.Сотрудник
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВТ_Итог.Сотрудник = ВТ_Итог.СотрудникНеПодлежитВключению
		|			ТОГДА ВТ_Итог.Сотрудник
		|		ИНАЧЕ NULL
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВТ_Итог.Сотрудник = ВТ_Итог.ВнешнееСовместительство
		|				ИЛИ ВТ_Итог.Сотрудник = ВТ_Итог.СотрудникНеПодлежитВключению
		|			ТОГДА NULL
		|		ИНАЧЕ ВТ_Итог.Сотрудник
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВТ_Итог.Сотрудник = ВТ_Итог.ВнешнееСовместительство
		|			ТОГДА ВТ_Итог.Сотрудник
		|		ИНАЧЕ NULL
		|	КОНЕЦ,
		|	0,
		|	ЕСТЬNULL(ВТ_Итог.Сотрудник.ФизическоеЛицо.ФИО, ""яяя""),
		|	ВЫБОР
		|		КОГДА ВТ_Итог.Подразделение.Наименование = ""г.Москва""
		|			ТОГДА 2
		|		ИНАЧЕ ВТ_Итог.Подразделение.Наименование
		|	КОНЕЦ,
		|	ВТ_Итог.ПодразделениеСсылка
		|ИЗ
		|	ВТ_Итог КАК ВТ_Итог
		|ГДЕ
		|	(ВТ_Итог.Подразделение.Наименование = ""г.Москва""
		|				И &ФлажокМосква
		|			ИЛИ НЕ ВТ_Итог.Подразделение.Наименование = ""г.Москва""
		|				И &ФлажокАгенства)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок,
		|	Дата,
		|	СотрудникФизическоеЛицоФИО
		|ИТОГИ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СписочнаяЧисленность),
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НеПодлежитВключению),
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПодлежитВключению),
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВнешнееСовместительство)
		|ПО
		|	Подразделение,
		|	Дата
		|";

	КонецЕсли;
КонецФункции

